{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Knowledge Garden","n":0.707},"1":{"v":"\n#### My Second Brain\n\n---\n\nA collection of my notes around all things software development.\n\n> This website is generated by a Dendron template. For more information, see the [template README file](https://github.com/dendronhq/template.publish.github/).\n","n":0.186}}},{"i":2,"$":{"0":{"v":"Web","n":1}}},{"i":3,"$":{"0":{"v":"Search Engine Optimization (SEO)","n":0.5},"1":{"v":"\nGeneral guide for achieving good SEO for website:\n\nThree Pillars of optimization according to NextJS:\n1. **Technical** - optimization/performance of the website\n2. **Creation** - ensuring optimal content creation to target specific keywords\n3. **Popularity** - Using backlinks (third party sites linked back to your own) so that search engines know you are a trusted source. Having an online presence. \n\n\n**Web crawlers** are a type of bot that mimic end users and navigate links found on websites in order to perform indexing for search engines. They identify themselves through custom [user-agents](https://developers.google.com/search/docs/advanced/crawling/overview-google-crawlers). \n\n\n#### Notes on improving SEO\n- Build a sitemap\n- Use SSR or SSGs - see [[web.frontend.rendering-strategies]]. SPAs usually don't use url paths and loading time is not ideal for a crawler.\n- Use metadata such as `<title>` and `<meta name=\"description\" content=\"A good description here\">` on every page\n  -  robot tags are directives search engines will respect e.g. `<meta name=\"robots\" content=\"noindex,nofollow\">` . These meta tags can be produced on demand as opposed to robots.txt\n  - canonical tags to prevent the detection of duplicate content\n- Ensure good performance e.g. response time\n- Use alt for images\n- Use meaningful status codes\n   - 200 in general\n   - 301 for redirects to indicate permanently moved. Next JS Uses 308 redirects instead to preserve request methods used. 302 and 301s change the request method of the redirect to a GET\n- Use semantic HTML - the correct and most relevant tags\n- Use a good URL structure e.g. semantic urls /learn/nextjs-app-course vs /courses/1\n\nIn November 2020, Google added three new metrics to their page experience signals called Core Web Vitals:\n\n- Largest Contentful Paint (LCP) - The amount of time it takes to render the largest content element within the viewable area of the screen e.g. featured image\n- First Input Delay (FID) - the time between the first users input and when the page responds (responsiveness)\n- Cumulative Layout Shift (CLS) - visual stability of a page - checking for \"janky-ness\" where the screen shifts\n\n### Largest Contentful Paint (LCP)\n\nCommon causes of poor LCP:\n\n- **Slow server response times **- The first thing to look at is Time to First Byte (TFFB) and see if that can be improved.\n\n- **Render blocking JS and CSS** - style sheets and javascript imports will block the HTML parser. Defer any non-critical JavaScript & CSS. CSS and JS files can be minified.\n\n- Slow resource load times - optimize and compress images\n\n- Client side rendering - If you're building a site that is mostly rendered on the client, you should be wary of the effect it can have on LCP if a large JS bundle is used.\n\n### References\n\n1. https://nextjs.org/learn/seo/crawling-and-indexing/status-codes\n2. https://nextjs.org/learn/seo/rendering-and-ranking/rendering-strategies","n":0.048}}},{"i":4,"$":{"0":{"v":"Project Checklist","n":0.707},"1":{"v":"\nCreating a new project considerations, particularly for a javascript full-stack application.\n","n":0.302}}},{"i":5,"$":{"0":{"v":"pixiJS","n":1},"1":{"v":"\nNotes on PIXI JS\n\n- A Container is the most basic class you have. It has no graphical representation but it's used to group objects as a unit\n- A Sprite is the simplest way to show a bitmap on your screen.\n- Sprites can show graphics and Containers are used to group sprites to move, rotate and scale them as a whole.\n- You can add containers to other containers.\n- The root of everything is the Stage. The stage is the regular container the application class creates and feeds to the Renderer to render\n- Anything shown on the screen must inherit from the abstract class `DisplayObject` e.g. Sprite, Container all inherit from this class\n- A DisplayObject can only have one parent\n- A Particle Container is a special kind of container designed to go fast.\n- Graphics allows you to make primitive drawings like rectangles, circles and lines. It's useful for simple graphics without a bitmap file.\n- Ticker is an object that will call a function every frame before rendering\n","n":0.078}}},{"i":6,"$":{"0":{"v":"JavaScript","n":1}}},{"i":7,"$":{"0":{"v":"Commonjs","n":1},"1":{"v":"\nCommonJS\n","n":1}}},{"i":8,"$":{"0":{"v":"Frontend","n":1}}},{"i":9,"$":{"0":{"v":"Web Components","n":0.707},"1":{"v":"\nWeb components allow you to create custom reusable and encapuslated HTML tags to be used in web pages and apps. They are capable of isolating CSS and JavaScript similar to `<iframe>` - known as a **shadown DOM**. These are framework agnostic and are supported by most modern browsers.\n\nExample:\n\n```JavaScript\n// CREATE\nclass MyButton extends HTMLElement {...}\nwindow.customElements.define('my-button', MyButton);\n\n// USE\n<my-button></my-button>\n```\n\n### Web Components vs React\n\nAccording to [React documentation](https://reactjs.org/docs/web-components.html#:~:text=React%20and%20Web%20Components%20are,The%20two%20goals%20are%20complementary.), Web Components and React solve different problems. React is a declarative JS library to address state management and web app \"reactivity\". Web components exist to address reusability and encapsulation of HTML elements. React components can only be used in React, where as web components can be used anywhere e.g. across different libraries - Vue, React, Angular etc.\n","n":0.092}}},{"i":10,"$":{"0":{"v":"Rendering Design Patterns / Strategies","n":0.447},"1":{"v":"\n## CSR (Client-Side Rendering) / SPA (Single Page Application)\n\n> the data is fetched after every single render\n\nMost common way of using frameworks such as React, vue, ember etc.\n\nClient-side rendering means that a website’s JavaScript is rendered in your browser, rather than on the website’s server.\n\n- The server renders a blank page with a script tag pointing to the apps bundle\n- blank page is sent to the clients browser which makes the relevant api calls and renders the contents of the page\n\nstrengths:\n\n- renders fast on the server\n\nweaknesses:\n\n- no initial render - customer/client has to render so if the app is big it could be a problem\n\n- empty body - no content to crawl for a search engine - ** SEO is the biggest weak point **\n\n## SSR (Server Side Rendering)\n\n> the data is fetched before every single render\n\nWhen the user makes a request to the webpage, the server prepares the html page and then sends it back.\n\n## SSG (Static-Site Generating)\n\n> the data is fetched once at build time\n\nPage is also generated on the server however it is rendered at **build time.**\n\n## ISR (Incremental Static Regeneration)\n\n> the data is fetched once on build time and will be fetched again after a certain cooldown and served on the second visit.\n\nAllows you to create or update static pages after you've built your site. This gives you the benefit of using static generation without needing to rebuild the entire site.\n\n## When to use what?\n\n- Is your content dynamic or relatively static?\n\n- is SEO important?\n\nHere are some examples from [this article](https://medium.com/codex/web-design-patterns-ssr-ssg-and-spa-fadad7673dfe#:~:text=SSR%20vs%20SSG,I%20use%20SSR%20then%3F%22.)\n\n> For a documentation page or a website that doesn't need to fetch dynamic data, but SEO is important, you could use SSG.\n> For a blog, SEO is important and the content is dynamic. In this case, SSR could be a good candidate.\n> For a CRM (Customer Relationship Manager), SEO is not a concern and the content is dynamic therefore an SPA/CSR would be a good choice.\n\nMany websites will use a combination. These days for anything that is not an SPA, it's often recommended to use SSG practically all of the time unless there is a good reason not to e.g. the website is massive with dynamic content that cannot be pre-rendered as it changes frequently. [Next JS recommends SSG ](https://nextjs.org/docs/basic-features/pages#pre-rendering) for many use cases. The alternative is to use ISR for a website with mostly static content but for a web page with thousands of pages in order to prevent a complete rebuild every time.\n\n> \"We recommend using Static Generation over Server-side Rendering for performance reasons. Statically generated pages can be cached by CDN with no extra configuration to boost performance. However, in some cases, Server-side Rendering might be the only option.\"\n\nSome important considerations:\n\n1. Data Integrity - how fresh do we want the data? CSR and SSR fetch on every render.\n\n2. SEO - SSR, SSG and ISR are SEO friendly given crawlers don't have to wait for a page to load to get relevant data\n3. Performance - SSG and ISR load instantly (for first contentful paint)\n4. Build Time - the amount of time it takes to build and deploy the website is slower for SSG and ISR since we need to build all the pages to serve where as CSR and ISR build pages dynamically.\n\n##### References\n\n1. https://theodorusclarence.com/blog/nextjs-fetch-usecase\n","n":0.043}}},{"i":11,"$":{"0":{"v":"History of Front-End","n":0.577},"1":{"v":"\n## 1989 \nBirth of World Wide Web created by Tim Berners-Lee.\n\n## 1990-1993 - Web 1.0:\n\n  - [First web page](http://info.cern.ch/hypertext/WWW/TheProject.html) is written in HTML and deployed by Berners-Lee and hosted on his NeXT computer. \n  - 1993 -  Tim Berners-Lee writes first version of HTML\n  -  HTMLs `<table>` was the only way to organize a page. No colour blocks, no images, no graphics, just text\n  - web pages had no dynamic content \n  - JS/CSS still in infancy\n  - Major browser players were Netscape and IE\n\n## 1993 - 1999 - Dynamic websites\n  - 1993 -  Common Gateway Interface (CGI) was created allowing webservers to execute programs/scripts as opposed to returning html from a file system.  \n  - 1994 - PHP conceieved and grew in popularity over the years\n  - 1995 - JavaScript is born \n  - 1996 - CSS became available\n  - Web animation introduced with Macromedia Flash (1996)\n  - Websites were only created for desktop browsers (non-responsive)\n\n## 2000s - Web 2.0:\n  - Dynamic HTML - css/js manipulates DOM\n  - Drag n Drop animations\n  - Amazon, Wikipedia, Youtube\n  - Server side vs Client side rendering emerging:\n    - things like myspace - SSR meant that you'd have to refresh the page in order to get a notification as logic existed in the backend\n  - 2006 - JQuery\n\n  \n\n## 2000-2006\n  - Responsive design was trending\n  - Business purposed websites and blogging were trending \n  - As a result CMS' (around since 1990s) were gaining more popularity\n  - WordPress launched in 2003 - still powers around 35.9% of the internet.\n  - Myspace (2003) and Facebook (2004) launched. \n  - Facebook goes public and gains popularity in 2006\n\n\n## Mobile Era (2007-2010)\n  - 2007 - iPhone released \n  - Safari launched - first fully usable HTML browser on a phone\n  - iPhone did not support Flash which influenced it's eventual demise. \n  - Mobile friendly design became a necessity\n\n## 2010 - present\n\n// @todo\n\n\n\n\nReferences:\n1. https://www.youtube.com/watch?v=Kzeog8yTFaE\n2. https://dev.to/snickdx/a-brief-history-of-the-web-9c3\n3. https://tillerdigital.com/blog/the-history-of-web-design/\n","n":0.056}}},{"i":12,"$":{"0":{"v":"Design Systems","n":0.707},"1":{"v":"\nDesign Systems exist to create a source of truth for a product design. Some notable design systems:\n\n1. Google's [Material UI](https://material.io/)\n2. [Atlassian](https://atlassian.design/)\n3. IAG's [Chroma](https://chromadesignsystem.com/)\n\n### Design Tokens\n\nDesign tokens are a way to store styles so that they can be re-used by any platform e.g. web or mobile\n\n#### References\n\n1. https://zure.com/blog/collaboration-with-design-tokens-and-storybook/\n","n":0.146}}},{"i":13,"$":{"0":{"v":"Frameworks","n":1},"1":{"v":"\nGeneral notes about various new/hot JS frameworks and their differences\n\n## Rendering\n\n**React** - starts from the top and any update to state will re-renders all the way down the component tree\n\n**Solid** or **Qwik**: Change in state is not associated with a component rather directly with a DOM node.\n\n## Pre-rendering\n\n**React and Solid** : Hydrate the html sent to the client\n\n**Qwik** : Serialize the reactivity graph at the server, effectively lowering time to interactive (TTI)\n\n## Interactivity\n\n**React**: All components re-execute on state change from interactivity\n**Solid** or **Qwik**: Only execute at the event handle\n\nImagining a simple app where Counter is the parent and Display/Increment are children that display and update parent state:\n![https://www.builder.io/blog/resumability-vs-hydration?ck_subscriber_id=1441143038#client-side-rendering](/assets/images/2023-02-13-20-59-56.png)\n\n## Resumability\n\nQwik uses 'resumability' as opposed to hydration which is a way to recover state without re-executing the application components on the client. This is done by serializing everything required e.g. html and event listeners, for the client to resume where the server left off.\n","n":0.081}}},{"i":14,"$":{"0":{"v":"Backend","n":1}}},{"i":15,"$":{"0":{"v":"Database","n":1},"1":{"v":"\n## Types\n\n### Relational (SQL)\n\nInformation is stored in tables, in rows and columns. Tables usually have relationships with other tables.\n\nStructured Query Language (SQL) is used to interact with relational databases.\n\nExamples:\n\n- Microsoft SQL Server\n- MySQL\n- PostgresSQL\n\nAdvantages of using a relational database include:\n\n**ACID Compliance**\n\nAtomicity, Consistency, Isolation, Durability (ACID) is a standard that guarantees the reliability of database transactions. ACID transactions are a group of database operations that succeed only if all the operations within succeed. This ensures that the database remains in a consistent state and there are no dangling incomplete mutations.\n\nTo understand this, we can think of a bank transfer where we transfer from one account to another. Here we expect that in our first account, we expect both accounts to reflect a new transaction e.g. $100 from ACC1 to ACC2:\n\n```SQL\nUPDATE bankaccounts SET funds=funds-100 WHERE accountno='ACC1';\nUPDATE bankaccounts SET funds=funds+100 WHERE accountno='ACC2';\n```\n\nIf our second statement were to fail, the accuracy of the database would be compromised. In order to fix this, we use a transaction:\n\n```SQL\nSTART TRANSACTION or BEGIN; -- Wrap the statements in a transaction\nUPDATE bankaccounts SET funds=funds-100 WHERE accountno='ACC1'; --statement2\nUPDATE bankaccounts SET funds=funds+100 WHERE accountno='ACC2'; --statement3\nCOMMIT; -- COMMIT to DB once all statements pass successfully\n```\n\n**Data Accuracy**\n\nPrimary and foreign keys ensure there is no duplication.\n\n### Non-relational (No SQL)\n\n### Relational or Non-relational?\n\n#### References\n\n1. https://www.softwaretestinghelp.com/mysql-transaction-tutorial/\n2. https://www.mongodb.com/basics/acid-transactions\n3. https://www.mongodb.com/compare/relational-vs-non-relational-databases\n","n":0.069}}},{"i":16,"$":{"0":{"v":"API Architecture","n":0.707},"1":{"v":"\nA note describing some of the different API architectures/protocols, namely RPC, REST and GraphQL.\n\n## RPC - Remote Procedure Call\n\nEarliest API architecture. Remote Procedure Call (RPC), as the name implies, calls a remote \"[procedure](programming-paradigms#procedural-programming,1:#*)\" or a function e.g. from a client application to the API on a server.\n\nHow the procedure/function is invoked on the server depends on the framework and choice of technology adopted. RPC is just a concept, and in a simple scenario, the method called could be determined by simply parsing query parameters from the url coming from the client and performing a string comparison, matching the method from the client to the server.\n\nA contrived example where a client invokes the API to perform mathematical operations on two numbers 'a' and 'b' and return the result:\n\n```Javascript\n/** Server API **/\nconst express = require('express')\nconst app = express()\nconst port = 3000\n\napp.get('/',(req, res) => {\n  // extract the method being called from the query params\n  // URL is in the format http(s)://<host>/method=<methodName>&b=<b>&c=<c>\n  const { method } = req.query;\n  const a = parseInt(req.query.a);\n  const b = parseInt(req.query.b);\n\n  let methodResponse = \"\";\n\n  // call the method requested - here we do a simple string comparison\n  // so that it appears the FE and BE \"share\" procedures\n  switch(method) {\n     case \"add\":\n     \tmethodResponse = add(a,b);\n        break;\n     case \"multiply\":\n     \tmethodResponse = multiply(a,b);\n        break;\n     case \"minus\":\n     \tmethodResponse = minus(a,b);\n\tbreak;\n     default:\n        methodResponse = \"method doesn't exist\";\n\n  }\n\n  res.send({ result: methodResponse });\n})\n\nfunction add(a, b) {\n  return a + b;\n}\n\nfunction multiply(a, b) {\n  return a * b;\n}\n\nfunction minus(a, b) {\n  return a - b;\n}\napp.listen(port, () => {\n  console.log(`Example app listening on port ${port}`);\n})\n\n```\n\nA client can communicate to the above API application as follows:\n\n```bash\nGET http://localhost:3000/?method=multiply&a=4&b=2\n{output: 8} #response recieved\n\n```\n\n### Disadvantages\n\n**Tight coupling** - RPCs client and server are tightly coupled since function calls need to match.\n\n**Leaking internal implementation** - It may be considered a flaw that the inner workings of the API are somewhat revealed to the client as the backend method names may be \"telling\".\n\n**Extensibility of methods is difficult** - it's often the case that in RPC API's, a procedure may not perform the exact functionality and hence another method that does something slightly different is added. In this case, there is an overload of similar functions which can be messy:\n\n```javascript\nfunction multiply() {\n  // does something\n}\n\nfunction multiplyV2() {\n  // does something similar to multiply() but different\n}\n\nfunction multiplyV3() {\n  // etc\n}\n```\n\n### Advantages\n\n**Lightweight** - RPC APIs are expected not to return a lot of meta data and the most popular frameworks such as gRPC are built in such a way that allows them to be more performant than their REST counterpart.\n\n**Action-oriented** - RPCs are good for action oriented applications where we are calling 'commands' rather than focusing on resources.\n\n### gRPC\n\nOne of the most notable examples of RPC frameworks in modern day is [gRPC](https://grpc.io/). gRPC is an open-source Google framework used for high performance microservice architecture styles. It's supported by multiple languages/frameworks such as Go, Node, Rust Python and more. It's used by many well known tech companies such as Square, Netlfix and [Cloudflare](https://blog.cloudflare.com/road-to-grpc/).\n\ngRPC is considered highly performant due to:\n\n- Using HTTP/2 for transport\n- Allowing both clients and servers to stream data as opposed to polling (_Note: I believe this is available due to HTTP/2_)\n- Encouraging **Protobuf** as the messaging format\n\nProtobuf (protocol buffers) are a message format that allow for serialization of structured data in a language neutral way. They are an alternative messaging format to others such as JSON or XML and are considered more compact to achieve low latency.\n\nExample of a Protobuf message:\n\n```Protobuf\n// Person.proto\nmessage Person {\n  required string name = 1;\n  required int32 age = 2;\n  optional string email = 3;\n}\n```\n\nProtobufs are encoded in such a way that makes them lightweight and performant.\n\n![](/assets/images/2022-03-03-10-51-00.png)\n\n<caption>Source: https://developers.google.com/protocol-buffers/docs/overview#work</caption>\n<br>\n<br>\n\ngRPC can be implemented using a variety of languages or frameworks, however it seems performance varies - multiple language performance tests are [performed often](https://grpc.io/docs/guides/benchmarking/) on the code base. Note that the [performance dashboard](https://grafana-dot-grpc-testing.appspot.com/?kiosk=tv) is missing Node however, it has been [benchmarked by 3rd parties](https://www.nexthink.com/blog/comparing-grpc-performance/) and _appears_ to be less performant than alternatives such as Go.\n\ngRPC currently cannot natively communicate with the web via HTML/2. Browsers do not support protobuf payloads and hence, grpc-web was introduced in order to act as a proxy to serialize web payload and give developers the ability to use protobufs across the full stack:\n\n![https://grpc.io/blog/state-of-grpc-web/](/assets/images/2022-03-03-10-13-17.png)\n\n<caption>Source: https://grpc.io/blog/state-of-grpc-web/</caption>\n\n</br>\n</br>\nPrior to this, developers would likely use REST APIs with HTTP to communicate with the gRPC backend.\n\n## REST\n\n**Re**presentational **s**tate **t**ransfer (REST) API is an architectural style created by Roy Fielding, described famously in his [dissertation](https://www.ics.uci.edu/~fielding/pubs/dissertation/rest_arch_style.htm).\n\nREST is commonly not adhered to when implemented as many APIs do not tick the architectural constraints that make an API \"RESTful\". There are **6 constraints** which make a web service truly RESTful:\n\n1. **Uniform Interface**\n\nWhat distinguishes REST is uniform interface whereby the client and server are decoupled in such a way that allows them tfcv o evolve independently. Having this interface provides the client with enough information to retrieve the relevant data without having to understand the underlying implementation. This concept is achieved through these four principles:\n\n- **Identification of resources** - where RPCs are command or action oriented, REST APIs are modeled around resources. For example, users in a rest API are handled via the URI `/user`\n\n- **Manipulation of resources through representations** - When a client holds a representation of a resource, including any metadata attached, it has enough information to modify or delete the resource on the server. This makes REST APIs **discoverable** in that from the root of the API, the client has enough information to perform any available action on the available resources.\n\n- **self-descriptive messages** - Each message includes enough information to describe how to process the message. For example, by using standard [MIME Types](https://en.wikipedia.org/wiki/Media_type#cite_note-10) e.g. `application/json`, . Responses also explicitly indicate their cache-ability. e.g. `Cache-Control: max-age=31536000`\n\n- **hypermedia as the engine of application state (HATEOAS)** - allows the client to dynamically navigate to the appropriate resources by traversing the hypermedia links. For example, a call to `GET http://localhost:8080/users` could return:\n\n```JSON\n\n\n```\n\n#### References\n\n1. https://blog.jscrambler.com/rpc-style-vs-rest-web-apis\n2. https://grpc.io/\n3. https://www.restapitutorial.com/lessons/whatisrest.html#\n","n":0.032}}},{"i":17,"$":{"0":{"v":"Auth","n":1},"1":{"v":"\nAuth options:\n\nSupabase\n\nNextAuth\n\nAuth0\n","n":0.707}}},{"i":18,"$":{"0":{"v":"Reactive Programming","n":0.707},"1":{"v":"\n**Reactive Programming** is a design paradigm that is programming with asynchronous data streams. These data/event streams are observable and can be used to trigger \"side-effects\". A simple example of this is a click event. In an application we can fire effects upon the trigger of a user click by observing that event.\n\n[The Gang of Four](https://en.wikipedia.org/wiki/Design_Patterns) famously defined two patterns that became fundamental to the focus of reactive programming:\n\n- Iterator - the consumer pulls data out of the producer (imperative - consumer is in control)\n- Observer - a way for a producer to give the consumer one item at a time (declarative - producer is in control)\n\nThe book misses what is the correspondence between these two patterns: The iterator pattern allows you to pull data out and the producer lets the consumer know when there is no more data AND if an error occurred. These two semantics were left out of the observer pattern by the GoF.\n\nReactive programming is about unifying the observable type with the iterator type and therefore produces this new type known as the \"observable\". The benefit of this is now we can react in the way we do to static data to dynamic events in real time.\n\nBy adding these two completion semantics of the two patterns, we can now use all the ways we know when it comes to how to transform streams of data that we can pull on the streams that we pull e.g. map, filter, reduce, zip, merge etc.\n\nThe advantage of this is now event data does not need to be stored anywhere when it comes to processing. Meaning we don't need to have big data stores that we pull from in order to process data - we can take the data as it arrives, process it and be on our way. We allocate less memory this way. If you can write a sql query to transform data in a temporary table somewhere, you can now write a sql query over live data. It's all about serving the consumer faster. [^3]\n\n#### References:\n\n1.  https://gist.github.com/staltz/868e7e9bc2a7b8c1f754\n2.  https://dev.to/this-is-learning/what-the-hell-is-reactive-programming-anyway-31p5\n3.  [Reactive Programming Overview (Jafar Husain from Netflix)](https://www.youtube.com/watch?v=-8Y1-lE6NSA)\n\n[^1]: Quote from https://dev.to/this-is-learning/what-the-hell-is-reactive-programming-anyway-31p5\n","n":0.053}}},{"i":19,"$":{"0":{"v":"Reactive Programming In Java (Course Notes)","n":0.408},"1":{"v":"\n> These notes are based entirely off the course: [\"Reactive Programming with Java\"](https://www.youtube.com/watch?v=OiRx2pZskR0&list=PLqq-6Pq4lTTYPR2oH7kgElMYZhJd4vOGI&index=5)\n\nThe default programming module in java is known as the blocking programming module. We make a request, it takes time to process, and then it responds. The alternative to this is what is known as Reactive Programming.\n\nIn Java, there are several frameworks that do this, namely:\n\n- Reactor - has the maximum momentum of all the projects and is integrated with spring boot. A lot of cloud providers use it e.g. azure for their apis\n- RxJava\n\nA lot of people confuse reactive with async. Reactive programming doesn't imply it's async as it can by synchronous. A typical or traditional use cases of reactive programming are:\n\n- user events\n- I/O responses e.g. file is completed\n\nReactive Programming is not exactly event driven programming.\n\nWhy do we care:\n\nWhen we think about modern application development, there are things that stand out today:\n\n1. high data scale\n2. high usage scale e..g. lots of users, availability\n3. cloud based costs - when servers were on prem it did not matter as much as cloud as inefficiencies can cost a lot\n\nBefore doing vertical or horizontal scaling, it's often important to optimize the code.\n\nGiven Java is non-blocking, Reactive programming can be seen commonly in JavaScript e.g. Node JS with Promises\n\nImagine a web application where you have a request from a user to retrieve preference:\n\n```Java\n@GetMaping(\"/users/{userId}\")\npublic User getUserDetails(@PathVariable String userId) {\n    User user = userService.getUser(userId);\n    UserPreferences prefs = userPreferenceService.getPreferences(userId);\n    user.setPreferences(prefs);\n    return user;\n}\n```\n\nThis endpoint makes a call to two services which are run sequentially as opposed to in parallel i.e. `userService` call to `getUser` must complete before `getPreference` is triggered via the `userPreferenceService`. This becomes a problem when we consider the requests as spinning up new threads for each user. Given these two services are not dependant on each other, the longevity of the request takes longer and the result is more threads are alive at any given time than necessary. The issue is that we now have wasted resources/hardware.\n\nTraditionally, Java developers don't think about concurrency as spring boot or mvc abstracts and handles it for them. When writing APIs, the mentality of the developer is that this code is handling a single request. Methods are written in a stateless way so each request does not touch another. The cost to this becomes:\n\n1. sequential blocking operations\n2. idling threads\n\nReactive programming is not the only solution. There are concurrency APIs in Java which can handle this. For example, doing the previous `getUserDetails` blocking section using concurrency APIs:\n\n```Java\nCompletableFuture<User> userAsync = CompletableFuture.supplyAsync(() -> userService.getUser(userId));\nCompletableFuture<UserPreferences> userPreferencesAsync = CompletableFuture.supplyAsync(() -> userPreferenceService.getPreferences(userId));\n// combine into a single future\nCompletableFuture<Void> bothFutures = CompletableFuture.allOf(userAsync, userPreferencesAsync)\n// block until they're ready\nBothFutures.join();\n// get the results and put into user\nUser user = userAsync.join();\n// get the results and put into prefs\nUserPreferences prefs = userPreferencesAsync.join();\nuser.setUserPreferences(prefs);\nreturn user;\n```\n\nThis works however it's still causing a thread to idle and that is due to `bothFutures.join()` which, although allows the two services to be called in parallel, still blocks until they are complete. The other problem is this that Future API like the example above is very messy and a lot to work with. This is what Reactive Programming aims to resolves.\n\nThe above example, using Reactive Programming, becomes:\n\n```Java\npublic Mono<User> getUserDetails(@PathVariable String userId) {\n    return userService.getUser(userId)\n        .zipWith(userPreferencesService.getPreferences(userId))\n        .map(tuple -> {\n            User user = tuple.getT1();\n            user.setUserPreferences(tuple.getT2);\n            return user;\n        })\n}\n```\n\nThe difference above to the concurrent approach is:\n\n- much simpler\n- Reusable flexible functions - many of the paradigms can be re-used and applied all over the application\n\nReactive programming is more declarative than imperative. Java has a 'Flow' interface that can be used by reactive programming libraries (in reality it was not adopted as much as was hoped).\n\nReactive programming is not worth it for small projects. The learning curve is big and the benefit only shows when the size of the project is increased.\n\nReactive programming in java may seem familiar when comparing to Java Collections. Java Streams represent a sequence of data, with no concern over the internal representation of the collection, we just focus on the computation of the data. The iteration is also internal and is obfuscated from the programmer.\n\n```Java\nList<Integer> numbers = Arrays.asList(1, 2, 3, 4, 5, 6, 7, 8, 9, 10);\n\n// Traditional loop\nfor (int i = 0; i < numbers.size(); i++) {\n    System.out.println(numbers.get(i));\n}\n\n// Streams\nnumbers.stream().forEach(number -> System.out.println(number))\n```\n\nTypical stream operations: map, filter, flatMap, findFirst and more.\n\nRelevant Design patterns:\n\n- Iterator Pattern - traverse a container and access it's elements. It decouples the algorithms from the container meaning that we don't care about the underlying implementation and that the iterator can take any container and gives us a consistent experience (Collections).\n- Observer Pattern - used to observe an event/number of events and trigger a course of action.\n\nThese two patterns are sort of inverses of each other (push/pull data).\n\n```Java\n// iterator\nmyList.forEach(element -> System.out.println(element)); //push\n// observer\nclicksChannel.addObserver(event -> System.out.println(event)) //pull\n```\n\nThe idea these two use the same module/paradigm is the fundamental idea behind reactive programming.\n\n**Reactive Streams** were introduced in Java 9.\n","n":0.035}}},{"i":20,"$":{"0":{"v":"React","n":1},"1":{"v":"\n## Release 18 Features\n","n":0.5}}},{"i":21,"$":{"0":{"v":"React v18.0","n":0.707},"1":{"v":"\n## Concurrent Rendering\n\nA behind-the-scenes mechanism introduced in React 18 in order to render more seamlessly.\n\nBefore React 18, rendering was a synchronous transaction meaning that once rendering started it could not be interrupted. React 18 introduces features such as suspense and stream server rendering meaning rendering can be interrupted, paused, resumed or abandoned.\n\nThe problem with synchronous rendering is that while a component is re-rendering, the rest of the app becomes unresponsive until it's complete since main thread is blocked. If we picture this being a list that is updated each time the user changes input and the list takes a while to re-render, the other components must wait until it completes making it a janky user experience.\n\n## Automatic Batching\n\n## Transitions\n\n## New Suspense Features\n\n## New Client and Server Rendering API\n\n## New Strict Mode Behaviors\n\n## New Hooks\n","n":0.086}}},{"i":22,"$":{"0":{"v":"Projects","n":1}}},{"i":23,"$":{"0":{"v":"Operation Rewrite","n":0.707},"1":{"v":"\n## Project: Operation Re-write (Purposely obscure)\n\n### Problem:\n\nExisting site is slow and difficult to improve given it's built in wordpress. Gives limited options for improvement from a developer perspective without adding more bloat and plugins. Owned by non-for-profit therefore budget is an important consideration.\n\n### Solution:\n\nRe-write using headless CMS and following JAMSTACK princples.\n\n### Existing stack\n\n- Frontend: PHP\n- Backend: PHP\n- CMS: Wordpress\n- DB: SQL\n\n### Proposed re-architected stack:\n\n- Frontend: React framework\n- Backend - possibly NodeJS with GraphQL\n- CMS: Headless\n- DB: ?? not sure if I need one\n\n### Rendering Style\n\nRef [[web.frontend.rendering-strategies]]\n\nOptions: SSR, SSG, SPA, ISR\n\nContent is mostly static - new blog posts written relatively infrequently. There is an ecommerce section with a small number of products. No comments or anything else that is dynamic at the moment.\n\nSSG could be a good option here but a framework that supports SSR as well could be useful for any future concerns. Maybe best of both worlds and use ISR? No need to rebuild every time we change a post or add a product.\n\n### Framework Options\n\n- Remix - looks good but pretty new\n- Next - established, but maybe bloated for my use case? Needs a server to run for ISR and SSR\n- Gatsby - only does SSG (?)\n\n### Headless CMS Options\n\n- Strapi - free/open source\n- Contentful - recommended but paid after certain point\n\n### DB?\n\nDo I need?\n\n- PSQL\n\n## Build steps\n\n1. Set up CMS\n2. Set up FE\n3. interface the two\n","n":0.066}}},{"i":24,"$":{"0":{"v":"Programming Paradigms","n":0.707},"1":{"v":"\n**Programming paradigm refers to a style of programming.** Programming languages need to follow some strategy when they are implemented known as a paradigm.\n\nThere are two significant paradigms programming languages fall into - **Imperative** and **Declarative**. These categories have various subtypes:\n\n```mermaid\ngraph TD;\n    D[Imperitive]-->P[Procedural];\n    D --> O[Object Oriented]\n```\n\n```mermaid\ngraph TD;\n    D[Declarative]-->L[Logic];\n    D --> F[Functional]\n```\n\n## Imperative\n\nThe word “imperative” comes from the Latin “impero” meaning “I command”. This is the oldest programming paradigm. It effectively means the code is a series of commands executed in order to achieve a result.\n\nImperative tells a program exactly how to do something. For example, if we need a program to print numbers in an array that are less than 10:\n\n```Javascript\n    const nums = [5, 10, 15, 8, 7]\n    let lessThanTen = []\n\n    for(i = 0; i < nums.length; i++) {\n        if(nums[i] < 10) {\n            lessThanTen.push(nums[i]);\n        }\n    }\n\n    // prints [5, 8, 7]\n    console.log(lessThanTen)\n```\n\n## Declarative\n\nDeclarative programming focuses on the end result as opposed to how to get there. For example, if we need a program to print numbers in an array that are less than 10:\n\n```Javascript\n    const nums = [5, 10, 15, 8, 7]\n    // prints [5, 8, 7]\n    console.log(nums.filter(num => num < 10))\n```\n\nReact is a declarative framework as rather than telling it how to render (in the same way you do with vanilla JS), you tell it what you want it to render.\n\n## Types of Imperative Programming\n\n### Procedural Programming\n\nBuilt around the idea that programs are sequences of instructions to be executed - splits up programs into 'procedures' or functions. This is effectively the same as imperative with the idea of using code splitting and enhancing reusability with subroutines.\n\n```Javascript\n    // use a function (procedural)\n    function getNumbersLessThanTen(nums) {\n        let lessThanTen = []\n        for(i = 0; i < nums.length; i++) {\n            if(nums[i] < 10) {\n                lessThanTen.push(nums[i]);\n            }\n        }\n        return lessThanTen\n\n    }\n\n\n    // prints [5, 8, 7]\n    console.log(getNumbersLessThanTen([5, 10, 15, 8, 7]))\n```\n\n### Object-oriented Programming\n\nOOP was introduced in order to overcome procedural programming limitations. In OOP, code is organised into objects and classes. In conventional procedural programming, data was global and there was a difficulty in securing the program from unintended changes. OOP controls access to data via encapsulation within classes.\n\nThe main priniciples of OOP are:\n\n1. Encapsulation\n2. Inheritance\n3. Abstraction\n4. Polymorphism\n\n## Types of Declarative Programming\n\n### Logical programming\n\nMade up of facts and rules and foundationally mathematical. It takes a declarative approach to problem solving by using everything it knows and trying to answer whether the given facts and clauses are true. For example, if the code states that A is equal to B and B is equal to C, a logical program will make the logical conclusion that A must be equal to C.\n\nExamples of languages that use logic programming paradigm are Prolog, Absys or Alice.\n\n### Functional programming\n\nFunctional programming is language independent. FP is the process of building software by composing pure functions, avoiding shared state, mutable data and side effects. JavaScript is a notable example of a language that fundemnatally supports the functional paradigm.\n\nA pure function is one which, given the same inputs, always returns the same output and has no side effects. This is an important aspect of functional programming. The idea is that functions are not dependent on local or global state.\n\nFunctions are described as \"first class objects\" in functional programming. The reason is that functions can be assigned to variables, passed as arguments, and returned from other functions, just as any other data type can.\n\n```JavaScript\n\n// assign function to variable!\nlet log = function(someVariable) {\n    console.log(someVariable);\n    return someVariable;\n}\n\n\nlet myVar = \"Hello world\";\n\nlog(myVar);\n// Hello world\n```\n","n":0.042}}},{"i":25,"$":{"0":{"v":"Nextjs","n":1},"1":{"v":"\n## Post 14.0 notes and usage\n\n### Routing\n\nIn version 13, Next.js introduced **App router**. Prior to this, Next used page router.\n\nThe difference from the outset means that prior to 13, users would place their routes within a `pages/` directory where each file is considered a route:\n\n```\n└── pages\n    ├── about.js\n    ├── index.js\n    └── team.js\n\n```\n\nWith 13 onward, app router looks for a `pages.(js|ts|tsx)` file who's route is determined by it's parent folders. Eg:\n\n```\n\n└── app\n    ├── about\n    │   └── page.js\n    ├── globals.css\n    ├── layout.js\n    ├── login\n    │   └── page.js\n    ├── page.js\n    └── team\n        └── route.js\n\n```\n\nSubfolders (leaves) become nested routes.\n\nApp router is the recommended approach in modern NextJS projects. Page router is still supported.\n\nApp router is built on **React Server Components** (RSC) By default, components inside app are RSC components.\n\n### File conventions\n\nNextjs has various reserved file names that provide common inbuilt routing functionality:\n\n- `layout.js` - a shared segment between pages that preserves states, remains interactive and doesn't re-render. The top most layout is known as the **_Root layout_** and it is required component that is shared by all pages in the application. It must contain a html and a body tag.\n- `template.js`\n- `error.js` - handles errors in routes\n- `loading.js` - creates a loading view. Beneath the hood it's tied in with Suspense in the layout file.\n- `not-found.js` - view for an unknown route\n- `page.js` or nested `layout.js`\n\n### Data Fetching\n\n#### On the server\n\nBy default, Next.js automatically caches the return values of `fetch` in a built-in **Data Cache** on the server.\n\nIf data is dynamic or requires re-validation, cached data needs to be purged. There are two ways to re-validate:\n\n- Time based - revalidate once a certain amount of time has passed. This is useful for data that doesn't change frequently and freshness is not critical. This is good for a mostly static website.\n\n```js\nfetch(\"https://...\", { next: { revalidate: 3600 } });\n```\n\n- On-demand revalidation - manually revalidate data based on an event. This is on par with traditional server side rendering to ensure that data is always fresh on every request.\n\nIf you want a request to opt-out of caching, you need to set a `no-store` option in the fetch call:\n\n```js\n// Opt out of caching for an individual `fetch` request\nfetch(`https://...`, { cache: \"no-store\" });\n```\n\nAlternatively, you can use the route segment config option to opt out of caching for a specific route segment:\n\n```js\n// Opt out of caching for all data requests in the route segment\nexport const dynamic = \"force-dynamic\";\n```\n\n#### On the client\n\nFetching data on the client can be done via a Route Handler or a third party library such as Vercel's [SWR](https://swr.vercel.app/) or [TanStack Query](https://tanstack.com/query/latest).\n\nRoute Handlers execute on the server and therefore protect sensitive information.\n\nRoute handlers replace the API routes from 13.0 onward (although API routes can still be used).\n\n### Data fetching recommendations\n\nNext.js recommends that whenever possible, to fetch data on the server with server components. This is done via server actions.\n\nServer actions are react functions that are asynchronous and are executed on the server. They can be denoted via the \"use server\" directive, can be inline or within a separate file.\n\n```jsx\n// Server Component\nexport default function Page() {\n  // Server Action\n  async function create() {\n    'use server'\n\n    // ...\n  }\n\n  return (\n    // ...\n  )\n}\n```\n","n":0.044}}},{"i":26,"$":{"0":{"v":"Machine Setup","n":0.707},"1":{"v":"\nMy machine setup preferences.\n\n## Programs\n\n1. [Steermouse](https://plentycom.jp/en/steermouse/) - to set up mouse hot keys\n2. [Rectangle](https://rectangleapp.com/) - Mac window snapping\n3. [kitty](https://sw.kovidgoyal.net/kitty/) - better terminal\n4. [bat](https://github.com/sharkdp/bat) - instead of `cat` for syntax highlighting and pretty print\n\n5. [tmux](https://github.com/tmux/tmux/wiki) - terminal multiplexer\n6. [vscode](https://code.visualstudio.com/) - for most languages and frameworks unless I need a really smart IDE then I would use intellij\n7. [oh-my-zsh](https://ohmyz.sh/) - zsh config manager\n8. [jq](https://stedolan.github.io/jq/) (optional, I only use this sometimes) - pretty printing json usually to pipe curl output\n\n## Configuration files\n\n### vim\n\n```bash\nfiletype plugin indent on  \" Load plugins according to detected filetype.\nsyntax on                  \" Enable syntax highlighting.\n\ncolorscheme desert\nset autoindent             \" Indent according to previous line.\nset expandtab              \" Use spaces instead of tabs.\nset softtabstop =4         \" Tab key indents by 4 spaces.\nset shiftwidth  =4         \" >> indents by 4 spaces.\nset shiftround             \" >> indents to next multiple of 'shiftwidth'.\nset number\nset listchars=eol:¬,tab:>·,trail:~,extends:>,precedes:<\nset list\nset showmode               \" Show current mode in command-line.\n\nset incsearch              \" Highlight while searching with / or ?.\nset hlsearch               \" Keep matches highlighted.\n\nset cursorline             \" Find the current line quickly.\n```\n\n## tmux\n\n```bash\nunbind C-b\nset-option -g prefix C-a\nbind-key C-a send-prefix\n\n# split panes using | and -\nbind | split-window -h\nbind - split-window -v\nunbind '\"'\nunbind %\n\n# reload config file (change file location to your the tmux.conf you want to use)\nbind r source-file ~/.tmux.conf\n\n# Enable mouse mode (tmux 2.1 and above)\nset -g mouse on\n\nset -g history-limit 5000\n\nset -g default-terminal \"screen-256color\"\n\n```\n\n## zhrc\n\n```bash\n# keep most of the file with some changes/ additions\n\nZSH_THEME=\"alanpeabody\"\n\nplugins=(\n    git\n     zsh-autosuggestions\n)\n\n## command line prompt -\n## shows username, path and git branch details\nparse_git_branch() {\n    git branch 2> /dev/null | sed -n -e 's/^\\* \\(.*\\)/[\\1]/p'\n}\nCOLOR_DEF='%f'\nCOLOR_USR='%F{243}'\nCOLOR_DIR='%F{197}'\nCOLOR_GIT='%F{39}'\nNEWLINE=$'\\n'\nsetopt PROMPT_SUBST\nexport PROMPT='${COLOR_USR}%n ${COLOR_DIR}%d ${COLOR_GIT}$(parse_git_branch)${COLOR_DEF}${NEWLINE}%% '\n\n## default editor\nexport EDITOR=vim\n\n# kitty - Fix issues with terminal navigation in tmux\nbindkey \"\\e[1;3D\" backward-word # ⌥←\nbindkey \"\\e[1;3C\" forward-word # ⌥→\n\n\n# for JQ extention if using -  \"null\" is hard to see so change the colour\nexport JQ_COLORS='0;31:0;39:0;39:0;39:0;32:1;39:1;39'\n```\n","n":0.058}}},{"i":27,"$":{"0":{"v":"Data structures & Algorithms","n":0.5}}},{"i":28,"$":{"0":{"v":"Leetcode","n":1},"1":{"v":"\n### Leetcode solutions + explanation\n\n\n### 53.Maximum Subarray \n\nhttps://leetcode.com/problems/maximum-subarray/\n\n#### Approach\nIn order to get the maximum sub array, we keep track of the maximum sum so far and a running sum of the current subarray.\n\nWe iterate over the array from the 2nd index, with both current and max sum set to the first value in the array. We need to determine whether we consider the current number as part of this sub array or if we should start a new window. How do we know if continuing this subarray or not is the right choice? We check whether the sum so far PLUS the current number is better than just taking the number itself. This is to cater for the scenario where you have negative numbers in a subarray. Consider the scenario where subarray is either good to continue vs starting new:\n\na) [4, -1, 8] \n\nvs\n\nb) [4, -6, 8]\n\nIn a) when we get to the number 8, currentSum will equal 3 (4+(-1)). We then check whether currentSum + 8 is better than 8 itself. In this scenario, the sum is better (3+8 > 8) therefore we take the whole array and max sum becomes 11\n\nif we take b), when we get to 8, the current sum is -2 (4+(-6)). If we compare the currentsum + 8 to just 8, it's more beneficial to start a new window (at 8) since (-2 + 8 < 8). Therefore max sum in the second scenario becomes 8.\n\n#### Solution\n\n**Time**: `O(n)`\n\n**Space**: `O(n)`\n\n```js\n/**\n * @param {number[]} nums\n * @return {number}\n */\nvar maxSubArray = function(nums) {\n    let maxSum = nums[0];\n    let currentSum = nums[0];\n\n    for(let i = 1 ; i < nums.length; i++) {\n        currentSum = Math.max(currentSum + nums[i], nums[i]);\n        maxSum = Math.max(currentSum, maxSum)\n    }\n\n    return maxSum;\n};\n\n```","n":0.059}}},{"i":29,"$":{"0":{"v":"Architecture","n":1},"1":{"v":"\nTopics that don't necessarily fit into just FE or BE e.g. repo management, CI/CD, devops.\n\n## Types of Architectures\n\n### Monolithic Architecture\n\nA single server application\nresponsible for all the features of the system e.g. a hotel application could have a single application taking care of payments, bookings, campaign offers and so on. This is a common way for applications to start out and even continue if they are simple or non-complex.\n\n### Microservices Architecture\n\nSplitting out responsibility into multiple application servers e.g. one for payments, one for streaming, one for recommendations.\n\nThis allows us to scale individual services and prevent code from becoming too complex by making use of single responsibility principles and loose coupling.\n\nMicroservices architecture is more complex to set up and manage and is therefore more useful for larger projects.\n\n## Patterns and Design Principles\n\n### Command Query Responsibility Segregation (CQRS)\n\nA pattern that separates the responsibility of reading (querying) data and modifying (commanding) the data. On the command side, CQRS emphasizes the use of commands to perform action that modify application state. The traditional alternative to CQRS is CRUD (create, read, update delete) where the same services are responsible for the handling of all operations.\n\nOn the query side, CQRS emphasizes the use of queries to retrieve data from the system. These are typically handled by query handlers within the system.\n\nThe main advantage of separating command and query is giving developers the ability to optimize each side independently. Read can be optimized with strategies such as caching or specialized data stores. CQRS is useful in complex domains or applications where read and write have different scalability and performance requests. Considering it adds complexity would mean that it's not suitable for all requirements and trade-offs should be taken into account.\n\n[[Read more|architecture.CQRS]]\n\n### ACID & CAP Theorem\n\nACID (Atomic, Consistency, Isolation, Durability) and CAP (Consistency, Availability, Partition Tolerance) are concepts in distributed systems that are used to explain the trade offs between consistency and availability.\n\nAccording to the CAP theorem, any distributed system can only guarantee two of three properties at a time. You can't guarantee all three properties at once:\n\n<img src=\"https://miro.medium.com/v2/resize:fit:1400/format:webp/1*Br1FrvKnK3hU6Xl_LbDkwg.png\">\n\nACID is a set of properties of database transactions intended to guarantee validity even in the event of errors, power failures, etc.\n","n":0.053}}},{"i":30,"$":{"0":{"v":"Tech Fundamentals","n":0.707},"1":{"v":"\nNotes on Technical Fundamentals course (https://learn.cantrill.io/p/tech-fundamentals) - summary of technical concepts considered a precursor to aws certification / general tech architecture.\n\n## OSI Model\n\nThe Open Systems Interconnection (OSI) model is a conceptual framework that describes the communication functions of a telecommunications or computer system. It is divided into seven layers each of which performs a specific function in the transmission of data between networked devices. This is sometimes known as the Networking Stack.\n\nThe 7 layers are split into Host and Media Layers:\n\n**Host Layers:**\n\n    7- Application\n\n    6- Presentation\n\n    5- Session\n\n    4- Transport\n\n**Media Layers:**\n\n    3- Network\n\n    2- Data Link\n\n    1- Physical\n\n### Physical Layer (Layer 1)\n\n- The first and lowest layer in the OSI model\n- Responsible for the physical transmission of data over a communication channel such as wire, cable or wireless signal\n- All devices on the layer 1 network need to use the same medium for transmitting and receiving\n- This layer defines the specifications things like voltage levels, timings, data rates, distances, modulation and connectors\n- At layer 1, everything is broadcast in the medium, addresses are not used - this is addressed by layer 2\n- Collisions can happen as multiple things can broadcast at the same time. Layer 1 has no collision detection\n- For layer 1 to be useful, we need to add layer 2 which runs over the top of it\n\n### Data Link Layer (Layer 2)\n\n- Layer 2/Data Link layer is the second layer in the OSI model responsible for the reliable transfer of data between two nodes on the same network segment\n- Runs over layer 1 and requires a functional layer 1 to operate\n- MAC address is uniquely assigned to a piece of hardware\n- Layer 2 provides frames and layer 1 handles the physical transmission and reception on the medium\n- Layer 2 frames have different components:\n\nThe mac header:\n\n- **preamble** - the start of the frame - destination and source mac address - destination can be a broadcast or specific\n- Ether type specifies which layer 3 protocol is putting its data inside a frame e.g IP\n- Then the payload:\n\n**The payload**- the data the frame carries from source to destination provided by layer 3\n\n**The frame check sequence** - allows the destination to check if corruption has occurred or not\n\n- There are several devices that can be used to send data. A hub is a 'dumb' device that sits in layer 1 where as a switch sits in layer 2 and deals with addresses and collisions.\n\n### Network Layer (Layer 3)\n\nLayer 3 handles the process of moving data from a source to a destination.\n\nAny networks using only layer 2 need to use the same protocol e.g. ethernet. Because some networks don't use the same protocols, layer 3 is needed.\n\nLayer 3 can span multiple different layer 2 networks. It adds internet protocol (IP) to assign to devices to be used across different networks. Devices called routers which are layer 3 devices move packets of data across different networks.\n\nThere are two versions of IP: version 4 and 6. IP has a packet structure containing a source and destination IP field. There is a protocol field which contains a layer 4 protocol e.g. ICMP, TCP or UDP. There is also a field called TTL or time to live. This defines a maximum number of hops before a packet can be discarded so it doesn't loop forever.\n\nThe IP4 address is made up of 4 parts separated by dots with each value up to 255 e.g. 1.2.4.255. IP addresses are only dotted for human format, the actual IP address is in binary format made up of 4 x 8 bits. Each 8 bits is known as an octet. IP addresses should be unique, especially in your local network.\n\nDevices inside a local network communicate to the router. A router has a route table where each row has a destination field and a next hop/target field. Each packet that arrives at the router will have a destination.\n\n### Transport Layer (Layer 4)\n\nLayer 4, the transport layer, is responsible for ensuring that data is delivered reliably from one device to another. Layer 3 does not ensure the ordering of packet arrival nor does it deal with packet loss e.g when TTL is reached. Layer 3 also does not differentiate between the packets therefore packets from different applications are treated the same.\n\nLayer 4 remedies these issues. Layer 4 adds UDP and TCP. These run on top of IP. You would pick TCP when you want reliability and error correction. UDP is faster because it doesn't require the overhead of reliability.\n\n### Session Layer (Layer 5)\n\nTODO\n\n---\n\n### Network Address Translation (NAT)\n\nNAT is technology that allows multiple devices to share a single public IP address. They translate private IP addresses to public ones and also in reverse.\n\nThere are different types of NATs:\n\n- Static NAT which is a single 1 to 1 map of a private to fixed address\n- Dynamic NAT uses 1 private address against the 1st available public address from a pool of addresses. This is used when you have a large number of private addresses.\n- Port Address Translation - Many private addresses to 1 public address\n\nNAT only makes sense for IPv4 because IPv6 adds many more addresses.\n\n### IP Address Space and Subnetting\n\nIPv4 addresses occupy a range from 0.0.0.0 -> 255.255.255.255.255\nAlthough it covers over 4.29 billion addresses, with the current world population it will not suffice. Public IP addresses need to be allocated but private ones can be used freely.\n\nThe IPV4 public address space is split into ranges where specific subsets are assigned to specific entities:\n\n- Class A - 0.0.0.0 -> 127.255.255.255 - historically this space was For huge businesses but since it's been given up to the regional managers of the IP address space\n- Class B - 128.0.0.0 -> 191.255.255.255 - larger businesses that didn't need class A but as above, they are now addressed to IP managers\n- Class C - for those that were not big enough to fit into A or B but as with above, they're now owned by IP managers\n- Class D\n- Class E\n\nWith IPv6, the address space is 340 trillion spaces. IP addresses in IPv6 are no longer a scarce resource and don't need strict management.\n\nSubnetting is the process of breaking up IP address space into smaller pieces. CIDR allows us to break up the IP addresses with a prefix e.g. /16\n\n### Distributed Denial of Service (DDoS) attacks\n\nAn attack that is designed to overload websites.\n\nThere are different types of DDoS attacks:\n\n- Application layer - flooding HTTP\n- Protocol based attacks - SYN floods\n- Volumetric - DNS amplification\n\n### VLANS, TRUNKS and QinQ\n\n- A Virtual Area Network (VLAN) is a way to divide a single physical network into multiple logical networks.\n\n// TODO\n\n### SSL and TLS\n\nSecure Sockets Layer (SSL) and Transport Layer Security (TLS) at a high level do the same thing. TLS is newer and more secure.\n\nSSL and TLS provide privacy and data integrity between client and server.\n\nTLS:\n\n- ensures privacy via encryption\n- identity (server/client) verification\n- ensures a reliable connection by protecting against alteration of data in transit\n","n":0.029}}},{"i":31,"$":{"0":{"v":"System Design","n":0.707},"1":{"v":"\n### Domain Name System (DNS)\n\nThe phonebook of the internet. Translates domain names into their corresponding IP addresses e.g. www.mywebsite.com will direct to the an IP address such as 192.0.2.1. DNS will find the associated IP address and direct your request to the appropriate server\n\nSome examples of DNS services are Cloudflare DNS, Route 53 (AWS), Google Cloud DNS.\n\n### Load Balancer\n\nA load balancer is responsible for distributing network requests across servers to ensure optimal resource utilization, reduce latency and maintain high availability. The requirement for a load balancer depends on the scale of the architecture and the requirement for fault tolerance.  AWS Example: Elastic Load Balancer\n\n![Load balancer](/vault/assets/images/load-balancer.png)\n[source](https://codeburst.io/load-balancers-an-analogy-cc64d9430db0)\n\n### API Gateway \nAn API Gateway is a server or service which acts as a single entry point for clients to access various microservices or backend services. It can handle routing, authentication, request transformation, rate limiting and caching. It is well suited to when multiple microservices need a single entry point as it helps centralise concerns such as routing, security and monitoring. \n\nExamples of API gateways: Amazon API Gateway, Apigee, NGINX\n\n### Content Delivery Network (CDN)\n\nA distributed network of servers that store and deliver content such as images, videos, stylesheets and scripts to users from locations which are geographically closer to them. ","n":0.07}}},{"i":32,"$":{"0":{"v":"Hexagonal Architecture","n":0.707},"1":{"v":"\n### Background\n\n- Layered architecture segregates an application into different tiers - the most common is the 3 tier architecture where the application is split into the Presentation Layer, Logic Layer, Data Layer.\n\n- Layered architecture's attempts to enforce a separation of concerns. But Hexagonal Architecture was introduced on the basis that there is a risk with traditional approach in highly coupling the layers as business logic will inevitably leak from one layer to the next, particularly in the presentation layer.\n\n- Hexagonal Architecture (also known as ports and adaptors) was founded by Alistair Cockburn in 2005. Alistair argues that design issues arise when business logic is entangled with external entities. Therefore, decoupling any external actors from the application will allow it to act independently of any technology that it interfaces with it.\n\n- Hexagonal architecture uses 'ports' to allow external entities to communicate with the application. For every input and output to the application we have a port. It's a way for the application to communicate to the outside world without needing to know what it's interacting with.\n\n- External sources communicate to ports via an adaptor. The adaptor takes data from the port and converts it into the format required for the external source\n\n- The port and the application don't need to change. The adaptors are used for the outside world to transform the business domain details into necessary read/write data.\n\n- There are two sources to the application: the input and the output. Alistair describes these as the driving side and the driven side. The input is driving the application to do something where as the output is driven by the application itself.\n\n- Inputs can be apis but so can outputs which means hexagons can talk to other hexagons! This concept encapsulates domain-driven design where each hexagon is responsible for a single domain e.g. users, search, files, emails etc.\n\n### Breakdown of architecture:\n\n<br>\n<img src=\"https://docs.google.com/drawings/d/e/2PACX-1vQ5ps72uaZcEJzwnJbPhzUfEeBbN6CJ04j7hl2i3K2HHatNcsoyG2tgX2vnrN5xxDKLp5Jm5bzzmZdv/pub?w=960&amp;h=657\"> \n<br>\n\n### The Hexagon\n\n- The hexagon is the application itself. We can use 'hexagon' interchangeably with application.\n\n- The hexagon contains the business problem solutions.\n\n### Actors\n\n- Outside the hexagon are things the application interacts with. They can be humans, other applications or any hardware/software device. These are known as actors.\n\n- Actors are categorized as either drivers (or primary actors) or driven (or secondary actors).\n\n- Drivers/Primary actors trigger interactions with the application e.g. a test, a web application, a mobile app\n\n- Driven/Secondary actors are triggered by the application to provide some functionality needed by the application e.g. databases, message queues, another application\n\n- Driven actors can either be repositories where the application can also receive information from it or a recipient where the information is sent to it as a set and forget. Example of a repository is a database or storage device where as a recipient can be an SMTP server for sending an email, a printer, a text message to a phone etc.\n\n![Driver and Driven side of Hexagonal Architecture](assets/images/hexagon-in-out.png)\n\n### Ports\n\n- Ports are at the application/hexagon boundary which are interfaces that the application offers to the outside world. Ports belong to the application itself.\n\n- Driver ports are the **API** of the application. You can group the use cases into one port or spread across a few if we want to follow the Single Responsibility Principle.\n\n- If using a lot of ports, a recommended option is applying the command bus design pattern or [[CQRS pattern |architecture#command-query-responsibility-segregation-cqrs]] a port for executing commands and another port for executing queries.\n\n- A driven port is an interface for functionality to implement business logic. Driven ports are the **SPI** (service provider interface) required by the application.\n\n- The purpose of ports is to shift the design by purpose instead of technology and to have technologies be substitutable on all sides by an adapter. Ports are tech agnostic - it's up to adapters to transform data according to a specific actor's technical needs needs.\n\n![ports](assets/images/hexagon-example.png)\n\n### Adapters\n\n- Actors interact with the hexagon ports through adapters using specific technology. Adapters are **outside** the application\n\n- For any port there may be multiple adapters for each desired technology we want to use. For example, a port for notifications may have an adapter for email, text message and a phone call.\n\n- A driver adapter uses a driver port interface, converting technology requests into a technology agonistic request to a driver port.\n\n- For each driver port, there should be at least two adapters - one for the real driver and another for testing the behaviour of the port\n\n- A driven adapter implements the driven port interface, converting the technology agnostic methods of the port into specific technology methods. It essentially converts one interface to another.\n\n- We can use the [adapter design pattern](https://refactoring.guru/design-patterns/adapter/typescript/example) to implement adapters\n\n### Other\n\nBesides the above, there will be a 'composition root' or Main Component that runs at startup and builds the whole system. It should:\n\n- Initialise and configure the environment\n- For each port, it chooses the adapter implementing the port e.g. in-memory database vs postgres database\n- creates the application and injects the driven adapters as instances to the applications constructor\n- for each driver port, it chooses the driver adapter that uses the port and creates an instance of the adapter, injecting it into the applications constructor. It then runs the driver adapter instance\n\n![alt text](assets/images/task-assignment-app.png)\n\n### Example implementation references (Repositories)\n\n- https://github.com/jmgarridopaz/bluezone - Java\n- https://github.com/Sairyss/domain-driven-hexagon - Node JS\n- https://github.com/kamilmysliwiec/nest-cqrs-example - Using Nest JS CQRS\n- https://github.com/gregoryyoung/m-r - supplementary CQRS repo by Greg Young (.NET)\n\n#### References\n\n1. https://medium.com/ssense-tech/hexagonal-architecture-there-are-always-two-sides-to-every-story-bc0780ed7d9c\n2. https://scalastic.io/en/hexagonal-architecture/\n3. https://youtu.be/bDWApqAUjEI?feature=shared\n4. https://jmgarridopaz.github.io/content/hexagonalarchitecture.html#tc2-1\n5. https://web.archive.org/web/20170624023207/http://alistair.cockburn.us/Configurable+Dependency\n","n":0.034}}},{"i":33,"$":{"0":{"v":"Code Repositories","n":0.707},"1":{"v":"\n\n##### Handling multiple related projects:\n\n## Monorepos\n\nMono (single) repo (repository) is the concept of having a shared codebase of multiple projects. \n\nThe opposite of this would be to spread projects across different repositories e.g. repo-A contains BFF code, repo-B contains client code, repo-C is a micro service etc. \n\n### Advantages\n\nWhen multiple repositories exist for projects that are interlinked, you issues such as:\n- Having to create multiple pull-requests in various projects which are merged in the 'correct' order to minimize breaking changes\n- Difficulty of using updated dependencies locally before they are updated on remote e.g. npm libraries.\n\nHaving a monorepo can mean:\n- managing multiple projects is much easier\n- dependencies reflect locally immediately\n- improves collaboration between teams by ensuring ownership of ecosystem cohesiveness - poly repos pipelines are often independent and breaking changes can be missed\n\n### In practice\n\nA code repository can be structured in various ways to reflect a mono repo. An example could be:\n\n```bash\n- apps/\n--- app-one\n--- app-two\n- packages/\n--- ui\n--- utilities\n--- eslint-config\n--- ts-config\n\n```\n\n\n\n\n----\n\n#### References\n\n1. https://www.robinwieruch.de/javascript-monorepos/?ck_subscriber_id=1441143038\n\n\n\n\n-----------\n\nsome potentially interesting things:\nhttps://yarnpkg.com/features/workspaces - yarn v2 workspaces overview - shows how easy it is to tie node packages together. other relevant docs are zero installs/offline cache, both super important when it comes to monorepo on CI (re: solving 'how to manage dependencies for N projects')\nhttps://github.com/lerna/lerna - tool for managing monorepos. supports npm or yarn workspaces. yarn v2 covers a lot of its features. ive played with it a LOT and NEVER actually used it. always seemed needless/too specific to package based monorepos (read: not enterprise based monorepos)\nhttps://monorepo.guide/ - thinkmill (aus consultancy) high level intro to monorepos & links to some of their own tools / examples\nhttps://www.atlassian.com/git/tutorials/monorepos - atlassian overview of monorepo architecture & common pitfalls/strategies for solving git scaling\nhttps://www.youtube.com/watch?v=W71BTkUbdqE - old video but an overview of google's monorepo. blew my mind. their investment in tooling is insane.\nsome of my own stuff:\nhttps://github.com/meatwallace/yarks#clipboard-release-strategy - monorepo package publishing strategy outline from a tool i wrote that uses git, semantic-release and yarn v2/berry workspaces\nhttps://github.com/meatwallace/foundations/tree/master/packages - basic yarn v2 package-based monorepo using the above package for deployment)\nhttps://github.com/meatwallace/tbd - basic yarn v2 app/enterprise based monorepo. its missing anything advanced atm re: scaling but foundationally it's something i could use.\n","n":0.053}}},{"i":34,"$":{"0":{"v":"AWS","n":1}}},{"i":35,"$":{"0":{"v":"Solutions Architect Associate","n":0.577},"1":{"v":"\nNotes attributed to [this course](https://learn.cantrill.io/courses/enrolled/1820301)\n\n## AWS Accounts\n\n- An AWS account is a container for identities (users) and resources\n- Every AWS account has a root user\n- The account root user can't be restricted it has full access to everything within this account.\n- The credit card used with the root account will be the **Account** Payment method, everything will be billed to that card\n- AWS is a pay-as-you-go/consume platform\n- Certain resources have a free-tier\n- IAM - every AWS account comes with it's own IAM Database\n- IAM lets you create 3 different IAM profiles - Users, groups and roles\n  - Users represent humans or applications that need access to your account - this is for individual purposes\n  - Groups are a collection of related users\n  - Roles can be used for granting external access to your account\n- IAM policy - used to allow/deny access to AWS services attached to other identities\n- IAM is an identity provider, which also authenticates and authorizes\n- IAM Access Keys are long term credentials with up to 2 available per IAM user typically used in CLIs or applications\n- Access Keys are made up of Access Key ID and the Secret Access Key\n\n## Technical fundamentals\n\nPre-cursor to the concepts covered in this course summarized here:\n[[architecture.tech-fundamentals]]\n\n## AWS Fundamentals\n\n### Public vs Private services\n\n- Services can be categorized into two types: public and private services\n- AWS public and private service are separated by network access.\n- Public service is something which can be accessed using public endpoints e.g. s3\n- A private aws service runs within a vpc so only what is connected to that vpc can access it\n- AWS has three zones - the public internet zone, the private network and the AWS public zone which runs in between the public and private zone.\n- AWS public zone is where public services operate from e.g. s3\n\n### AWS Global Infrastructure\n\n- AWS have created their infrastructure platform consisting of isolated regions connected together.\n- A region is a creation of AWS which covers an area over the world which contains a full deployment of AWS infrastructure. New regions are added all the time.\n- When interacting with most AWS services you're doing it at a particular region e.g. elastic compute cloud in North virginia is different to interacting to elastic compute in Sydney.\n- AWS also provides Edge locations which are smaller than regions and they typically have only content distribution services as well as some types of edge computing. They are useful for companies like Netflix who want to store tv shows and movies as close to their customers as possible to allow low for low latency and high speed distribution\n- Some services act from a global perspective e.g. IAM\n- Regions have three main benefits:\n\n1. Each reason is separate geographically which isolates any faults\n2. Geopolitical separation - different governance depending the region\n3. Location control - tune architecture performance relative to an area\n\n- Regions also have a code e.g. Sydney is ep-southeast-2, as well as a name - Asia Pacific (Sydney)\n\nInside every region, AWS also provide multiple availability zones. These give isolated infrastructure within a region. If a region experiences an isolated issue but only one availability zone is affected, the others are likely to be still fully functional. A solutions architect may distribute the services across multiple availability zones. This is used to build resilience.\n\n### AWS Default Virtual Private Cloud (VPC)\n\n- A VPC is a Virtual Network inside AWS\n- A VPC is a regional service that operates within that region\n- A VPC by default is private and isolated. Services deployed into the same vpc can communicate but it's isolated from other vpcs and the AWS zone/public internet.\n- There are two types of VPCs per account:\n\n1. Default VPCs - can only have one per region. Configured by AWS.\n2. Custom VPCs - can have many per region. You use these in almost all serious AWS deployments to configure them how you like.\n\n- VPCs cannot communicate with each other without you configuring them to do so.\n- VPCs are regionally resilient\n- The default VPC gets a default CIDR IP range which is always the same - 172.31.0.0/16\n- A VPC can be subdivided into subnets for resilience. Each subnet inside a VPC can be put into an availability zone. The default VPC has one subnet in every availability zone in that region.\n- the default VPC assigns a public address to the services by default.\n\n### Elastic Compute Cloud (EC2)\n\n- EC2 is a service which allows you to provision virtual machines known as instances with an operating system.\n- EC2 is IAAS (Infrastructure as a Service) which provides access to virtual machines (instances)\n- An instance is just an operating system configured in a certain way\n- EC2 is a private AWS service by default - it uses VPC. You can configure it to have public access\n- An EC2 is AZ (availability zone) resilient. If the AZ fails then the instance fails\n- You can choose an instance with various sizes and capabilities\n- EC2 provides on-demand billing - per second\n- Instances can use different types of storage e.g. local host storage (ec2 host) or Elastic Block Store (EBS) which is network storage made available\n- EC2 instances have a state e.g. RUNNING -> STOPPED -> TERMINATED\n- EC2 can be moved from RUNNING TO STOPPED and back again\n- TERMINATING an instance is a one way change, you can do that from the RUNNING or STOPPED state. It's a non-reversible action\n- At a high level, an instance is composed of CPU, memory, disk and networking. You are charged for all four of those instances.\n- When an instance is STOPPED, it means no CPU, memory or network is being used therefore you won't be charged for any running costs of that instance. Storage however is still being used when it's in the stopped state which means you will be charged for it.\n- In order to have no costs for an EC2 instance you need to terminate it.\n- An Amazon Machine Image (AMI) is an image of an EC2 instance.\n- An AMI can be used to create an EC2 instance or an AMI can be created from an EC2 instance.\n- An AMI is similar to a server image in a physical server\n- An AMI contains:\n  - Attached permissions - who can use the image e.g only owner vs specific accounts vs public\n  - Root volume - the drive that boots the operating system\n  - Block device mapping - configuration which links the volumes that the AMI has and how they're presented to the operating system e.g boot vs data volume\n- EC2 can host different OS e.g. linux, windows, macos. You can connect to them via remote desktop (windows) or SSH (linux/macos)\n\n### Simple Storage Service (S3)\n\n- S3 is a global storage platform - it's regionally resilient. The data is replicated across availability zones in that regions. It can tolerate a fault in an AZ\n- S3 is a public service\n- It's used to host a large amount of data e.g. movies, audio, photos, text, large data sets\n- Economical and can be accessed via a variety of methods e.g. UI/CLI/API/HTTP\n- S3 delivers two main things:\n\n1. Objects - the data s3 stores\n2. Buckets - containers for objects\n\n**Objects** are basically files that are made up of two components:\n\n1. the object key (name) - usually the file name\n2. the object value (data) - the data or contents of the object\n\n- The bucket name needs to be **globally unique** - this is across all regions and aws accounts. It should be between 3-63 characters, all lower case, no underscores. Must start with a lowercase letter or a number. It can't be formatted like an IP address.\n\n- A bucket can hold an unlimited number of objects and an unlimited amount of data - it's an infinitely scalable service.\n\n- A bucket may show on the UI that it has folders but the underlying structure is flat and everything sits in the root. Folders are referred to as prefixes in s3 as they prefix the object names.\n\n- There is a soft limit of 100 buckets for an s3 account and a hard limit of 1000 buckets using support request.\n\n- You can have unlimited objects in a bucket, with each object able to range between 0 to 5TB in size.\n\n- S3 is not a file or block. It is an object store\n- You can't mount an s3 bucket as a drive e.g. K:\\ or /images\n- s3 is great for large scale data storage, distribution or upload\n- great for offloading - moving data from a server to the s3\n- Most services can use s3 as an INPUT or OUTPUT. s3 is a good default for data storage.\n\n### CloudFormation (CFN) basics\n\n- CloudFormation is Infrastructure as Code (IaC) which allows automation infrastructure creation, update and deletion.\n- CFN uses templates written in either YAML or JSON\n- A template:\n  - has a list of resources to do the action on (at least one - mandatory)\n  - description - the only restriction with this is if the template has an AWSTemplateFormatVersion, the description must come directly after it (this can be a trick question in the exam)\n  - metadata - controls how the UI presents the template\n  - parameters - adds fields which need to be added with input (default values could be provided)\n  - mappings - allows you to create lookup tables\n  - conditions - decision making in the template\n  - outputs - once the template is finished it can present outputs based on the resource e.g. the instance ID of the ec2\n- CloudFormation takes a template and creates a stack. A stack contains all the logical resources the template tells it to contain. CFN will create a corresponding physical resource in your AWS account.\n- You can update or delete the logical resources in the template and the template will do this to the physical resources on your account\n- CFN exists to automate infrastructure\n- CFN can be used as part of change management as it can be put in code repositories\n\n### CloudWatch (CW) Basics\n\n- CloudWatch is a support service which is used by many other AWS services. It collects and manages operational data detailing how it performs, runs or logging data\n- It performs 3 main jobs:\n\n1. **Metrics** - collects metrics from AWS products, Apps, on-premises\n2. **Logs** - collects logs as above\n3. **Events** - Cloudwatch can generate events to do something\n\n- Namespace is a container for monitoring data. It's a way of separating things into different areas e.g. AWS/EC2\n- A metric is a collection of related data points in a time ordered structure e.g. cpu utilization, network I/O or disk I/O\n- Data points are measurements of data consisting of a timestamp and value\n- Dimensions are used to separate data points within the same metric e.g. instance ID (i-xxxxx) and instance type (t3.small)\n- We can take action on metrics using alarms\n\n### Shared Responsibility Model\n\n- Shared responsibility in AWS is the principal that some areas you have to manage vs AWS have to manage\n- At a high level, AWS is responsible for the security of the cloud where as customers are responsible for the security in the cloud\n- AWS responsibilities include managing security of regions, Availability Zones and Edge locations specifically the hardware/global infrastructure.\n- AWS also manage the security around compute, storage, database and networking as well as any software that is used to provide those services\n- Customers need to take care of client side data encryption, server side encryption and network traffic protection.\n- Customers need to take care of OS, network and firewall configuration\n- Customers need to take care of platform, applications, identity and access management as well as customer data.\n\n![Shared Responsibility Model](/assets/images/srp-model.png)\n\n### High-Availability vs Fault-Tolerance vs Disaster Recovery\n\n- High Availability (HA) aims to ensure an agreed level of operational performance, usually uptime. for a higher than normal period\n- HA is about maximizing a system's online time\n- System availability is usually expressed as a percentage of uptime e.g. 99.9% a year means 8.77 hours p/year downtime\n- Fault tolerance (FA) is the property that enables a system to continue operating properly in the event of the failure of one or more of its components\n- HA is just about maximizing uptime where as FA is operating through failure e.g. a airplane can't just be highly available it must be fault tolerant\n- FA is much more complex and more costly to implement as you need to minimize outages but also design a system that will tolerate a failure\n- Disaster recovery (DR) is a set of policies, tools and procedures to enable the recovery or continuation of vital technology infrastructure and systems following a natural or human-induced disaster\n- You need to plan what should be done in the event of a failure. An example of DR planning is having off-site backup storage\n- DR planning should happen in advance so that the process is automated\n\n**Summary**:\n\n- HA - minimise outages\n- FA - operate through faults\n- DR - used when these don't work\n\n### Route53 (R53) Fundamentals\n\n- Route53 provides two main services:\n\n1. Allows you to register domains\n2. Hosts zones on managed nameservers it provides\n\n- Route53 is a global service with a single Database. You don't need to pick a region\n- It is globally resilient so it can tolerate the fault of multiple regions\n- Route53 provides DNS zones as well as hosting for those zones\n- Zone files are created and hosted on four managed name servers\n- Hosted zones can be public or private (VPC)\n- A hosted zone hosts DNS records (recordsets)\n\n### DNS Record Types\n\n- There are different records that can be stored in DNS:\n\n  - Nameserver (NS) - allow delegation to occur end to end in DNS. e.g example.com → ns1.example.com, ns2.example.com\n\n  - A and AAAA Records - A record will point to a v4 IP address and the AAAA will point to the v6 IP address. For example:\n\n    ** A Record:** example.com → 192.168.1.1\n\n    ** AAAA Record:** example.com → 2001:db8::1\n\n  - CNAME - Canonical Name - lets you create the equivalent of DNS shortcuts by pointing to the same A record. E.g. www.example.com → example.com\n  - MX Record - how a server can find a mail server for a specific domain. Includes a priority number\n    ```\n    example.com\n      Priority: 10 → mail1.example.com\n      Priority: 20 → mail2.example.com\n    ```\n  - TXT - allow you to add arbitrary text to a domain that must be matched to prove domain ownership.\n\n- TTL (Time To Live) is the time set by the DNS to determine how long a DNS record is cached by a resolver (DNS server o browser) before it must check for an updated record from an authoritative server.\n\n## IAM, Accounts and AWS Organisations\n\n### IAM Identity Policies\n\n- IAM policies are a type of policy which get attached to identities in AWS\n- Identities are IAM users, groups and roles\n- IAM Policies:\n\n  - provides and denies access to features in AWS\n  - Policy documents are created using JSON containing one or more statements\n  - the first part of a statement is a Sid (Statement ID) which is an optional field that lets you identify a statement and what it does. Using these is best practice to inform the reader\n  - Every statement will have a resource you're interacting with and the action you're wanting to perform on that resource\n  - The action is in the format \"service:operation\" where the operation can possibly be a wild card or a list of multiple actions\n  - Resources is the same only it matches AWS resources. Individual resources are referred to using the ARN\n  - Effect is either allow or deny. It is possible to be allowed and denied at the same time\n\n  ```json\n  <!-- Policy document example -->\n  {\n    \"Version\": \"2012-10-17\",\n    \"Statement\": [\n      {\n        \"Sid\": \"FullAccess\",\n        \"Effect\": \"Allow\",\n        \"Action\": [\"s3:*\"],\n        \"Resource\": [\"*\"]\n      }\n    ]\n  }\n  ```\n\n  - when there is an overlap in permissions, then both of the statements are processed where the priority begins at explicit denies. Denies overrule everything else. The second priority are explicit allows. Allows take effect unless there are explicit denies. The default if no rules are in place, the default is DENY.\n  - With the exception of the account root user, aws identity start of with NO ACCESS to aws resources.\n  - Remember: explicit DENY > explicit ALLOW > DENY\n\n- There are two types of policies: Inline policies and managed policies\n- Inline policies are when you apply individual JSON policy documents to each individual account. This is good for exceptional or special access rights for an individual as opposed to a group or a number of people\n- Managed policies are another JSON policy that you'd attach to identities in a reusable way. These should be used for the normal default rights in a business as they are low overhead\n- There are two types of managed policies: AWS managed policies and customer managed policies which you can create and manage for exact requirements\n\n### IAM Users and ARNs\n\n- IAM users are an identity used for anything required long term AWS access e.g. humans, applications or service accounts\n- A principal (a person/application) makes a request to IAM to authenticate to a resource\n- Authentication for IAM users is done using either username and password or access keys. Access keys are usually used by applications or by humans using CLI tools.\n- Once a principal goes through the access tools, they become an authenticated identity\n- Once a principal is identified AWS knows which policies apply to an identity. This is the process of authorization.\n- Authentication is how a principal can prove to IAM it's who they say they are where as Authorization checks the policies attached to the identity to give them permission for a resource\n- ARN (Amazon Resource Name) uniquely identify resources within any AWS accounts.\n- ARN is used to allow you to refer to a single or group of resources using wild cards\n- ARNs are used in IAM policies\n- The format is:\n  `arn:partition:service:region:account-id:resource-id`\n  `arn:partition:service:region:account-id:resource-type/resource-id`\n  `arn:partition:service:region:account-id:resource-type:resource-id`\n- You can only have 5000 IAM users per account\n- An IAM User can be a member of 10 groups\n- If you have more than 5000 identifiable users then IAM users is not the right identity to use for that solution. You can fix this with IAM roles or Identity Federation.\n\n### IAM Groups\n\n- IAM groups are containers for IAM users\n- You can't log into IAM groups nor do they have credentials of their own\n- They are used solely to manage and organise IAM users\n- an IAM user can be part of multiple IAM groups\n- Groups can have policies attached to them, both inline and managed\n- You can also have individual inline/managed policies at the user level\n- You should collect all the policies that apply to a user from their groups and individual policies and apply the same deny-allow-deny rule to work out what their permissions are\n- There is no limit for the amount of users in an IAM group but the IAM user limit of 5000 exists for the whole account\n- There is no such 'all users' group in IAM built in. You can create this and manage it manually\n- You cannot have any nesting in groups\n- There is a limit of 300 groups per account but it can be increased with a support ticket\n- Policies can be attached to resources as well for example a bucket can have a policy attached to it where it allows and denies identities access to that bucket.\n- A resource can be refer to a user or role to give permission to itself but it cannot give it to a group. This is because a group is not a true identity and they can't be referenced as a principal in a policy\n\n### IAM Roles\n\n- A role is a type of identity that exists inside an IAM account\n- IAM user is when a single principal wants to use AWS\n- IAM roles are best suited to be used by multiple principals e.g. multiple users in the aws account or users, apps or services inside or outside of the aws account.\n- If you can't identify the number of principals that use an identity or if you have more than 5000 principals you could consider using an IAM role\n- Usually roles are used on a temporary basis to borrow permissions\n- IAM roles have two types of policies that can be attached:\n\n  1. Trust policy - which identities can assume that role. This can be entities in AWS accounts, other accounts, anonymous users and SSO providers e.g. facebook, google etc\n  2. Permissions policy - temporary credentials are given to identities assuming the role and these credentials are used to check the permissions\n\n- temporary credentials are generated to roles using STS (Secure Token Service).\n\n### When to use IAM Roles\n\n- One of the most common uses of IAM roles is AWS services as they need permission and access rights to perform certain actions\n- An example is AWS Lambda - it may start/stop ec2 instances, perform backups or other tasks that need permission\n- Instead of hardcoding the access keys into the Lambda, the IAM role 'Lambda execution role' can grant access to aws product/services. It will use the sts:AssumeRole operation to generate temporary credentials to use AWS services.\n- This is a better approach than using access keys as it's more secure and it won't need key rotation\n- Roles are also useful for emergency or unusual situations. A person can assume an emergency role when absolutely required for a short time.\n- Roles are useful for an existing corporate environment. If a corporate has over 5000 staff you cant assign each of them an IAM user.\n- You could allow an IAM role inside your AWS account to be used by an external identity e.g. active directory\n- If you create an app with over 5000 users that needs AWS access, you can use web identity federation which uses IAM roles. Web identities can be providers such as google, facebook or twitter/X\n- The pro of using web identities is that no AWS credentials are stored on the app and it uses existing accounts that customers have. This can scale to 100 million+ users\n- If you want to use resources across aws accounts, aws roles can also be used.\n\n### Service-linked Roles and PassRole\n\n- Service-linked roles are a special time of IAM role linked to a specific AWS service\n- their permissions are pre-defined by an AWS service\n- The main difference between a regular IAM role and a service-linked role is that you cannot delete a service-linked role until it's no longer required\n- They are either created by a service or by you during set up\n- Passrole permissions give the users the ability to use a service linked role without being able to create or edit the role. This is similar to using a pre-created role in a cloud formation stack.\n\n### AWS Organisations\n\n- AWS organisations take a single AWS account (standard account) to create an organisation. This account becomes the management account (previously called Master account).\n- The management account invites existing standard AWS accounts into the organisation. Once they join they change from being standard to member accounts.\n- An AWS organisation has only ONE management account and zero or more member accounts\n- An organisational root is not the same as an AWS account root user. The root of an AWS organisation is just a container for aws accounts and organisational units. It's the top level of the hierarchical structure of an organisation.\n- Consolidating billing for organisations changes the billing methods for member accounts by removing them and passing them through to the management account. In the context of consolidated billing this is known as the Payer Account.\n- Master, management and payment account refer to the same thing - the account that was used to create the organisation.\n\n### Service Control Policies\n\n- SCPs are a feature of AWS organisations which allow restrictions to be placed on member accounts in the form of boundaries\n- SCPs are policy documents or JSON that can be attached to the organisation as a whole or organisational units or individual AWS accounts\n- They inherit down the organisation tree so that nested units will be affected by it and everything below it will be affected too\n- Management accounts are special as they cannot be restricted and not affected by service control policies.\n- They can limit what a root user can do though\n- SCP do not grant permissions. They just control what an account can and cannot grant via identity policies\n- By default, SCP applies FullAWsAccess which means no restrictions\n- SCP also has implicit deny if there is an absence of an allow\n- Only permissions allowed within the intersection of Identity policies and SCPs are allowed\n\n![SCP and Identity Policies Venn](/assets/images/SCP-policies-venn.png)\n\n### CloudWatch Logs\n\n- A public service that allows you to store, monitor and access logging data\n- Has built in AWS integration with services eg EC2, VPC, Lambda, CloudTrail, R53\n- Can generate metrics based on logs (metric filter)\n- Log events are stored in log streams. Log streams are from one specific source e.g. one ec2 instance\n- Log groups are containers for multiple log streams for the same type of logging\n- Log groups are where we define retention and permission policies and metric filters\n- Metrics can have associated alarms\n\n### CloudTrail Essentials\n\n- A product which logs API calls and account events/activities e.g. creating, deleting s3 bucket, stopping a service etc\n- A cloudtrail event is a call/activity on an aws account\n- Stores 90 days of event history - enabled by default for no cost. You don't get any s3 storage unless you configure a trail.\n- To customise this you must create 1 or more Trails\n- Management Events and Data Events are the type of trails\n- Management Events are control plane operations\n- Data events are resource operations e.g. uploading objects, lambda functions being invoked\n- By default, cloud trail only logs Management events\n- A trail logs events for an AWS region it's created in\n- Cloud trail is a regional service\n- A trail can be set to all regions or one region\n- By default, regional trails will log to the region they're in but global services will log to **us-east-1**\n- If you create a trail, it is stored in an s3 bucket as compressed JSON log files\n- CloudTrail could also be integrated into Cloudwatch logs\n- You can create an organisational trail which is a single management point for every event across the whole organisation\n- CloudTrail is NOT real time. There can be a 15+ minute delay\n\n### AWS Control Tower\n\n- AWS Control Tower gives an easy and quick way to set up a multi-account environment\n- Control Tower orchestrates other services to provide this functionality e.g. Organizations, IAM identity center, cloudformation, config\n- It's another evolution of AWS Organisation with more capability\n\nThere are a few different parts of control tower:\n\n- Landing zone - multi-account environment\n- Guard Rails - detect/mandates rules and standards across all accounts\n- Account Factory - automates and standardises new account creation\n- Dashboard - single page oversight of the entire environment\n\n**Landing Zone**\n\n- Home region - the region you deploy the region\n- brings features of multiple AWS products together e.g. Organizations, AWS Config, Cloudformation\n- Security OU - organisational unit that has log archive and audit accounts\n- Sandbox OU - which is for testing and less rigid security\n- You can create other OU's and Accounts\n- Utilises the IAM Identity Center (AWS SSO) - SSO, multi account, ID Federation\n- Monitoring and Notifications - cloudwatch and SNS\n\n**Guard Rails**\n\n- Come in either Mandatory, Strongly Recommended or Elective\n- Function in two ways\n\n1. preventative - stop you from doing things - either enforced or not enabled\n2. detective - compliance check for identifying issues - either clear, in violation or not enabled\n\n**Account Factory**\n\n- Automate account provisioning\n- Can be done with cloud admins or end users with appropriate permissions\n- This provisioning comes with Guardrails which are automatically added\n- Account admin given to a named user to allow people in the organisation to provision accounts\n- Accounts are set up with standard configuration\n- Accounts can be closed or repurposed\n- Can be fully integrated with a business SDLC\n\n## Simple Storage Service\n\n### S3 Security (Resource Policies and ACLs)\n\n- S3 is private by default\n- The only identity which has any access to s3 by default is the account root user\n- You can grant permission to s3 via S3 **Bucket Policies** which are:\n  - A form of resource policies\n  - like identity policies but attached to a bucket\n  - From the perspective of the resource - you control who can access that resource\n  - Identity policies are limited by only being able to give control to the current account, so you cannot give another account access to an s3 bucket. Resource policies allows this for the current or different accounts.\n  - Resource policies can ALLOW/DENY anonymous principals. This can't be done with identity policies since they need to be attached to a valid identity in AWS. Therefore the resource policies can be given to external access.\n  - Resource policies have a 'principal' component which specifies which principals this policy applies to\n  - An identity policy doesn't have a principal because the policy always applies to the account that created it. A good way to identify identity vs resource policy is checking the absence of principal\n  - Identity policy as well as the bucket policy applies to both internal and cross account access. For anonymous only the bucket policy applies.\n\nAccess Control Lists (ACLs):\n\n- Another form of s3 security used less frequently these days. They aren't recommended any more by AWS\n- A sub-resource of an object or bucket.\n- You cannot use ACLs on a group of objects\n\nBlock Public Access:\n\n- Another layer of permission to block all public access as a fail safe\n\nChoosing between resource or identity policies depends on the business' requirements and personal preference but sometimes choosing one over the other makes sense in specific situations:\n\n- If you're granting/denying permissions on lots of different resources across an aws account, then you will need to use identity as not all services support resource policies.\n- If you prefer to manage resources from one place then identity makes sense because this is done in IAM\n- If you're managing a specific product then resource makes sense\n- Cross account or anonymous resources should use resource policies\n- Do not use ACLs unless you MUST\n\n### S3 Static Hosting\n\n- Without static hosting, you access S3 Via AWS APIs\n- With static hosting, you can access those resources via HTTP e.g. websites, blogs etc\n- You must set an Index and Error document for s3 hosting. We point the index document to a specific html file object in the bucket as well as Error\n- A website endpoint is created for hosting\n- You can use a custom domain via R53 but the bucket name MUST match the domain name\n\nThere are two scenarios that are perfect for s3\n\n1. Offloading - moving large data from a compute service to s3 is cheaper\n2. Out-of-band pages - if a server is offline for maintenance or has performance bugs we can point users to a static page on s3 that contains something like a status message\n\nPricing:\n\n- Per GB per month charge\n- Transfer fee - in is free, out is per gig charge\n- Request and data retrieval - every operation e.g. GET, POST incurs a cost\n\n### Object Versioning and MFA Delete\n\n- Disabled by default. **Once enabled you cannot disable it**\n- You can suspend it and a suspended bucket can be re-enabled\n  ![S3 versioning state](/assets/images/s3-versioning-state.png)\n\n- Versioning let's you store multiple version of objects within a bucket where as without it, there is a unique object name and the object gets replaced each time.\n- the 'id' is null if versioning is disabled, if it is enabled then s3 will allocate an id\n- newer versions will have a new ID\n- The newest version is known as Latest or current version\n- If you don't specify to s3 a specific version, you always get the latest. You can access individual versions by specifying the ID\n- If we delete an object, the object is not deleted, it's just hidden and marked with a delete marker. This is when we don't specify an ID/version\n- if we specify a version ID then an object is actually deleted\n- Important: **versioning CANNOT be switched off - only suspended\\***\n- Space is consumed by ALL versions and you are billed for ALL versions\n- Only way to remove all costs is to delete the bucket. Suspending does not remove the old versions\n- MFA Delete - enabled in versioning configuration which means you need an MFA token to change bucket versioning state or delete version\n- You would need to pass in MFA and the code passed with API calls to do these actions\n\n### S3 Performance Optimization\n\n- Default upload in s3 is using single data stream to s3. The issue with this is if the stream fails the entire upload fails and you need a full restart\n- A single PUT upload in AWS is limited to 5GB as a maximum\n- A solution to a single stream is using a **multi-part upload**\n- This breaks the original blob into individual parts\n- The **minimum** data size to use multi part upload is 100MB. It's recommended to use it for anything over 100mb.\n- An upload can be split into a maximum of 10,000 parts with each part between 5mb -> 5gb\n- Each individual part is treated as it's own isolated upload and can be restarted in isolation\n- It also improves transfer rates by uploading in parallel\n- S3 Accelerated transfer\n  - using the public internet is not the most ideal way to get data from source to destination as the route chosen by ISPs is not always optimal. S3 transfer acceleration uses the network of AWS Edge locations located in convenient areas. This feature needs to be switched on.\n  - Edge locations then use AWS Network as an 'express train' to get to the destination\n\n### Key Management System\n\n- A regional and Public service\n- Let's you create, store and manage keys\n- Handles both Symmetric and Asymmetric keys\n- Capable of performing cryptographic operations (encrypt, decrypt)\n- **Keys never leave KMS**\n- Uses a FIPS 140-2 (L2) - the L2 matters for the exam\n- KMS Keys are the keys that KMS manages\n- These are logical containers which contain ID, date, policy, desc and state.\n- KMS keys are backed by physical key material\n- The material is generated or imported and can be used for up to 4kb of data\n- KMS Keys do not leave the KMS product and the unencrypted form is never stored on disk\n- Data Encryption Keys (DEKs) are another type of key in KMS\n- DEK uses GenerateDataKey which can be used to encrypt and decrypt data more than 4kb in size\n- KMS does NOT store DEK, it provides it to you and discards it.\n- KMS will provide you with the plaintext and ciphertext version of this key\n- KMS does not do the encryption or decryption using DEK - you do or the service using KMS does\n- Services such as s3 use DEK for every object\n\n- KMS keys are isolated to a region and never leave\n- KMS keys CAN be multi region\n- THey can be AWS owned or customer owned\n- THere are two types of customer owned keys:\n  1. AWS managed - created automatically by services\n  2. Customer managed - created by customers and are more configurable\n- Both of these keys support rotation - with AWS managed keys this cannot be disabled but with customer it is optional\n- A KMS key contains a backing key which means previous backing keys can be used\n- Can use alias\n\n- Every KMS Key has a key policy (resource). For customer managed keys you can change it\n- KMS has to be explicitly be told which AWS account to manage it\n- Usually you use a combination of Key policies and IAM policies to manage KMS\n\n### S3 Object Encryption CSE/SSE\n\n- Buckets aren't encrypted - objects are\n\nData can be stored in disk in two different ways:\n\n1.  Client side encryption - objects are being encrypted by the client before they ever leave. AWS receives it in a scrambled form and stores it in a scrambled form\n2.  Server side encryption - in transit, the data is in it's original form, once it's hitting s3 it's encrypted by the s3 servers\n\n![S3 Encryption](/assets/images/s3-encryption.png)\n\nThere are 3 types of encryption for server side encryption:\n\n1. SSE-C - Server side encryption with customer provided keys\n2. SSE-S3 - with amazon s3 managed keys (this is the default)\n3. SSE-KMS - with KMS Keys stored in AWS Key management service\n\nSSE-C:\n\n- Customer is responsible for the keys and S3 manages the s3 encryption/decryption processes. When you put an object into s3 you put it through as plaintext alongside the encryption key. When it goes through https it will be encrypted to an external observer. The key is destroyed at s3.\n\nSSE-S3:\n\n- AWS handles both the encryption and the keys. You provide the plaintext data, the s3 encrypts it via a generated key for the object. You don't get to choose the key or customise it.\n\nSSE-KMS:\n\n- You use KMS to create a key. Client sends data via plaintext and it's encrypted by S3 via the KMS key. That key is used by s3 to generate an encryption Key. Using this method, key managers can decide who can see the unencrypted data\n\nSummary of encryption types\n\n![summary](/assets/images/s3-encryption-summary.png)\n\n### S3 Bucket Keys\n\n- A way to help s3 scale with server side encryption\n- using SSE-KMS, AWS KMS is called every single time a call is made to s3 to generate a DEK\n- This starts to cost a lot upon scaling\n- Instead of generating a new DEK from KMS every time, **bucket keys** will ask KMS to generate a time limited bucket key used to generate DEKs within s3\n- This significantly reduces KMS API calls, reduces cost and increases scalability\n- Using bucket keys means cloudtrail kms events now show the bucket not te object\n- Bucket key works with replication, object encryption is maintained\n- If you replicate a plain text bucket to a bucket that is encrypted, it will get encrypted at the destination side\n\n### S3 Object Storage Classes\n\n- **S3 standard** is the default storage class. This replicates objects across at least 3 availability zones (AZs) in the AWS region\n- if s3 object is stored, a HTTP 1.1 200 OK response is provided by the s3 API endpoint\n- You're billed a GB/m fee for data stored, a $ per GB charge for transfer OUT (in is free) and a price per 1,000 requests. No specific retrieval fee, no minimum duration, no minimum size\n- S3 standards can be made publicly available\n- S3 standard should be used for frequently accessed data which is important and non-replaceable. This should be used as the default and only investigate moving other classes if you need a specific use case.\n\n- **S3 Standard-IA (infrequent Access)**\n- The same as S3 standard in most ways however has a lower GB storage price and a retrieval fee that increases with frequent data access\n- there is a minimum duration charge for using it (30 days)\n- Has a min capacity charge of 128kb per object\n- S3 Standard-ia should be used for long-lived data which is important but where access is infrequent\n\n- **S3 One Zone-IA (infrequent Access)**\n- Shares many of the considerations of standard-IA\n- The big difference is that the data is stored in one AZ in the region\n- Should be used for long-lived data which is non-critical and replaceable and where access is infrequent\n- Examples could be intermediate data you can afford to use or for replica copies\n\n- **S3 Glacier - Instant**\n- Like s3 standard IA except it has cheaper storage, more expensive retrieval costs, and longer minimums\n- more for when you want to access something once a quarter as opposed to once a month\n\n- **S3 Glacier - Flexible**\n- A cheaper storage solution\n- Stored as if 'cold' and therefore cannot be made publicly accessible. Retrieving requires a retrieval process\n- Retrieved to s3 standard-IA temporarily\n- There are 3 different retrieval methods:\n\n1. expedited - 1-5 minutes\n2. standard - 3-5 hours\n3. bulk - 5-12 hours\n\n- the faster the retrieval the more expensive\n- situations for when you need to store archival data where frequent or realtime access isn't needed (e.g. yearly) and the access takes time.\n\n- **S3 Glacier - Deep Archive**\n- If you consider Flexible to be a 'chilled' state, then data in Deep Archive is in a 'frozen' state\n- 180 day minimum duration\n- The retrieval methods are:\n\n1.  standard (12 hours)\n2.  bulk (up to 48 hours)\n\n- best for data that rarely if ever needs to be accessed e.g. legal or regulation data storage\n- it's a cheaper storage\n\n**Intelligent Tiering**\nMonitors and automatically moves any objects not accessed for 30 days to a low cost infrequent access tier and eventually to archive instant access, archive access or deep archive tiers. If objects start to become more popular and frequently accessed, they will be moved back up the tiers to frequent access at no charge\n\n- Designed for long lived data with changing or unknown patterns\n\n### S3 Lifecycle Configuration\n\n- You can create life cycle rules on objects in an s3 bucket\n- A set of rules that consist of actions based on a criteria\n- Can be applied on a bucket or group of objects\n\ntwo types of actions can be applied\n\n- Transition actions - change the storage class of the object(s) e.g. from s3 standard to s3 IA after 30 days\n  - all the transitions transition 'downward' in a waterfall fashion, not upward\n  - the only exception of a transition not available downward is one zone-IA into S3 Glacier Instant Retrieval\n  - if you transition objects you need to be aware of the minimum days before transition for example s3 standard to standard IA or one zone IA it would need to have been in s3 standard for at least 30 days\n  - smaller objects can cost more upon transitioning due to minimum sizes\n  - moving from s3 to IA also requires an additional 30 days before you can move them again to glacier classes\n- Expiration actions - delete object(s) or versions\n\nYou can't apply these rules based on 'access frequency' in the same way intelligent tiering does\n\n### S3 Replication\n\nS3 has two replication features which allow objects to be replicated between source and destination buckets in the same or different AWS accounts:\n\n1. Cross region replication (CRR) - allows the replication of objects from a source bucket to one or more destination buckets in different AWS regions\n\n2. Same region replication (SSR) - as above but same region\n\nThe architecture replication is applied to the source bucket. It specifies:\n\n- the destination bucket\n- an IAM role to use for the replication process - s3 assumes that role\n- For replication across AWS accounts, the role isn't by default trusted by the destination account, therefore there needs to be a bucket policy in the destination account to allow the role to replicate into it\n\nReplication Options:\n\n- What to replicate - all objects or subset\n- which storage class the destination bucket will use - the default is the destination uses the same class as the source\n- you can define the ownership of the objects in the destination. Across accounts, the bucket objects will by default be owned by the source bucket account\n- Replication time control (RTC) - adds a guaranteed 15 minute SLA on to the replication process.\n\nReplication consideration:\n\n- By default, it's not retroactive - only from the point you enable replication will objects in the bucket be replicated. Objects prior to that time will not.\n- Versioning MUST be enabled for replication\n- batch replication can be turned on to replicate existing objects\n- objects are replicated only one way i.e. source to destination - there is a bi-directional setting that can be configured\n- replication can be unencrypted, SSE-S3, SSE-KMS (with extra config) and SSE-C\n- Source bucket owner needs permission to the object they replicate\n- It will not replicate system events that are made by life cycle management. Neither can it replicate glacier or glacier deep archive objects\n- Delete markers are not replicated - but can be enabled\n\nWhy use replication?\n\n- SSR (Same region replication) - Log aggregation - sync logs into a single s3 bucket\n- SSR - Prod and test sync\n- SSR - resilience with strict sovereignty\n- CRR (Cross region replication) - global resilience improvements\n- CRR - Latency reduction by replicating data to buckets closer to source\n\n### S3 PreSigned URLs\n\n- Presigned URLS in s3 are a way to generate a URL with access permissions in a safe way.\n- If a bucket is not public, only an authenticated aws user can access it\n- AWS offers pre-signed urls for the case where we don't want to give someone short term access to the bucket without making it public or creating an aws identity for them\n- This can be used for both PUT and GET operations\n- Pre-signed urls allow someone to access a certain object in a private bucket with the same access rights as the user who generated the url for a certain period of time\n- You can create a pre-signed url for an object you don't have access to where the url will also not provide access to the object\n- the url has the same permissions of the identity as of the time the url was made\n- Don't generate pre-signed urls with a role - URLs will stop working when temporary credentials expire - because assuming an IAM role gives you temporary credentials and the pre-signed url may expire far later than the credentials. It's best to use long term identities i.e. an IAM user\n\n### S3 Select and Glacier Select\n\n- Ways you can retrieve parts of objects rather than all of an object\n- S3 can store objects up to 5TB in size\n- Retrieving a whole object will take time\n- S3/Glacier select lets you use SQL like statements to select part of an object\n- Works on many file types such as CSV, JSON, Parquet, BZIP2 compression for CSV and JSON\n\n### S3 Events\n\n- Allows you to create event notifications on a bucket\n- When enabled, a notification is delivered when something happens on a bucket. It can be delivered to SNS, SQS and lambda functions\n- Can be generated when objects are created (PUT, POST, COPY and Multi part upload)\n- Can be generated on Delete (as well as delete markers)\n- For object restores (start and end)\n- Replication events\n\n### S3 Access Logs\n\n- Access logging provides detailed records for the requests that are made to a bucket. They are best effort - they are usually logged in target bucket within a few hours\n- Let you help the access patterns of your customer base\n\n### S3 Object Lock\n\n- Enable on new S3 buckets only otherwise you will need to contact AWS for an existing\n- You cannot disable object lock or versioning\n- Write Once Read Many (WORM) - No delete, no overwrite\n- Requires versioning to be enabled and individual versions are locked\n- An object version can have one, both or none of **retention period** or **legal hold**\n\nRetention Locking:\n\n- Specified in days and years\n- The two types you can do:\n  1. Compliance mode - an object version can't be adjusted, deleted or overwritten for that period. The retention period and mode cannot be changed even by the account root user. This is the most strict form of object lock. This could be good for compliance reasons e.g. medical or legal\n  2. Governance - can grant special permissions to allow locking settings to be adjusted (s3:ByPassGovernanceRetention). Useful if you want to prevent accidental deletions\n\nLegal Hold Locking:\n\n- Set on object version either on or off, no retention period\n- You can't delete or change until removed\n- You need permission to add or remove the legal hold\n- Good to prevent accidental deletion of critical object versions\n\n### S3 Access Points\n\n- A feature of S3 which improves the manageability of s3 buckets\n- Rather than having 1 bucket with 1 bucket policy you can conceptually split it into many access points with different policies\n- Each access point can be limited in terms of where they can be accessed from with it's own endpoint address\n- Can be created via the console of via the cli: `aws s3control create-access-point --name secretcats --account-id 12355423 --bucket catpics`\n- You can think of access points as mini buckets or views. The DNS of each AP is given to a section of users and those mini buckets are individually controlled\n- Any definitions defined in the access point policy need to be defined in the bucket policy e.g. giving permission to certain users for the access point\n\n## Virtual Private Cloud (VPC) Basics\n\n### VPC Sizing and Structure\n\n- A private network inside AWS\n- You need to decide what IP range to use in advance - it's not easy to change later. There are a few things you should keep in mind:\n\n  - What size should the VPC be? This influences how many services can fit into the VPC\n  - Are there any networks we can't use? Duplicate or overlapping ranges complicate things\n  - Be mindful of other VPC ranges, other cloud envs, on premises, partners and vendors and their IP ranges\n  - Try to plan for the future\n  - Consider the VPC structure - tiers and resiliency\n\n- A VPC can be at the smallest a /28 network (16 IP) and at most /16 (65536 IPs)\n- Avoid common ranges\n- Ranges can be determined by the number of regions a business operates in. A suggestion is to reserve 2+ networks per region being used per account\n  e.g. 3 US, Europe, Australia - 5 regions x 2 - Assume 4 accounts - total 40 ranges ideally\n\n- Deciding what size VPC to get, you should ask:\n  - How many subnets will you need in each VPC?\n  - How many IP Addresses will you need in total ad how many per subnet?\n- Services use subnets and subnets operate in 1 availability zone. THerefore you need to consider regions as some regions have more availability zones than others.\n  1. pick how many AZs yours would use - possibly use 4 as a default. This means you need 4 smaller networks\n  2. A suggested default is to start with four tiers - Web, application, database and a spare. If you only used 1 az then you would each tier would need it's own subnet so 4 subnets\n\n![VPC Design](./assets/images/vpc-design.png)\n\n### Custom VPCs\n\n- VPCs are a regionally isolated and regionally resilient service\n- Lets you create an isolated network in AWS\n- Nothing is allowed IN or OUT without explicit configuration\n- Flexible configuration\n- Hybrid networking\n- You have the option of created default or dedicated tenancy - allows you to either put the VPC in shared or dedicated hardware - If you put default you can change this later. If you put dedicated **it's locked in and any resources on this vpc will have to be dedicated too**. Only choose this if you really need it as it comes at a premium cost\n- Can use IPv4 private and public IPs\n- Private CIDR block is the main method of communication for the VPC\n- This primary block at it's smallest can be /28 (16 IP) and max /16 (65,536 IP)\n- You can create optional secondary IPv4 block\n- Can be configured to use IPv6 (/56). However, you can't pick a range, AWS chooses them for you unless you own specific IPv6 IPS\n\nDNS in a VPC:\n\n- Provided by R53\n- Available on the base IP address of the VPC +2\n- enableDnsHostnames - gives public DNS hostnames to instances\n- enableDnsSupport - enables DNS resolution in VPC - if not then the dns won't work\n\n### VPC Subnets\n\n- Subnets in VPCs start of entirely private and you need to configure them to be public\n- A subnet is an AZ resilient feature of the VPC\n- It's a subnetwork of a VPC within a particular AZ\n- 1 subnet is created a specific AZ in that region. It can never be changed and can never ben in multiple AZs. ONE SUBNET => ONE AZ. Although one AZ can have 0 or more subnets\n- Allocated an IPv4 CIDR - it has to be within the range of the VPC\n- The CIDR that a subnet uses can't overlap with other subnets in that VPC\n- Can optionally be allocated an IPv6 CIDR block. A /64 subset of the /56 is allocated (256)\n- Subnets can communicate with other subnets in the VPC\n- Sizes of networks are based on the prefix\n- Some IPs in every VPC network are reserved\n\nEvery VPC subnet has five addresses that cannot be used. Assuming the subnet we use is 10.16.16.0/20, the following can't be used:\n\n1. the network address (starting address) e.g. 10.16.16.0\n2. Network + 1 (10.16.16.1) - used by the VPC router\n3. Network + 2 (10.16.16.2) - Reserved by the DNS\n4. Network + 3 (10.16.16.3) - For future use\n5. Broadcast address 10.16.31.255 (Last IP in subnet)\n\nA VPC has a configuration object applied to it called a DHCP option set - (dynamic host configuration protocol) - how computing devices receive IP addresses automatically.\n\n- On every subnet you can define two important allocation options:\n  1. Auto assign public IPv4 - allocated public addresses as well as their private automatically\n  2. Auto assign public IPv6\n\n### VPC Routing, Internet Gateway & Bastion Hosts\n\nVPC Router:\n\n- Every VPC has a VPC router - it's highly available\n- In every subnet, the network+1 address is reserved for the vpc router\n- It routes traffic between subnets\n- It's controllable, you create route tables which influences what to do with traffic when it leaves the subnet\n- A VPC is created with a main route table - if you don't explicitly associate it, then it uses the main route table of the vpc. Otherwise if you create your own, the old one is dissociated. A subnet can only be associated with one route table at a time but a route table can be associated with many subnets\n- A route table is a list of routes - the vpc looks at the destination address, looks at the route table for the destination address and propagates the data to those destinations. It can be either to a single route or a range. The prefix is used as a priority - the higher the prefix the higher the priority\n- The target field in a route table is either pointing to a gateway or to local\n- All route tables have at least 1 route - the local route which matches the VPC CIDR range\n- If it's also ipv6 enabled it will have another default local route for ipv6\n- These local routes can never be updated, and those two will ALWAYS take priority\n\nInternet Gateway:\n\n- Regional resilient gateway which can be attached to a VPC\n- you do not need a gateway per availability zone\n- a vpc can have no internet gateways or just one\n- a gateway can have no attachments or 1 at a time\n- Runs from the border of the VPC and the aws public zone - allows services to be reached from the internet (AWS public zone)\n- it's a managed gateway, aws handles the performance\n- Public ipv4 internet addresses never actually touch the services inside the VPC. A record is created which the internet gateway maintains. The instance itself is not configured with a public IP.\n\nbaston Host / Jump boxes\n\n- An instance in a public subnet inside a vpc\n- used to manage incoming connections\n- this allows you to access internal vpc resource - it's a management or entry point to private vpcs\n- It used to be the only way in to a vpc\n\n### Stateful vs Stateless Firewalls\n\n- TCP and IP work together where TCP connection send IP packets\n- TCP runs on top of IP\n- A stateless firewall does not understand the state of connections. It needs two rules per inbound connection, an inbound and an outbound and 2 per outbound connection (inbound and outbound).\n- You will have to allow the full range of ephemeral ports allowed in stateless firewall since responding to a request in a stateless server goes back to a random requester port. This can be a security concern.\n- A stateful firewall is intelligent enough to identify the request and response components of a connection\n- you will only have to allow the request meaning the response is automatically allowed\n- You don't need to allow the full ephemeral port range because a stateful firewall is smart enough to know which port to open up for a request/response\n\n### Network Access Control Lists (NACLs)\n\n- Can be thought of as a traditional firewall available in AWS vps\n- Connections within a subnet are not affected by NACLs but inbound/outbound crossing the subnet boundary are filtered by NACLs\n- NACLs have inbound and outbound rules - data entering and leaving the subnet. Remember a request and a response can be both inbound and outbound.\n- A VPC is created with a default NACL. Inbound/outbound rules have the implicit deny (\\*) and an ALLOW ALL rule. The result is all traffic is allowed, the NACL has no effect\n- Custom NACLs are created for a specific VPC and are initially associated with no subnets. The default rule for inbound and outbound is an implicit deny (\\*). This means all traffic is denied by default\n- NACL crossing subnets needs the correct inbound/outbound rules\n- NACLs can only be assigned to subnets in AWS\n- They can be used together with security groups to add explicit DENY\n- Each subnet can have one NACL associated to it (default or custom)\n- A single NACL can be associated with many subnets\n\n### Security Groups (SG)\n\n- A second type of security filtering feature used in AWS VPC\n- SG's are stateful - they detect response traffic automatically for a given request\n- that means any IN or OUT request that is allowed will automatically allow a response - you don't have to worry about configuring ephemeral ports\n- The major limitation of SG's are that there is no EXPLICIT deny. You cannot block specific bad actors e.g. a range of or a single IP\n- Usually SGs and NACLs are used in conjunction for this reason\n- SG support iP/CIDR AND logical resources\n- This includes other security groups as well as itself\n- SGs are not attached to instances nor subnets, they are attached to specific elastic network interfaces known as ENIs\n- SG can use logical references - it can refer to other security groups so that you don't explicitly put IP ranges, any resource in that SG is allowed\n\n### Network Address Translation (NAT) & NAT Gateway\n\n- A set of different processes by changing their source/destination IP addresses\n- IP Masquerading is a subset of NAT. IT can hide CIDR IP Blocks behind one IP i.e. many private IP to one public IP\n- Since IPv4 addresses are running out, giving many private CIDR range **outgoing** internet access\n- A NAT gateway takes all the incoming packets from all the instances it's managing and it records all the information about the communication. It takes those packets, changes the source address from those instances to it's own IP address (external facing address).\n- NAT Gateways need to be run from a public subnet so that you can assign an external IPv4 for it\n- Uses Elastic IPs (static ipv4 public)\n- AZ resilient service - to make it region resilient, you should but a nat gateway in each AZ and a routing table for each AZ in that NAT gateway as a target\n- Can get costly if you have a lot of AZs\n- They are a managed service, you deploy and AWS takes care of them\n\n![NATGW Full resilience](./assets/images/natgw-resilience.png)\n\n- A NAT instance is when you make an EC2 instance run as a NAT instance\n- It's much easier and scalable to use a NAT gateway except for when:\n\n  - cost is an issue\n  - for test purposes\n  - need something free tier eligible\n  - you need to connect to them like normal ec2 instances - NAT Gateway cannot be used as a bastion host nor can they do port forwarding\n  - NAT Gateways don't support security groups, they can only use NACLs\n\n- NAT is not required for IPv6\n- In AWS IPv6 addresses are all publicly routable\n- **Nat gateways DON'T work with IPV6**\n- if you add ::/0 route, that will give an internet gateway bidirectional connectivity for ipv6\n- You can use Egress Only internet gateway if you want outbound only connection for IPv6\n\n## Elastic Compute Cloud (EC2) Basics\n\n### Virtualization 101\n\n- EC2 provides virtualisation as a service (IaaS)\n- Virtualization is the process of running more than one operating system on a piece of physical hardware (a server)\n- Before virtualization, Applications would run on top of an OS in user mode. They cannot directly access hardware resources. If apps try to do that it would cause a system wide error or crash the application\n- Virtualization fixes this by allowing a single piece of hardware to run multiple OS' where each is separate.\n- Historically, virtualization was done in two ways:\n\n1. Emulated Virtualization (software) - the OS still ran on the hardware on top of a hypervisor. The software ran in privileged mode. Each OS ran inside in a virtual machines. They have emulated hardware provided by the hypervisor. The main issue was that this method was slow.\n2. Para-virtualization - only works on a small subset of OS that can be modified.\n\nThe major improvement in virtualization came when the physical hardware became virtualization aware. This is known as hardware assisted virtualization. The CPU itself knowns virtualization exists. The hardware redirects privileged calls to the hypervisor.\nThe process of where the hardware devices themselves become virtualization aware is known as SR-IOV - single route I/O virtualization. Allows a network card or any other I/O card to present itself as not a single card but as several mini cards. These are presented to the guest operating system as real cards and hence the hypervisor doesn't need to be used - the OS can directly use it's card when it wants.\n\n### EC2 Architecture and Resilience\n\n- EC2 instances are virtual machines (OS + Resources)\n- Run on EC2 Hosts which are either shared or dedicated\n- Shared hosts are used by different AWS customers so you don't get ownership of hardware and you pay for usage and resource. There is still no visibility between customers when using shared hosts. Shared host is the default type of hosting\n- Dedicated hosts is dedicated to your account and you pay for the whole thing. You don't share it with any AWS customers.\n- EC2 is an **AZ resilient service** - Hosts run in a single AZ. If that AZ fails then hosts will fail and any instances on those hosts will fail or be impacted\n- EC2 have some local hardware: cpu, memory and storage (instance store). The instance store will be lost if the instance moves to another host. They also have storage and data networking.\n- EC2 can connect to network storage known as Elastic Block Store (EBS). EBS also rus inside an AZ. You can't access it cross zone.\n- If an availability zone in AWS has issues, it impacts ec2, subnets, storage and volumes.\n- An instance runs in a specific host and it will stay on that host when you restart it. It stays there unless it fails or is taken down by AWS. Also if it is stopped and started which is different to restarting. In that instance it will be relocated to another host but it will still be in the same AZ\n- You can never connect network interfaces or EBS storage in one AZ to an ec2 instance in another AZ\n\nEC2 is good when:\n\n- When you have a traditional OS and compute need\n- Long running compute needs as it's designed for persistent long running compute requirements\n- You have server style applications\n- For burst or steady state load\n- For monolithic application stacks\n- For migrating application workloads or disaster recovery\n- EC2 tends to be the default compute service in AWS unless you have niche requirements.\n\n### EC2 Instance Types\n\nFactors in choosing instances:\n\n- CPU, memory, local storage capacity and type will influence which instance type you choose\n- Resource ratios can give you different ratios of different o resource which will also affect your decision\n- The amount of storage, data and network bandwidth\n- The architecture and vendor the instance is run on - x86, ARM, intel, AMD\n- Additional features and capabilities - GPUs, FPGAs\n\nEC2 instances are grouped into 5 main categories:\n\n1. General Purpose - default - should be first choice. even resource ratio, diverse workloads\n2. Compute Optimized - Media Processing, High performance computing, scientific modelling, gaming, machine learning. Ratio is higher towards CPU\n3. Memory Optimized - inverse of compute - ideal for applications for processing large in-memory datasets, database workloads\n4. Accelerated computing - for additional capabilities e.g. hardware GPUs field programmable gate arrays (FPGAs)\n5. Storage Optimized - fast local storage needs - sequential and random IO. Data warehouses, elastic search, data analytics\n\nDecoding EC2 Types:\nExample: \"R5dn.8xlarge\"\n\n- Letter at the start is the instance family - specific type/types of computing\n- Next (5) is the generation e.g. 5th generation of the family. The latest generation should ideally always be used\n- the part of the dot - the size \"8xlarge\" - the instance size\n- the \"dn\" - additional capability e.g n could mean network optimized\n\n![EC2 Instance Types](./assets/images/ec2-instance-types.png)\n\n### Storage Refresher\n\nStorage terms:\n\n- Direct (local) attached storage - Storage on the EC2 Host. Fast but prone to loss\n- Network attached storage - volumes delivered over the network (EBS). Resilient but slower\n- Ephemeral Storage - temporary storage\n- Persistent Storage - Permanent storage - lives on past the lifetime of the instance\n\nThree main categories of storage available in AWS:\n\n1. Block storage - Create a volume that has addressable blocks. No structure provided. The OS usually takes the block storage and creates a file storage on it. Can be HDD or SSD or a logical storage that's backed by physical storage. You can mount and boot off this volume.\n2. File storage - presented as a file server with a structure already there. Mountable but not bootable since the OS doesn't have low level access to it.\n3. Object storage - Flat collection of objects. Not mountable or bootable.\n\nStorage Performance terms:\n\n- I/O (block) size - the size of the blocks of data that you're writing to disk - KB/MB.\n- IOPS - input output operations per second - how many reads/writes a disk or storage system can accommodate in a second\n- Throughput - amount of data that can be transferred per second - MB/s. Relies on using the right block size and then maximising the number of IOPS\n\nIO X IOPS = THROUGHPUT\n\n### Elastic Block Store (EBS) Service Architecture\n\n- Provides block storage which can be addressed using block IDs. It takes raw physical discs, and presents a raw allocation of those disks known as volumes. These volumes can be written to or read from using a block number. They can be encrypted\n- When you attach a volume to an EC2 they see a block device and they can use it to create a file system on top of it (ext3/4, xfs). They appear just like any other storage design\n- Storage is provisioned in ONE AZ. It is separate and isolated within that AZ.\n- You can attach to one EC2 instance (or other service) over a storage network. There is a multi attach feature which allows to attach to multiple at a time but it needs to be managed so that there aren't multi writes\n- You can de-attach and reattach the EBS to another volume. EBS are persistent so if an instance moves or stops, restarts, the EBS is maintained\n- Snapshots can be taken of EBS volumes and they can be regionally resilient by migrating them between AZs and regions\n- EBS can provision different physical storage types, sizes and performance profiles\n- You are billed based on GB-month (and sometimes performance)\n\nYou can't communicate across AZs for EBS\n\n![EBS sample architecture](/assets/images/ebs-sample-architecture.png)\n\n### EBS Volume Types - General Purpose\n\nGP2 - SSD:\n\n- it's high performance storage for a low price.\n- from 1GB - 16TB\n- Allocated with IO credit of 16KB. IOPS is 16kb. 1 IOPS is 1 IO in 1 second\n- IO Credit bucket has a capacity of 5.4 million IO credits\n- Bucket fills with min 100 IO credits per second regardless of volume size\n- GP2 can burst up to 3000 IOPS by depleting the bucket\n- All volumes start with an initial 5.4 million IO credits\n- Maximum IO per second is 16,000\n- GP2 is flexible storage for general usage. It can be a default if GP3 isn't there yet\n\nGP3 - SSD:\n\n- Removes the credit architecture of GP2\n- Starts at 3000 IOPS & 125 MiB/s\n- 20% cheaper than GP2\n- You get benefits of GP2 with this\n- Extra cost for up to 16,000 IOPS or 1,000 MiBs\n\n### EBS Volume Types - Provisioned IOPS\n\nio1/2 - SSD:\n\n- IOPS is configured independently of the volume. Good for consistent low latency and jitter.\n- 4x IOPS of gp2/3 (up to 64,000)\n- Block express gets you more IOPS and MiBs\n- There is a maximum performance that can be achieved - a per instance performance\n- Provisioned io can be good for low latency consistency with high levels of performance e.g. low volumes but high performance\n\n### EBS Volume Types - HDD-Based\n\n- These volume types are slower\n\nTwo types of storage in EBS:\n\n1. st1 - throughput optimised\n\n- cheap\n- 125gb - 16tb\n- maximum of 500 IOPS - 1mb blocks - max of 500 MB/s\n- Useful for big data, data warehouses, log processing\n\n2. sc1 - cold HDD\n\n- cheaper\n- 125gb - 16tb\n- designed for infrequent workloads - used for maximum economy where performance isn't as important\n- max 250 IOPS - max 250 MB/s\n- lowest cost ebs storage type\n- cold data with few scans a day\n\n### Instance Store Volumes - Architecture\n\n- Block storage devices - raw volumes presented to an instance that present TEMPORARY storage\n- Like EBS except local\n- physically connected to one EC2 host\n- Instances on that host can access those volumes\n- High storage performance\n- Included in the instance price\n- Have to be attached at launch time - CANNOT be attached after like EBS\n- these are temporary volumes\n\n![alt text](./assets//images/instance-store-volumes.png)\n\n- if you move an instance between hosts, that data is lost. They are given new ephemeral volumes.\n- if a physical volume fails, then the instance would lose that data\n- these should only be used for temporary data\n- some instance types don't support these\n- performance is a strength of instance store e.g. 4.6 GB/s - 16 GB/s throughput depending on HDD or SSD\n- More IOPS and Throughput VS EBS\n- Local to EC2 HOST\n- if the volume is resized the data is also lost\n- You pay for it with the instance so there is no advantage to not using them\n\n### Choosing between the EC2 Instance Store and EBS\n\n- Persistence required - default to EBS (avoid Instance store)\n- Resilience - as above\n- If you need storage isolated from instance lifecycles then use EBS\n- If your instance requires resilience but your app supports built-in replication, you could use lots of instances\n- If you need high performance - both could be good although super high performance, instance store makes more sense\n- If cost is a concern, instance store makes sense as it comes with the instance\n\nREMEMBER these figures:\n\n- If you need cheap storage but with EBS, use ST1 or SC1 because they are cheaper\n- Throughput or streaming should default to DT1\n- if you need a boot volume NEITHER ST1 OR SC1 are suitable\n- GP/2 - can deliver up to 16,000 IOPS\n- IO1/2 - up to 64,000 IOPS (\\*256,000 for block express for large instance types)\n- RAID0 + EBS can achieve 260,000 IOPS (io1/2-BE/GP2/3 combination)\n- If you need more than 260,000 and you can deal with less resilience or no persistence, then use Instance Store\n\nThese figures are important to remember:\n![ec2 instance store vs ebs](./assets/images/instance-store-ebs.png)\n\n### Snapshots, Restore & Fast Snapshot Restore (FSR)\n\n- Backup volumes to s3\n- Protect against AZ issues, migrate data between AZs\n- Snapshots become region resilient\n- Incremental in nature - the first is a full copy of the data on the volume\n- Future snapshots only store the difference - consume less space and are quicker to perform\n- If you accidentally delete a snapshot, future snapshots will fix any lost saves\n- EBS volumes can be blank or based on a restored snapshot\n- Snapshots can be copied between regions\n\n![Ebs Snapshot architecture](./assets/images/EBS-snapshots.png)\n\nNuances to Snapshot/volume performance:\n\n- Snaps restore lazily - fetched gradually\n- Fast Snapshot Restore (FSR) is an option to immediately restore\n- Up to 50 FSR snaps per region can be restored. Set on the Snap and AZ.\n- FSR costs extra and can get expensive\n- You can achieve the same end result by manually getting the OS to read all the data in s3 which forces the requested blocks to be pulled in\n- Snapshots are billed at Gigabyte per month\n- The data stored is the USED not the allocated data e.g if you use 10 of 40gb only 10gb is stored and billed on\n\n### EBS Encryption\n\n- EBS is not encrypted by default\n- EBS Encryption uses a KMS key using either a default KMS/EBS key or a customer managed key\n- The key is used to create a data encrypted key (DEK)\n- What is stored in the EBS is encrypted and what is in the instance's memory is the decrypted version\n- Any snapshot of the EBS will also be encrypted with the same key\n- It doesn't cost anything to use so you should use it by default\n- Accounts can be set up to encrypt EBS by default\n- Each volume uses a 1 unique DEK\n- If you create any EBS volumes from a snapshot with an encryption key, it uses that same DEK\n- You can't change a volume NOT to be encrypted\n- OS isn't aware of the encryption therefore there is no performance loss\n\n### Network Interfaces, Instance IPs and DNS\n\n- Instances all start of with 1 network interface (a primary ENI - Elastic Network Interface)\n- Network interfaces need to be in the same AZ as an instance\n- Network instances have a MAC address which is the hardware address\n- Network instances have a primary IPv4 Private IP\n- 0 or more secondary private IPs - doesn't change for the lifetime of the instance\n- 0 or 1 public IPv4 address - dynamic and will change e.g. when you stop and start an instance (not restarts)\n- 1 elastic IP per private IPv4 address - assigning this means the instance will remove the dynamic public IPv4\n- 0 or more Ipv6 addresses (these are publicly routable)\n- Security groups\n- Per interface you can enable/disable source/destination check\n- Secondary interfaces can be moved to other instances\n\n- you might use different network interfaces for different security groups\n- OS never sees the public IPv4 - this is performed by the internet gateway - You will NEVER configure an IPv4 public address\n- Public DNS will resolve to the primary private IP in the VPC. Instance to instance communication will not leave the VPC because of this. Everywhere else, it resolves to the public IP address.\n\n### Amazon Machine Images (AMI)\n\n- Images of EC2 - you can create a template of an instance configuration and use that template to create other instances\n- When you create an instance you're using AWS provided AMIs but you can create your own\n- AMIs can be AWS or Community provided as well e.g. Redhat, Centos, Ubuntu\n- Marketplace also provide AMIs which include commercial software\n- AMIs are regional and they have a unique ID (ami-[letters, numbers])\n- AMIs can control permissions (public, your account, specific accounts)\n- You can create an AMI from an existing EC2 instance\n\nAMI Lifecycle:\n\n1. Launch - create an instance from AMI\n2. Configure - Customising your instance\n3. Create image - Creating a new AMI from the instance - Snapshots are also taken of EBS volumes and they are references by the AMI as block device mapping\n4. Launch - when the AMI is used to create a new instance, it will have the same EBS volume as the original\n\n- AMI's are in ONE region. Only works in that region but it can be used to deploy into all AZs in that region\n- AMI Baking - creating an AMI from configured instance\n- AMI **can't be edited** - you need to launch an instance, update the config and make a new AMI\n- AMI can be copied between regions but they become SEPARATE AMIs\n- Permissions of AMI by default is your account - it can be private, public or given to specific accounts\n\n### EC2 Purchase Options\n\n- Sometimes known as launch types\n  On demand:\n  - default\n  - Instances of different sizes run on the same EC2 hosts with different AWS customers.\n  - On demand uses per second billing while instances are running. Associated storage e.g. storage will charge even when the instances are shut down\n  - For all projects, assume on demand and move only when needed\n  - No interruptions\n  - Will not give you priority access if there are any failures\n  - Predictable pricing, upfront costs but no discounts\n  - Good for short term workloads or unknown workloads\n  - For apps that can't be interrupted\n\nSpot pricing:\n\n- Cheapest\n- AWS sells spare capacity in an EC2 host at a discounted rate (up to 90% discount)\n- Will charge up to your maximum price before terminating any of your instances\n- Never use SPOT for workloads which can't tolerate interruptions\n- Good fits for SPOT workloads are things that are not time critical or can tolerate interruption/re-run e.g. media processing\n\nReserved instances:\n\n- For long term consistent usage of EC2\n- Reduce the per-second cost or remove it entirely\n- It's possible to reserve and not use and therefore still be built\n- You can commit for 1 year of 3 years - the longer the more discounted but you need to be careful of wasted resource\n- You can choose to pay no upfront - per second fee\n- You can choose upfront means no per second fee so you get the greatest discount here\n- Partial upfront - pay a smaller lump sum in advance for a lower per-second cost\n\nDedicated host:\n\n- An EC2 host that is dedicated to you in it's entirety\n- You pay for the host - the instances on the host you don't pay for so they can be any size up until the capacity\n- You have a feature called host affinity - stopping and starting instances means that they can stay on the same host\n- A good use case for dedicated host is you are using software that has licensing based on socket and core\n\nDedicated Instances:\n\n- A middle ground - instances run on ec2 hosts with other instances of yours and no other customers use the same hardware. You don't pay for the host nor share. You don't to manage the host itself\n- You have to pay one off hourly fee for any regions where you use them\n- A fee for the dedicated industry itself\n- This is where you may be an industry where you cannot use the same underlying hardware as other customers\n\nFocus : On-demand, spot and reserved for the exam\n\n### Reserved Instances - the rest\n\n- If you need access to the cheapest ec2 running all the time then you would pick standard reserved\n- Scheduled reserved:\n- are great for when you have long term requirements but when it doesn't need to be run constantly e.g. batch processing\n- If you reserve for that time window that's the only time you can use it\n- Doesn't support all instance types and regions. 1,200 hours per year and 1 year minimum terms\n- Capacity reservations\n  - have a requirement for some compute that you can guarantee you can launch when you need\n  - You can purchase a reservation and make it a regional one, you get billing discounts on instances in the AZ. They don't reserve capacity within an AZ which is risky during major faults when capacity can be limited\n  - You can pick a zonal reservation - only apply to one AZ providing billing discounts and capacity reservation in that AZ\n  - Regional/AZ are both 1 or 3 year commitment - you can choose on demand capacity reservation - can be booked to ensure you always have access to capacity in an AZ when you need it but at full on demand price. You will pay regardless of whether you consume it\n\nSavings plan:\n\n- an hourly commit for 1-3 years and you get a reduction\n- You can make a reservation for general compute amounts\n- Or a specific EC2 savings plan\n\n### Instance Status Checks & Auto Recovery\n\n- Every instance has two high level per instance checks:\n  1. Systems status - failure could mean loss of system power, loss of network connectivity, host software issues, hardware issues\n  2. Instance status - corrupt file system, incorrect instance networking, OS kernel issues\n- You can manually stop/restart an instance to fix status checks otherwise you can set up auto-recovery\n\n### Horizontal & Vertical Scaling\n\n- Two different ways to handle increasing and decreasing load on the system\n\nVertical scaling:\n\n- Use a bigger server e.g. using a different ec2 instance i.e. go from t3.large to t3.xlarge\n- There will be downtime when you do this - you should do it during an outage window\n- Larger instance carry a price premium\n- there is an upper cap on the performance of an instance\n- No application modification required\n- works for all applications even monolithic\n\nHorizontal scaling:\n\n- Instead of increasing the size of an individual instance, you add more instances with load\n- Instead of one running copy of your application you will have multiple that need to work together\n- For that reason you will need a load balancer usually so that the load is distributed across the instances\n- Sessions handling is important - since you may be shifting between instances constantly - you would need application support or **off-host sessions** which means that the session is stored somewhere else e.g. another db\n- Using off-host sessions would mean the application is stateless - the application doesn't care which instance you connect to\n- You have no disruption while you're scaling - customer connections remain unaffected and if the sessions are externally hosted it wouldn't matter if you scale down either\n- There are no real limits to horizontal scaling\n- Often less expensive - no large instance premium\n- more granular in terms of resource management\n\n### Instance Metadata\n\n- A service EC2 provides to instances where you can access data about an instance\n- Used to configure and manage an instance\n- Accessible inside all instances - you access it via the IP: http://169.254.169.254 -> http://169.254.169.254/latest/meta-data/\n- Data/information provided:\n  - environment\n  - networking\n  - authentication\n  - user-data\n  - NOT AUTHENTICATED or ENCRYPTED - if you connect to an ec2 you can access this. You can restrict it with a firewall for extra money\n\n## Containers & ECS\n\n### Introduction to Containers\n\n- A container is similar to a VM in that in provides an isolated environment\n- Where virtual machines run a whole isolated OS, a container runs as a process within the host operating system\n- The processes are like isolated OS\n- Containers are much lighter than virtual machines since they don't need to run a full OS\n- A container is a running copy of a docker image\n- Docker images are a stack of layers created using a docker file\n- Docker images are how we create a docker container - a running copy of a docker image\n- A container registry is a hub of container images - it can be private or public e.g. docker hub\n\nContainer key concepts:\n\n- Dockerfiles are used to build images\n- Containers are portable, self contained and always run as expected\n- Containers and images are super lightweight\n- Containers only run the application and environment it needs\n- Provide much of the isolation VMs do\n- Ports are 'exposed' to the host and beyond\n\n### ECS - Concepts\n\n- ECS is a product that allows you to run containers fully or partially managed by AWS - it takes away much of the admin overhead of managing containers\n- ECS to containers is what ec2 is to virtual machines\n- ECS uses clusters which runs in two modes: ec2 mode which uses ec2 instances as container hosts or fargate mode which is a serverless way of running docker containers\n- ECS lets you create a cluster\n- AWS also have a container registry called ECR (elastic container registry)\n- A task in ECS represents the container as a whole\n- A task role is the IAM role a task can assume to interact with AWS resources - a task role is the best way to give permission to containers\n- Tasks and containers are separate things. A task can include one or more containers.\n- A service definition is how we can define a task to scale and how we want it to run\n\n- A container definition - defines the image and ports that will be used for a container - points to a container image in a registry\n- A task definition applies to the application as a whole. It can be a single container definition or multiple containers and multiple container definitions. It's also where you define a task role and the resources that your task is going to consume\n- A task role is the IAM role which hte task assumes\n- Service - how many copies of a task you want to run, High availability, restarts\n\n### ECS - Cluster Mode\n\nEC2 cluster types defines a number of things but one of them is how much admin overhead surrounding running a set of container hosts that you manage vs how many AWS manage.\n\nEC2 Mode:\n\n- Start with an ECS management component (also exists in fargate) - handle high level tasks\n- An ECS cluster is created within VPC in your AWS account - benefits from the multiple AZs\n- EC2s are used to run containers\n- Auto scaling groups are used\n- If you want to use containers in your infrastructure but you want to also manage host capacity and availability then EC2 mode is the appropriate choice\n- With EC2 mode, even if you're not running any tasks or services in your containers, you will still be paying for them while they're running\n\nFargate mode:\n\n- removes more overhead\n- you have no servers to manage - you won't have to pay for EC2 instances\n- AWS have a shared fargate infrastructure\n- Fargate still operates in VPC and across AZ\n- Tasks and services run on the shared infrastructure platform and are then injected into your VPC - they're given network interfaces inside the VPC\n- You only pay for the containers you are using based on the resources they consume - you don't need to manage or provision hosts\n\nEC2 vs ECS (EC2) vs Fargate:\n\n- if you use containers, use ECS over EC2\n- Pick EC2 mode when you have a large workload and price conscious organisation - you can use reserved pricing and try to optimise\n- Large workload but overhead conscious - use fargate\n- Small or burst style workloads - fargate makes sense as you only use for the resources the container uses\n- batch/periodic workloads - fargate\n\n### Elastic Container Registry (ECR)\n\n- ECR is a managed container image registry service - like docker hub but for AWS\n- We have public and private registries - each aws is provided with one of each.\n- Each registry can have many repositories (think of github)\n- Inside each repo you can have many container images and these can have several tags.\n- The tags need to be unique within your repository\n- public registry means that anyone can have read only access to anything within that repo (read write needs permission)\n- private registry means permission required for read only OR read write\n- ECR is integrated with IAM for permission\n- Image scanning is either in basic or enhanced (using inspector product)\n- ECR provides near real time metrics - delivered into cloud watch (auth, push, pull)\n- ECR logs all api actions into cloud trail\n- Generates events that are pushed to eventbridge\n- offers replication cross region and cross-account\n\n### Kubernetes 101\n\n- Open source container orchestration system - use it to automate the deployment, scaling and management of containerised applications\n- A cloud agnostic product so you can use it on many cloud platforms\n- A kubernetes cluster is a highly available cluster of compute resources which are organised to work as one unit\n- The cluster starts with a cluster control plane - it manages the cluster, scheduling, applications, deploying\n- Cluster nodes are VM or Physical servers which function as a worker in the cluster - they run the containerized applications\n- containerd or docker is the software for handling container operations\n- kubelet is the agent to interact with the cluster control plane\n- kubelet interacts with the control plane using kubernetes API\n- Pods are the smallest unit of computing in kubernetes. It's common to see one container one pod architecture\n- You could run multiple containers in a pod but it's usually when they're tightly coupled and are in close proximity\n- You will rarely manage pods directly - they are temporary\n- kube-api server is the front end for kubernetes control plane\n- etcd provides a highly available key-value store - main backing store\n- kube-scheduler - responsible for checking pods that don't have a node assigned - will assign based on constraints\n- optional component - cloud-controlled-manager - provides cloud specific control logic i.e. AWS/azure/GCP\n- kube controller manager - cluster controller processing - node controller, job controller, endpoint controller, service account & token controllers\n- on every node - kube proxy is a network proxy - it coordinates networking with the control plane\n\nsummary terms:\n\n- **cluster** deployment of kubernetes\n- **node** - resources: pods are placed on nodes\n- **pods** - smallest unit in kubernetes - often 1 container 1 pod\n- **services** - an abstraction from pods - service running on 1 or more pods\n- **job** - ad-hoc, creates one or more pods until completion\n- **ingress** - exposes a way into a service\n- **ingress controller** - used to provide ingress e.g. AWS LB controller\n- **Persistent storage (PV)** - provision long running storage to your applications\n\n### Elastic Kubernetes Service (EKS) 101\n\n- A fully-managed kubernetes implementation that simplifies the process of building, securing, operating and maintaining kubernetes clusters\n- Can run on AWS, outposts, EKS anywhere, EKS distro - open source\n- Control plane is managed by AWS and scales based on load across multiple AZs\n- Integrates with other AWS services - ECR, ELB, IAM, VPC\n- EKS Cluster = EKS Control Plane & EKS Nodes\n- etcd is distributed across multiple AZs\n- Nodes can be self managed, or managed groups or fargate pods - deciding between these is checking the node type and what it needs\n- For persistent storage - can use EBS, EFS, FSx\n\n## Advanced EC2\n\n### Bootstrapping EC2 using User Data\n\n- Bootstrapping is the process of bringing an instance with a certain pre-configured state\n- Bootstrapping is a general term outside of AWS\n- Within EC2 it can allow build automation\n- Bootstrapping in EC2 is enabled using ec2 User Data - accessed via the meta-data IP (169.254.196.254/latest/user-data)\n- Anything in the user data is executed by the instance OS\n- Executed ONLY on the FIRST initial launch\n- EC2 doesn't interpret, the OS needs to understand the User Data\n\n- EC2 on launch checks User Data and executes it or errors on a bad config\n- User data:\n  - is opaque to EC2 - it is just a block of data\n  - not secure - don't use it for passwords or long term credentials\n  - limited to 16kb in size\n  - can be modified but the contents are only executed ONCE on launch\n\nBoot time to service time - how quickly after you launch an instance is it ready to use\n\n- For an aws managed AMI it's usually in minutes\n- You can do the work in advance by AMI baking\n- the optimal way is to combine bootstrapping and baking - use AMI baking for any part of the process that is time intensive\n\n### Enhanced Bootstrapping with CFN-INIT\n\n- A way you can pass complex bootstrapping instructions to EC2 instances\n- cfn-init is a helper script which is installed on EC2 OS\n- User data is procedural where as cfn-init is the desired state (declarative)\n- can work with packages, groups, users, sources, files, commands and services\n- Provided with directives via Metadata and AWS::CLoudFormation:Init on a CFN resource\n- Unlike with user-data that only works on first launch, cfn-init can work with stack updates so that it can execute again and update the configuration of that instance\n\nCloudformation creation policies and signals:\n\n- Creation policies is something that is added to a logical resource with a timeout value. It waits for a signal from the resource as either a success or error. The resource in cloud formation will show that there is an error if there is one\n\n### EC2 Instance Roles & Profile\n\n- EC2 instance roles are roles that an instance can assume and anything running in that instance has those permissions\n- An instance profile is a wrapper around an IAM role, it's a way to put the credentials into an instance. This is what gets attached to an ec2 instance.\n- The credentials are delivered by tbe instance meta-data. The credentials are always renewed before they expired. It will never be in a position where they expire. (automatically rotated)\n- Credentials are in /iam/security-credentials/role-name\n- Always use roles where possible - they are always preferable to use as opposed to long term credentials\n- CLI tools use ROLE credentials automatically\n\n### SSM Parameter Store\n\n- Parameter store is a storage for configuration and secrets\n- Many AWS services integrate with Parameter store natively\n- Allows you to store 3 different types of parameters: String, StringList, SecureString\n- You can store License codes, database strings, full configs and passwords\n- Allows you to store in hierarchies and use versioning\n- Can store plaintext and ciphertext (can integrate with KMS)\n- Public parameters available e.g latest AMIs per region\n- anything using it needs to be an AWS service or have access to the public endpoints\n\n### System and Application Logging on EC2\n\n- Cloudwatch is for metrics and cloudwatch logs is for logging\n- Neither of those products natively capture data inside an instance\n- A cloudwatch agent is required - it runs in the ec2 instance and captures OS visible data and sends it to cloudwatch or cloudwatch logs\n- It needs the configuration and permissions to be able to access and send that data\n\n### EC2 Placement Groups\n\n- EC2 usually selects an AZ for you when you launch an instance\n- Placement groups ensure that instances are physically close together or not\n- There are three types of placement groups:\n\n1. Cluster - any instances in a single cluster placement group are physically close together\n2. Spread - the inverse where instances are kept separate\n3. Partition - for distributed and replicated applications where each group is on different hardware\n\nBest practice with cluster group is to launch all the instances at the same time.\nTypically instances in the same group are usually on the same rack, sometimes the same host. They have a direct connection to each other which ensures there is speedy communication between them. Lowest latency and max PPS possible in AWS.\n\n**Cluster placement groups** are used when you really need performance. The con is that there are little resilience because if the AZ goes down the whole cluster goes down.\n\n- You can't span cluster placement groups across AZs - they must be on ONE AZ only and this is locked when launching first instance\n- You can span VPC peers but it will signifcantly impact performance\n- Not supported on every instance type\n- You should use the same type of instance (although it's not mandatory)\n- You should launch them at the same time (this is again not mandatory but **very recommended**).\n- Offer 10gbps single stream performance\n- Use cases: Performance, fast speeds, low latency e.g. high compute\n\n**Spread placement groups**:\n\n- designed to ensure the maximum amount of availability and resilience\n- Can be across availability zones\n- Instances are on separate racks so if a rack fails, it won't affect the other instances\n- There is a limit to 7 instances per AZ\n- Provides infrastructure isolation - every instance will be entirely separate from every other instance in that spread placement group\n- each instance runs from a different rack with its own network and power source\n- You can't use dedicated instances or hosts\n- Use case: small number of critical instances that need to be kept separate from each other\n\n**Partition placement groups**:\n\n- Similar to spread groups\n- Designed for when you have infrastructure where you have more than 7 instances per AZ but you still have a requirement to separate them\n- Can be created across multiple AZs and you must specify the number of partitions per AZ with a maximum of 7 partitions per AZ.\n- Each partition has it's own rack and power\n- You can launch as many instances as you need per partition and you can either select the partition explicitly or have AWS make that decision on your behalf\n- Great for topology aware applications such as HDFS, HBase and Cassandra\n- Can help topology aware applications contain the impact of a failure to part of an application\n\n### Dedicated Hosts\n\n- A dedicated host is an EC2 host that is dedicated to you in it's entirety\n- the host is designed for a specific family of instances e.g. a1, c5, m5 etc\n- No instance charges - you pay for the host\n- Can either pay on demand or reserve options\n- Host hardware comes with a certain number of physical sockets and cores - this dictates how many instances can be run and some software is licensed on the number of sockets and cores of the hardware\n- Older hosts required all the instances to be the same size but newer ones allow you to mix sizes\n\nLimitations and features:\n\n- AMI Limits - you can't use RHEL, SUSE linux, Windows AMIs\n- Can't use Amazon RDS instances\n- Can't use placement groups\n- Hosts can be shared with other accounts in the org using RAM (resource access manager) and those other accounts can create instances on that host. They can only see the instances they created only. You as the owner of the host cannot control the ones that are created by other accounts\n- Dedicated hosts are generally used for software licensing / licensing issues. It's not typically the approach you would take just for running EC2 instances\n\n### Enhanced Networking & EBS Optimized\n\n- Enhanced network is a feature which is designed to improve the overall performance of EC2 networking\n- Required for any high end performance features such as cluster placement groups\n- Uses SR-IOV - Makes it so a physical network interface in an EC2 instance is aware of virtualization\n- Offers logical cards per physical card - gives each instance exclusive access to each logical card. Handles the process end to end without consuming the host process' CPU\n- Higher I/O and lower host CPU usage as a result\n- more bandwidth\n- higher packets per second (PPS)\n- Consistent lower latency\n- Available at no charge for EC2 and available on most EC2 types but needs to be configured\n\nEBS Optimized\n\n- Historically, network used to be shared by data and EBS\n- EBS Optimisation means a dedicated capacity is provided for EBS usage\n- This means faster speeds for EBS and it doesn't impact the data side\n- Most instances support and have enabled by default\n- Some older instances its supported but enabling costs extra\n\n## Route 53 - Global DNS\n\n### R53 Public Hosted Zones\n\n- There are two types of DNZ Zones in Route 53 - public and private.\n- A hosted zone is a DNS database for a given section of the global DNS database e.g. animals4life.org\n- A globally resilient service\n- Hosted zones are created automatically via R53 - or separately and R53 will host it\n- A zone hosts DNS records e.g. A, AAAA, MX, NS, TXT\n- A hosted zone is what the dns system references and it's authoritative for that domain\n\n- A public hosted zone is a DNS database hosted by R53 on public name servers\n- Accessible from public internet and VPC\n- Hosted on 4 x r53 name servers (NS) specific for the zone\n- Use the ns records to point at those 4 x route\n- To integrate it with the public DNS system, you change the NS records to point at the 4 name servers\n- Inside a public hosted zone, you create resource records which DNS uses\n- You can use route 53 to host zone files for externally registered domains\n\n### R53 Private Hosted Zones\n\n- Operates the same way as a public zone except it's not public\n- It's associated with VPCs within AWS and it's only accessible there\n- Can also associate it to different accounts\n- Can use a split-view technique where you can have overlapping public and private for public and internal use with the same zone name e.g. private intranet websites\n- Private zone is inaccessible from the internet - but it can be made accessible with VPCs.\n- VPC can access the private zone via route53 resolver\n- If you create a public hosted zone with the same name that is how a split view could work. You have specific records in each.\n\n### CNAME vs R53 Alias\n\nIf we only use CNAMES:\n\n- In DNS an A record maps a name to an IP address i.e. catagram.io => 1.3.3.7\n- CNAME maps a NAME to another NAME e.g. www.catagram.io => catagram.io\n- You can't use CNAME for the APEX of the domain i.e. you can't have catagram.io pointing at something else\n- Many AWS services use a DNS Name (ELB)\n- Therefore if you only use CNAME - catagram.io => ELB would be invalid\n- Alias record fixes this\n\nAn ALIAS record:\n\n- Maps a NAME onto an AWS resource\n- Can be used for naked/apex and normal records\n- For non apex/naked it functions like CNAME\n- There is no charge for ALIAS requests pointing to AWS resources\n- For AWS services e.g. cloudfront, gateway, s3 buckets - you should default to picking ALIAS\n- An ALIAS is a subtype - you need to manage the record type with the type youre pointing to e.g. elastic balancer is A record therefore you need to create an A record ALIAS\n- Can only use ALIAS if you're using route 53\n\n### Simple Routing\n\n- Simple routing supports 1 record per name\n- Each record can have multiple values\n- Simple routing should be used when you want to route request to one single service e.g a web server\n- It doesn't support health checks\n- simple to implement and manage\n\n### R53 Health Checks\n\n- Separate from but are used by records in route 53\n- Performed by a fleet of health checkers distributed globally\n- Not limited to just AWS targets - can check anything that is accessible by IP\n- Check every 30s but can be every 10s (cost extra)\n- Test TCP, HTTP/HTTPS, HTTP/HTTPS with string matching\n- An endpoint is either healthy or unhealthy\n- Types of checks: Endpoint, Cloudwatch Alarm, checks of checks\n- if 18%+ of distributed checkers report a healthy then the health check is healthy\n- Commonly uses s3 as a back up\n\n### Failover Routing\n\n- You can add a backup/failure resource with the inclusion of a health check on the primary record\n- Use this when you want to configure active-passive failover\n\n### Multi value routing\n\n- A mix of simple and failover\n- Can create many records with the same name\n- Each record can have an associated health check\n- Up to 8 healthy records are randomly selected\n- Client chooses and uses 1 value\n- Any failed health check records won't be returned\n- More of an active-active method\n- Not a replacement for a load balancer\n- Improves availability of an application\n\n### Weighted Routing\n\n- A simple form of load balancing\n- You're able to specify a weight for each record\n- The total weight is calculated for a given name\n- A record with the weight of 0 never gets returned\n- Each record is returned based on it's record weight vs total weight\n- If a record returned is unhealthy, it repeats until a healthy record is chosen\n- Useful for when you have records with the same name and want to test the distribution\n\n### Latency Routing\n\n- When you want to optimise for performance and user experience\n- For each of the records with the same name, you can use different regions\n- In the background, aws maintains a latency between different regions\n- A record that has the lowest latency based on region is chosen for a user\n- If a record is unhealthy then the second lowest latency is returned\n- The database AWS maintains is not real time\n\n### Geolocation Routing\n\n- Similar to latency except the location of customers and resources is the influencing factor\n- With geolocation routing, records are tagged with a location e.g. country, continent or default\n- When a user is making a request, the IP check verifies the location of the user. Then the relevant record is returned (not the closest) - it checks the state first, the country next and then the continent. Optionally it returns the default you defined. If there is no default then a NO ANSWER is returned.\n- This is ideal for restricting content e.g. to the usa only\n- For language specific content or balancing across regional locations\n- This is about location not proximity. E.G. if you're not based in a specific state the record is defined for in the state, then you wont get that record\n\n### Geoproximity\n\n- Aims to return records as close to your users as possible\n- Records can be tagged by AWS region or lat and long coordinates\n- Allows us to define a bias - how route 53 handles a calculation .e.g + - bias where \"+\" increases the region size and \"-\" decreases neighbouring regions\n- Bias expands/shrinks the region to direct traffic to\n\n### R53 Interoperability\n\n- Using route 53 to register domain or host domain files when the other part of that is not with route 53\n- Usually these things are done together with Route 53 but it can do one or the other\n- When you register a domain with route 53 it does two jobs: _domain registrar_ and _domain hosting_\n- It can do BOTH or either\n- If you register a domain using route 53\n  - it accepts your money (domain registration fee)\n  - allocates 4 x Name Servers (domain hosting)\n  - Creates a zone file (domain hosting) on the NS servers\n- Domain registration:\n\n  - R53 communicates with the registry of TLD (domain registrar)\n\n- typically r53 doesn't isn't just used as a domain registar but sometimes used purely for hosting where the domain is registered via a 3rd party\n\n### Implementing DNSSEC using Route53\n\n- DNSSEC strengthens authentication in DNS using digital signatures based on public key cryptography.\n- Asymmetric keys are created in the us-east-1 region (Using KMS)\n- Route53 creates the zone signing keys internally (KMS isn't involved)\n- Adds the key signing key and zone signing key public parts within a DNS record\n- Cloudwatch alarms should be enabled for DNSECInternalFailure or KeySigningKeysNeedingAttention\n\n## Relational Database Service (RDS)\n\n### Database Refresher & MODELS - PART1\n\nRelational (SQL) vs Non-Relational (NoSQL)\n\n- SQL - Structured Query Language\n- Relational - structure in and between tables of data - Rigid Schema\n- Fixed relationship between tables and defined in advance\n- NoSQL - is not one single thing - it covers alternative database models\n- They have a more relaxed schema and relationships between tables is handled differently\n\n### Database Refresher & MODELS - PART2\n\nExamples of nosql/non-relational DB models:\n\n- Key Value databases consist of sets of keys and values.\n- unstructured and are key/value pairs\n- good for simple data, no structure, name/value pairs\n- Good for in-memory caching\n\nWide Column Store\n\n- A variation on key value\n- you can have additional keys as well as a partition key\n- DynamoDB uses this\n- Has tables which are groupings of data\n- tables containing attributes but they don't have to be the same. It can have all of the same attributes or a mixture or none\n- No fixed structure on the attribute side\n- Every item has to use the same key structure and needs to include a key that is unique\n- DynamoDB is a wide column store\n\nDocument\n\n- Store and query data as documents\n- Formatted using json or XML and can have different structure within the same DB\n- Interacted with via it's ID\n- Work best for order or collections or contact style DB\n- Good for deep attributes within a nested structure i.e. orders or contacts\n- Have flexible indexing for deep nested data\n\nColumn\n\n- Row based DBs are when you interact with data based on rows\n- Rows are ideal when you operate on rows\n- Column stores data in columns i.e. a grouping column for orderID, Product, Color Size\n- Good for reporting where you need a particular column\n- An AWS column db is RedShift\n- Column db is great for reporting and analytics\n\nGraph\n\n- Good for social media or HR systems\n- Can store complex relationships between data\n- Quicker for running queries on relationships\n- Relationships are fluid and dynamic and are stored along the data\n\n### ACID vs BASE\n\n- Database transaction models\n- CAP Theorem - consistency, availability and partition tolerance - choose 2\n  - Consistency means it will receive the most recent write otherwise an error\n  - Availability - every request will receive a response but it may not be the most recent write\n  - Partition tolerance - can be made of multiple network partitions and continues to operates even if there is a drop of packets\n\nACID\n\n- Atomic - all of the transaction parts must be successful otherwise none are\n- Consistent - transactions move the db from one valid state to another - no in between state is allowed\n- Isolated - concurrent executions leave the db in the same state as if they were executed sequentially\n- Durable - once a transaction has been committed, it will remain so even in the event of a system failure\n- Generally refers to RDS DB and it limits a database to scale\n\nBASE\n\n- Basically available - R/W operations are available as much as possible but without any consistency guarantees\n- Soft state - the DB doesn't enforce consistency, it's offloaded to the developer\n- Eventually consistent - if we wait long enough, reads from a system will be consistent\n- highly scalable and performant\n- Dynamo DB usually works in a BASE like way but does offer consistent reads and other ACID functionality\n- typically no-sql and acid mentioned together would be referring to a dynamo db database\n\n### Databases on EC2\n\n- Running databases directly on EC2 is considered bad practice\n- There may be some small scenarios where it may benefit\n- There needs to be reliable communication between your app and DB\n  Why you might do it:\n- Access to the DB Instance OS\n- Advanced DB Option tuning - you don't have these with managed DBs but AWS does allow you to control them without root access in managed DBs\n- The app vendor might require it\n- DB or DB version which AWS doesn't provide\n- specific OS/DB combination that AWS doesn't provide\n- Architecture AWS don't provide\n- Decision makers just want it\n\nWhy you shouldn't:\n\n- admin overhead - managing EC2 and DBHost/server\n- Backup / DR management adds additional complexity\n- EC2 is single AZ - access to DB can fail\n- Features - AWS DB products have a extensive features which achieve more than what can be done in an ec2 instance\n- EC2 is on or off - no serverless so you can't scale up or down easily\n- Replication - admin overhead\n- performance - aws has advanced performance features for managed DBs\n\n### Relational Database Service (RDS) Architecture\n\n- RDS is a 'Database server as a service' product\n- On this database server/instance you can have multiple databases\n- You don't have to run installation or maintenance\n- Choice of mysql, mariaDB, postgresSQL, oracle, Microsoft SQL server\n- Amazon aurora is a different product\n- Managed service - you do not have access to OS or SSH access - there is an RDS custom where you could do this\n- Runs within a VPC - it's not a global service\n- Every RDS instance has it's own dedicated storage (EBS)\n- Data is replicated to the standby DB instances in different AZs\n- Backups occur to S3 but you don't see it within your account\n\nCosts:\n\n- billed based on instance size and type\n- Multi az or not\n- per gig monthly fee for storage - storage type and amount\n- data transferred I/O\n- backups & snapshots - the same amount as storage is free but any more comes with a cost\n- any extra costs based on licensing if applicable\n\n### Relational Database Service (RDS) MultiAZ - Instance and Cluster\n\n- Historically, the only way to provide high availability to RDS is via multi az. This meant the primary rds instance replicates across AZs:\n\n  - all access to DB is via the CNAME - with multi az you still only access the primary instance\n  - data is written to primary and immediately replicated to standby\n  - not included in free tier\n  - you get one standby replica only - it cannot be used for reads or writes, it's used for failover\n  - 60-120 seconds for failover\n  - can only be within the same region\n  - backups can be taken from standby replica to improve performance\n  - failures can occur for various different reasons - AZ outage, primary failure, manual failover, instance type change and software patching\n\nMulti az cluster architecture:\n\n- one writer can replicate to two reader instances (different AZs) - in RDS you can only have 2 and in aurora you can have more\n- the primary instance can be used for reads and writes and the replicas can be used for reads\n- runs on much faster hardware\n- fast writes to local storage and flushed to EBS\n- readers can be used to scale reading\n- replication is done via transaction logs which is more efficient\n- failover is fast = ~35 seconds + transaction log apply\n- writes are viewed as committed when 1 reader has confirmed that it's written\n\n### RDS Automatic Backup, RDS Snapshots and Restore\n\nTwo types of backup functionality:\n\n1. Automated backups\n2. snapshots\n\n- both stored in AWS managed s3 buckets - you won't be able to see them in s3\n- because it's in s3, it's regionally resilient\n- RDS can replicate backups to another region\n- charges apply for cross-region data copy and storage in the destination region - this is not the default you have to explicitly enable it\n\nSnapshots:\n\n- snapshots must be run explicitly, they're not automatic\n- taken of the instance so all the DBs within it\n- snapshots are incremental i.e. they only store the difference between previous\n- snapshots don't expire and live beyond the instance\n- if you use a single AZ there will be an IO pause, with multiple it will happen with the standby\n- transaction logs will also be stored in the s3 every 5 minutes\n\nautomated backup\n\n- automatically cleaned up - min 0 days to 35 days\n- you can choose to retain automated backups - but they still expire based on retention period\n\nRestores:\n\n- Creates a new RDS instance - it will use a new endpoint address\n- restoring snapshots aren't fast\n\n### RDS Read-Replicas\n\n- Read only replicas of an RDS instance. They can be in the same or cross-region\n- Read replicas are not part of the main database instance in any way - applications need to be adjusted to use them - Without app support, they don't do anything\n- Kept in sync using asynchronous synchronisation\n- can create 5x direct read replicas per DB instance\n- each providing an additional instance of read performance\n- read replicas can have read replicas but lag starts to be a problem\n- can help with global performance improvements\n- benefit in recover point objectives (RPOS) with frequent snapshot and backups - limits the amount of data lost\n- rtos are a problem as it takes a long time\n- RR offer a near 0 RPO - very little potential for data loss\n- Can be promoted quickly - low RTO\n- read replicas should only be used on failure only - not for data corruption\n- read only until they're promoted\n- great for global availability improvements due to global resilience\n\n### RDS Data Security\n\n- SSL/TLS (in transit) is available for RDS and can be mandatory\n- RDS supports EBS volume encryption - KMS encryption\n- This is handled by Host or DBS\n- AWS or customer managed CMK generates data encryption keys (DEKs) used for encryption operations\n- storage, logs, snapshots & replicas are all encrypted by the same master key\n- encryption cannot be removed once it's added\n- RDS MSSQL and RDS Oracle support TDE - transparent data encryption - it's handled by the DB engine\n- RDS oracle supports integration with cloud HSM - managed by you with no key exposure with AWS\n\nIAM Authentication:\n\n- RDS can be configured to use IAM user authentication to a DB\n- You have IAM users and roles with attached policies - tokens are generated with a 15 minute validity - you won't need a password\n- this is only authentication NOT authorization - authorization is controlled by the DB engine\n\n### RDS Custom\n\n- Fills the gap between RDS and EC2 running a DB engine\n- Works for MSSQL and oracle\n- can connect using SSH, RDP, Session Manager\n- RDS Custom gives you the benefits of using the RDS product combined with the ability to customise instances\n\n### Aurora Architecture\n\n- Aurora is very different from RDS\n- Uses a cluster\n- Made up of a single primary instance and 0 or more replicas\n- Replicas are used for reads for normal operations - you don;t have to choose between read scaling and availability\n- Does not use local storage, uses shared cluster volume\n- This provides faster provisioning, improved availability and better performance\n- Has a max cluster volume of 128 TiB\n- Replication happens at the storage level so no extra resources are consumed from the instances\n- Because storage is across 3 AZs, availability of storage is much higher\n- Aurora avoids data lost and reduces any point in time restores - more resilient than RDS\n- AUrora can have up to 15 replicas and any of them can be failover\n- Failover is quicker because there are no storage modifications\n- Cluster shared volume is SSD by default - high IOPS/low latency\n- Billing - based on what storage you consume\n- high water mark billing - e.g. billed for the most used storage in a cluster - this is being changed by AWS but for now this is the architecture\n- replicas can be added and removed without requiring storage provisioning\n- Aurora has a cluster endpoint (points at primary) and reader endpoint (at any replica or primary) - you can also create custom endpoints and there are unique end points per replica\n- Cost - there is no free tier option - it doesn't support micro instances\n- Anything beyond RDS Single AZ (micro) aurora offers a better value\n- compute is charged hourly and you're billed per second at a 10 minute minimum\n- storage is GB month consumed at a high watermark. Theres also an IO cost per request\n- 100% DB Size in backups are included in your cost\n\n- Backups in aurora work the same way as RDS\n- Restores create a brand new cluster\n- Backtrack can be used to rollback DB to a previous point in time - as opposed to a full restore\n- You can create a fast clone to create a new database - it references the original storage and stores differences between the two\n\n### Aurora Serverless\n\n- Provides a version of the aurora product where you don't have to worry about provisioning a server or DB instances\n- The non-serverless version of aurora is often known as 'aurora provisioned'\n- You don't need to provision resources the same way as auroro provisioned\n- Uses ACU - aurora capacity units\n- Have a min and max ACU\n- Cluster adjusts based on load\n- Can go to 0 and be paused\n- Billed on consumption per-second\n- same resilience as aurora (6 copies across azs)\n- Much simpler, removes complexity, easy to scale\n\nDifferences:\n\n- Same cluster volume architecture\n- Instead of provisioned servers - ACUs - provided from a warm pool of capacity units\n- They have no local storage\n- Once allocated, they have access to the cluster storage\n- interacting with the aurora cluster happens through a 'proxy fleet' - it doesn't connect directly to the units\n\nUse cases:\n\n- Infrequently used - eg low volume blog site.\n- New applications - where you're unsure of the levels of load\n- Variable workloads - an application that has peaks and troughs\n- Unpredictable workloads\n- Development and test databases\n- multi-tenant applications\n\n### Aurora Global Database\n\n- A feature of aurora provisioned clusters which allow data to be replicated globally\n- Introduce the concept of secondary regions which can have up to 16 replicas. They are all read only.\n- Replica occurs at the storage layer and its typically a 1s replication between regions - it's one way between primary and secondary\n- You would use these for:\n  - cross region disaster recovery and business continuity\n  - Global read scaling - low latency\n  - replication has no impact on DB performance\n  - Secondary can be promoted to read write\n  - currently max 5 secondary regions\n\n### Multi-master writes\n\n- A write mode of aurora provisioned clusters which allows multiple instances to perform reads and writes at the same time rather than only one primary instance having write capability\n- Default aurora mode is a Single-Master - one R/W and 0+ read only replicas\n- Failover takes time to replicate to promote\n- In multi-master all clusters are R/W\n- There is no load-balancing cluster endpoint to use, the app is responsible to connecting to instances\n- When a r/w node receives data, it commits to all storage in cluster. It either rejects or accepts the change depending on the in-flight data - it must agree with the other nodes\n- With multi-master cluster - the change is also replicated to other nodes in the cluster (replication in in-memory caches)\n- The application logic needs to manually load balance across the cluster instances\n\n### Relational Database Service (RDS) - RDS Proxy\n\n- Why use:\n  - Opening/closing connections to DB takes time\n  - handling failure of DB instances is hard\n  - DB proxies change your architecture, you connect to the proxy and it maintains open connections for you in the long term\n  - Applications => Proxy (connection pooling) => Database\n  - Reduces too many connection errors\n  - Smaller/burst instances\n  - AWS Lambda - time saved connecting\n  - Long running connections (SAAS Apps)\n  - Resilience to DB failure is a priority - can reduce the time for failover and make it transparent to the application as it's going through the proxy\n\nKey facts:\n\n- Fully managed DB Proxy for RDS/Aurora\n- Auto scaling, highly available by default\n- provides connection pooling reducing DB load\n- only accessible within a VPC\n- accessed via a proxy endpoint - no app changes\n- can enforce SSL/TLS\n- reduce failover time by over 60% for aurora\n- abstracts failure of DB away from the application\n\n### Database Migration Service (DMS)\n\n- A managed service which allows for 0 data loss, low or 0 downtime migration between 2 database endpoints\n- Runs a replication instance\n- Source and destination endpoints where one must be on AWS\n\nSCT (Schema Conversion Tool):\n\n- A standalone tool when converting one database engine to another including DB -> S3\n- Not used for movements of data between compatible engines\n- different engines e.g. on premiss MSQL - RDS MYSQL\n\nDMS + Snowball:\n\n- Larger migrations (multi TB)\n- DMS Can use snowball products (Uses schema conversion tool). You move data to a snowball device and ship it back to AWS to perform the migration\n\n## Network Storage & Data Lifecycle\n\n### EFS Architecture\n\n- Elastic File System (EFS)\n- Provides network based file systems which can be mounted and used by multiple instances at once\n- Implementation of NFSv4\n- Can be mounted on Linux instances (Linux only)\n- Shared between many EC2 instances\n- Exists separately from the EC2 instance\n- Private service and accessed via mount targets inside a VPC\n- Can be accessed on premiss via VPN or DX\n- Offers general purpose and Max I/O performance mode\n- General purpose is default and good for 99.9% of uses\n- Bursting and provisioned throughput modes (pick bursting generally)\n- Standard (default) and Infrequent Access (IA) classes\n- Lifecycle policies can be used with classes\n\n### AWS Backup\n\n- fully managed data protection service (backup/restore)\n- Consolidate management of data into one place - across accounts and across regions\n- Supports a wide range of AWS products - Compute, block storage, file storage, databases, object storage\n\nKey concepts:\n\n- Backup plans - frequency, window, lifecycle, vault, region copy\n- Backup resources - what resources are backed up\n- Vaults - destination (container) - assign a KMS key for encryption\n- Vault lock - write once read many (WORM) - No one, including AWS can delete anything from the vault after 72 hour cool off\n- On demand - manual backups created as needed\n- PITR - point in time recovery\n\n## HA & SCALING\n\n### Regional and Global AWS Architecture\n\nArchitectural components to consider:\n\n- Global service location and discovery\n- Content delivery (CDN) and optimisation\n- Global health checks and failover\n- Regional entry point\n- Regional scaling and resilience\n- Application services and components\n\nNetflix can be thought of as a global application also made up of blocks of regional services:\n\n- Uses a global DNS for service/discovery (R53)\n- CDN layer at a global level (cloudfront)\n- Once a region is entered, user enters via web tier at the regional level\n- Web tier talks to compute tier eg ec2, lambda\n- compute tier consumes storage services e.g. EFS, S3\n- talks to DB tier\n- Sometimes gets data via caching layer\n- App services are used like SNS, Queues\n\n### Evolution of the Elastic Load Balancer\n\nThree different types of ELBS split between v1 (avoid this) and v2 (prefer)\n\n1. Classic load Balancer (CLB) - v1 - not really layer 7 devices and lack advanced functionality - can only use 1 SSL cert per load balancer. Default to NOT using this\n2. Application Load Balancer (ALB) - v2 - layer 7 devices that support HTTP/S/Websocket\n3. Network Load Balancer (NLB) - v2 - TCP, TLS & UDP - good for any load balancing of anything that's not using HTTP(s)\n\nv2 = faster, cheaper and support target groups and rules\nIn exam you should be able to choose between ALB and NLB\n\n### Elastic Load Balancer Architecture\n\n- Accepts connections from customers and distributes them\n- When you provision a load balancer, you need to select which AZs it goes into and you do this by selecting ONE subnet in each AZ\n- Each ALB is configured with an A record DNS name which resolves to the ELB nodes\n- You must decide whether the ELB is internet facing or internal - if it's public facing then the ELB nodes have public and private IPs where as internal will only have private\n- LBs need at least 8+ free IPs per subnet - you should use a /27 or larger subnet to allow for scale\n- Internal LBs are usually used to separate application tiers\n- without LBs, the tiers need to have awareness of each other and they need to connect to specific instances. Tiers can then scale independently on each other\n\nCross zone load balancing - allows each load balancer node to distribute connections evenly between all instances across availability zones. This is enabled as standard in load balancers. Without this, if you have two load balancer nodes and one zone has more instances than the other, the nodes in that instance will get a smaller distribution of traffic as opposed to the other zone.\n\n- When you provision as an ELB, you see a DNS A record pointing at 1+ Nodes per AZ\n- Nodes in one subnet per AZ can scale\n- EC2 doesn't need to be public to work with an internet facing load balancer\n- Load balancers are configured by listener configuration which controls what it should listen to\n- 8+ free IPs per subnet /28 is enough but AWS docs recommend /27 for scaling\n\n### Application Load balancing (ALB) vs Network Load Balancing (NLB)\n\nConsolidation of LBs:\n\n- Classic load balancers don't scale because each unique https name requires an individual CLB (1 SSL per CLB)\n- v2 load balancers support rules and target groups\n\nApplication load balancer (ALB):\n\n- Layer 7 which listens on HTTP/S\n- Can't understand any other layer 7 protocols e.g. SMTP, SSH, Gaming, TCP, UDP, TLS\n- Can understand l7 content e.g. cookies, custom headers, user location and app behaviour (protocol info)\n- Any incoming connections are always terminated on the ALB - you can't have an unbroken SSL connection\n- A new connection is made to the application\n- ALBs MUST have SSL certs if HTTPs is used\n- Slower than NLB as they are more levels of network stack to process\n- They can evaluate application health\n- Have the concept of rules\n- processed in priority order\n- Default rule is catch-all\n- Rule conditions - host-header, http-header, request method, path pattern, query string and source IP\n- Actions - forward, redirect, fixed-response, authenticate-oidc and incognito\n\nNetwork load balancer (NLB):\n\n- Function at layer 4 - TCP, TLS, UDP, TCP_UDP\n- They have no visibility or understanding of HTTP or HTTPs\n- They can't interpet headers, cookies, session sticiness\n- They're very fast (millions of rps, 25% of ALB latency)\n- Ideal to deal with anything thats not http(s) e.g. game servers, smtp, ssh, financial apps\n- Health checks only check ICMP/TCP handshake - they're not app aware\n- They can be allocated with static IPs which is useful for whitelisting\n- They can forward TCP through to instances - unbroken end to end encryption - it can accept tcp only traffic so any layers above will not be terminated\n- Used with private link to provide services to other VPCs\n\nALB vs NLB:\n\n- Unbroken encryption- NLB\n- static IP for whitelisting - NLB\n- Fastest performing - NLB\n- protocols that arent http(s) - NLB\n- Privatelink requirement - NLB\n\notherwise - ALB\n\n### Launch Configuration and Templates\n\n- LC and LT at a high level perform the same task - they allow you to define the configuration of EC2 instances in advance e.g AMI, instance type, storage and keypair, networking and security groups, userdata and IAM role\n- Both are not editable\n- LT provides newer features - T2/T3 unlimited, placement groups, capacity reservations and elastic graphics\n- LC provide configuration to be used by auto scaling groups - they are not editable nor do they have any versioning\n- LT can be used for the same thing but they can also be used to launch EC2 instances directly\n\n### Auto-Scaling Groups\n\n- Provide auto scaling for ec2 and can be used for a self healing architecture\n- They use launch templates or configurations - always one at a time (one config definition)\n- Has 3 values - minimum, desired and maximum size e.g. (1:2:4)\n- Keeps number of running ec2 instances the same as desired capacity by provisioning and terminating instances\n- Scaling policies normally together with auto scaling groups to automate based on metrics\n\nScaling policies are rules on ASG:\n\n- manual scaling - manually adjust the desired capacity\n- schedule scaling - time based adjustment e.g. sales\n- dynamic scaling:\n  - simple - e.g. either provision or terminate based on a metric (CPU, memory, disk I/O, length of SQS queue)\n  - stepped scaling - more +/- which allows you to react quicker\n  - target tracking - desired aggregate e.g.CPU = 40% and ASG handles it\n- Cool down period - waits a certain amount of seconds before doing another action\n\nASG + Load Balancers:\n\n- ASG can use the load balancer health checks rather than EC2 status checks\n\nScaling processes:\n\n- Launch and terminate- SUSPEND and RESUME\n- AddToLoadBalancer - add to LB on launch\n- AlarmNotification -accept notification from CW\n- AZRebalance - Balances instances evenly across AZs\n- Healthcheck - instance health checks on/off\n- ReplaceUnhealthy - Terminate unhealthy and replace\n- Standby - use this for instances InService vs Standby - can be used for maintenance\n\nFInal points\n\n- ASG are free\n- Only the resource created are billed, use cool down to avoid rapid scaling\n- Think about more, smaller instances - smaller instances mean more granularity\n- Use ALB for elasticity - abstraction\n- ASG defines when and where, LT defines what\n\n### ASG Scaling Policies\n\n- ASGs don't NEED scaling policies - they can have none\n- WIthout policies they have static values\n- Manual scaling means manually adjusting min, max desired\n- Dynamic scaling:\n- Simple scaling - define actions which occur when alarm moves into alarm state and adds/removes a static amount\n- step scaling - adds and removes based on steps with upper and lower bounds\n- Target tracking - predefined set of metrics and you define an ideal value, the ASG calculates the scaling for you based on this\n- It's possible to scale based on SQS - ApproximateNumberOfMessagesVisible - scales up and down based on messages\n\n### ASG Lifecycle hooks\n\n- Allow you to configure custom actions on instances during ASG actions\n- e.g. during instance launch or instance terminate transitions\n- When you create lifecycle hooks, instances are paused and they wait until a timeout and either continue or abandon, alternatively you resume the ASG process\n\n### ASG HealthCheck Comparison - EC2 vs ELB\n\nThree different types of health checks on ASG:\n\n- EC2 (default), ELB (can be enabled) & custom\n- EC2 - if anything other than status running then it's viewed as unhealthy\n- ELB - instance must be both running and passing ELB health check - this way it can be more application aware\n- Custom - instances marked as healthy and unhealthy by an external system\n\n- A health check grace period is the amount of time to delay before starting checks (default 300s) - allows system launch and bootstrap. You need to make sure this is a sufficient amount so that instances don't keep terminating and restarting over and over again\n\n### SSL Offload & Session Stickiness\n\nSSL Offload - there are three ways a load balancer can handle secure connections:\n\n1. bridging\n\n- default mode of ELB\n- secure connection between the client and the load balancer - the LB needs an SSL certificate and a domain name that the application uses\n- AWS technically have access to that security certificate\n- It also creates new encrypted with the backend instances. This means that all the EC2 instances also need an SSL certificate which matches the domain name\n\npositives:\n\n- ELB gets to see unecrypted HTTP\n  Negatives:\n- Cert has to be stored on the ELB itself which is a security risk\n- SSL certs need to be installed on the instances themselves which is an overhead since they need to perform the cryptographic operations\n\n2. pass-through\n\n- Client connects but the LB passes it to the backend instance. The LB doesn't need an SSL cert but the backend instances do\n- This LB must be a network load balancer\n- The LB is configured to use TCP. AWS never need to see the cert that you use\n- Negative is that you don't get to use load balancing based on the http part.\n\n3. offload\n\n- Clients connect to ELB using HTTPS\n- LB connects to backend instances via HTTP (unencrypted)\n- LB requires SSL but backend instances don't\n- downside is data is in plaintext in backend network\n\nConnection stickiness\n\n- If state is stored on a specific server rather than being stateless, you need session stickiness\n- ELBs can pass a cookie to clients which ensures that users are always being passed to a specific server until there is a server failure (in which case the user is sent to a different server) or the cookie expires\n- It can cause uneven load on the backend servers - apps should be designed to use stateless by moving the session external to the ec2 instance e.g. dynamo DB\n\n### Gateway Load Balancer\n\n- A product which AWS provides to help you run and scale 3rd party security appliances e.g. firewalls, intrusion detection and prevention systems\n- You can use these for inbound and outbound traffic\n- Has endpoints where traffic enters/leaves - similar to VPC endpoints\n- GWLB balances across multiple backend applications\n- Traffic and metadata is tunnelled using GENEVE protocol\n\n## SERVERLESS AND APPLICATION SERVICES\n\n### Architecture Deep Dive\n\n**Monolithic architecture**:\n\n- is one entity that fails together since they are all contained together\n- scales together as they're highly coupled - you need to vertically scale the system\n- Bill together and use resources even if they're not running - tends to be the least effective architecture\n\n**Tiered architecture**:\n\n- A way to evolve a monolithic architecture - you break it apart and each tier can be on the same server or different\n- Still tightly coupled\n- can vertically scale each tier independently\n- Can use load balancers between each tier so that there isn't a direct comm between a specific instance\n- Can horizontally scale if load balancer is used between each tier\n- because each tier relies on the other, you cannot scale any tier down to 0\n\n**Queues**:\n\n- A tiered architecture can be evolved with a queue\n- A queue based architecture is decoupled - each tier pushes messages onto a queue\n- Each tier doesn't care about other tiers, it uses async comms to wait for messages from the queue\n\n**Microservice architecture**:\n\n- A way to further break down a monolithic architecture\n- microservices do individual things e.g. upload, process, store, manage\n\n**Event-driven architecture**:\n\n- Events are produced and consumed\n- Only consume resources as and when required - nothing is constantly running or waiting\n- Producers generate events when something happens e.g. clicks, errors, criteria met, uploads, actions\n- Events are delivered to consumers (usually using an event router)\n- Actions are taken\n- Mature event-driven architecture only consumes resources when handling events (key component of serverless architecture)\n\n### AWS Lambda\n\n- Lambda is a Function-as-a-service (FaaS) product - it's a short-running and focussed service\n- A lambda function - a piece of code that lambda runs\n- Functions use a runtime e.g. python 3.8\n- Functions are loaded and run in a runtime environment\n- environment has direct memory (and virtual CPU e.g. indirect CPU) allocation\n- You're only billed for the duration the function runs\n- A key part of serverless architectures\n- Docker is an anti-pattern for lambda - this will generally refer to ecs\n- Code loads, executes then terminates\n- Lambda functions are stateless so no data is left over from previous invocations - you need to make sure your code works in a new environment\n- This is the default but there are cases where it's not\n- memory is 128mb to 10240mb - you don't control the CPU, it's according to the memory you get\n- 900s (15m) function timeout for each lambda function\n- Typically used in conjunction with other serverless applications e.g. s3, api gateway\n- Often used for things like file processing\n- For database triggers - dynamo db, streams\n- serverless cron - eventbridge/cwEvents\n- real time stream data processing - kinesis\n\nNetworking\n\n- Public and VPC networking\n- default is public networking - can access public space aws services and the internet\n- public networking offers the best performance because no customer specific vpc networking is required - however they won't have access to vpc based services unless public ips are allocated and security rules allow external access\n- lambda functions running in vpc can freely access other vpc resources but nothing outside unless it's specifically configured\n- You could use a natgateway and internet gateway or a vpc endpoint to be able to talk to anything outside the vpc\n- treat lambdas running in a vpc like anything running in a vpc\n\nSecurity\n\n- Permissions\n  - execution role (similar to an ec2 instance role)\n  - resource policies - like a bucket policy on s3 to allow external accounts or services to interface with lambda - can only be manipulated with cli or api\n- Lambda uses cloudwatch, cloudwatch logs and x-ray\n- Can be integrated with x-ray for distributed tracing\n- requires permissions via execution role in order to log to cloudwatch\n\nInvocation\n\n- Synchronous\n  - Result is returned during the request (success/failure). Errors and retries must be handled within the client.\n- asynchronous\n  - Typically used when AWS services invoke lambda functions on your behalf\n  - For example, s3 won't wait for a response from lambda and the lambda is responsible for any re-processing\n  - The function code needs to be idempotent\n  - Any retries could potentially be sent to a dead letter queue which repeat failed processing\n  - Lambda supports destinations where successful or failed events can be sent\n- event source mappings\n  - typically used on streams/queues which don't support events and polling is required\n  - event source mapping reads from a source and sends an event batch to lambda\n  - batches that fail can be sent to sqs or sns topics\n\nVersions\n\n- You can have different versions of lambda functions\n- each version is immutable\n- $latest points to the latest version\n- Can use Aliases to point to specific versions eg dev, stage, prod which can be changed\n\nstartup times\n\n- execution context needs to be created\n- deployment package is downloaded\n- this process is known as a cold start\n- if a future invocation is done in a short time span it could possibly use the same execution context - this is known as a warm start\n- if too long between invocations then a new function will need to be executed causing a cold start\n- one function invocation runs at a time per context\n- provisioned concurrency can be used where aws will keep a certain amount of contexts warm to improve start up speeds\n- the /tmp storage can also hold the data between warm functions\n\n### CloudWatchEvents and EventBridge\n\n- Cloudwatch events delivers a near real time stream of system events which describe changes in aws products and services e.g. terminate, start\n- EventsBridge is the service which will replace CloudWatch Events\n- Can observe if X happens or at Y times ... do Z\n- EventBridge is basically Cloudwatch Events v2 - you should use it by default\n- Both of these use an event bus and there is a default one for the account\n- cloudwatch only has 1 bus and its implicit (not exposed)\n- EventBridge allows you to create additional busses and you can interact with them\n- You create rules for incoming events or schedule based rules\n\n### Serverless Architecture\n\n- Serverless is a software architecture which's aim is to manage few servers as possible\n- Applications are a collection of small and specialised functions\n- The functions are run in stateless and ephemeral environments - they are billed via duration\n- Everything is event driven - things are only run when required\n- FaaS is used where possible for compute functionality\n- No persistent usage of compute\n- Managed services should be used where possible e.g. s3, dynamo, SSO\n\n### Simple Notification Service (SNS)\n\n- A highly available, durable, secure pub sub service\n- It's on the Public AWS Service so you will need network connectivity with the public endpoint\n- Coordinates the sending and delivery of message\n- Messages are <= 256kb (it's made for small files)\n- SNS Topics are the base of entity of SNS - permission and configuration\n- Publishers sends things to a topic\n- Subscribers receive messages from a topic e.g. http(s), emails, sqs, mobile push, sms messages, lambda\n- Used across AWS services e.g. cloudwatch and cloudformation\n\nFunctionality it offers:\n\n- Delivery status\n- Delivery retries - reliable delivery\n- HA and Scalable (Region)\n- SSE (server side encryption)\n- Cross-account via TOPIC policy\n\n### Step Functions\n\n- Address some of the limitations/design decisions of Lambda\n- Lambda is FaaS - you should not be putting a full application in a function\n- 15 minute max execution time\n- They can be chained together\n- Chaining together can get messy at scale\n- Runtime environments are stateless\n- Step functions let you create state machines\n\nState Machines\n\n- State machines are like a workflow with start/end point and in between has states\n- States modify and output data\n- Maximum duration for state machine execution is 1 year\n- Standard workflow or express workflow available - standard is default, express is for high volume and they are for up to 5 minutes\n- They can be started via API gateway, IOT rules, Event bridge, lambda\n- Can be created via ASL (amazon states language) - JSON template\n- Interact with other services via IAM roles (permissions)\n\nStates:\n\n- SUCCEED & FAIL - where it arrives\n- WAIT - period of time or until - pauses the workflow\n- CHOICE - takes a path depending on an input\n- PARALLEL - allows you to create parallel branches in a state machine - perform multiple sets of thing at the same time\n- MAP - accepts a list of things, performs action(s) on each item\n- TASK - a single unit of work which allows you to perform action - integrates with many things e.g. lambda, batch, dynamodb, ecs, sns, sqs etc\n\n### API Gateway 101\n\n- A service which lets you create and manage APIs\n- Act as an endpoint/entry point for applications\n- Sit between application and integration (services)\n- Highly available, scalable, handles authorisation, throttling, caching, CORS, transformations, openAPI spec, direct integration and much more\n- Can connect to services/endpoints in AWS or on-premises\n- Works with HTTP, REST and websockets\n\nAuthentication:\n\n- Supports a range of methods and can also be open access\n\nEndpoint types:\n\n- Edge optimised - routed to the nearest cloudfront POP\n- Regional - clients in the same region\n- Private - only accessible within a vpc via interface endpoint\n\nStages:\n\n- APIs are deployed to stages each stage has one deployment e.g dev, prod\n- Can be rolled back\n- Allows canary deployments on stages and eventually be promoted\n\nErrors:\n\n- 4xxx - client error - invalid requests on the client side\n- 5xxx - server errors - valid request, backend issue\n- 400 - Bad Request - Generic\n- 403 - Access Denied - authorizer denied or its been filtered\n- 429 - API Gateway can throttle - its been exceeded\n- 502 - Bad gateway exception - bad output returned by lambda\n- 503 - service unavailable - endpoint offline or major service issues\n- 504 - integration failure/timeout - 29s limit on lambda\n\nCaching:\n\n- Configured per stage\n- Without a cache, applications make requests to the stage and the backend integrations will be used on each and every request\n- With cache, you can specify a size between 500mb-237GB - caching for 300s by default (otherwise 0-3600s). Can be encrypted. Calls are only made to backend if request is a cache miss\n\n### Simple Queue Service (SQS)\n\n- Provides managed message queues\n- Public service\n- Fully managed\n- Highly available and highly performant - you don't need to worry about replication or resiliency\n- Either standard or FIFO - fifo guarantee an order. Standard is best effort but could be out of order\n- Msgs can be up to 256kb in size - you want to keep them small\n- Clients can send and other clients can poll the queue\n- Received messages are hidden (VisibilityTimeout) - if a client doesn't delete the message then it can reappear int he queue\n- Dead letter queues can be used for problem messages which means that different sets of processing can occur on problematic messages\n- Auto scaling groups can scale based on the queue lengths\n\n- Standard - at least once delivery , FIFO - exactly once delivery\n- FIFO performance is limited - 3000 messages per second with batching or up to 300 messages per second without\n- Billed based on requests\n- 1 request = 1-10 messages up to 64kb total\n- Short (immediate) vs long (waitTimeSeconds) polling - waitTimeSeconds can be up to 20 second. Long polling is how you SHOULD poll SQS\n- Encryption at rest (KMS) & in transit. Data is encrypted by default in transit but not at rest\n- Queue policy can be used\n\n### SQS Standard vs FIFO Queues\n\n- FIFO are single lane highways and standard are multi lane\n- Standard is scalable as wide as required near unlimited TPS\n- FIFO queues have to have a FIFO suffix to be a fifo queue\n- Great for workflow ordering, command ordering, price adjustments\n- Standard queues are faster however there is no rigid order of messaging.\n- Good for decoupling, worker pools, batch for future processing\n\n### SQS Delay Queues\n\n- Allow you to postpone the delivery of messages to consumers\n- A delay queue has a DelaySeconds where messages are conceptually parked - they are not available on the queue. Maximum value is 15 minutes. \n- You cannot use it on FIFO queues\n\n### SQS Dead-Letter Queues\n- Dead letter queues are designed to allow you to handle problematic messages \n- You can use a dead letter queue whereby when the recievecount of a message is more than maxRecieveCount it moves to a dead letter queue\n- It's a separate area to analyse/diagnose the messaging issues \n- All sqs have retention periods for messages which starts at the enqueue timestamp of the original queue.\n- A DLQ can be used for multiple source queues\n\n\n### Kinesis Data Streams\n- Often confused with SQS\n- A scalable streaming service\n- Designed to ingest data from lots of devices and applications\n- streams can scale from low to near infinite data rates\n- public service & highly available by design \n- Provide a level of persistence - 24 hour moving window of data\n- Can be increased to 365 days for an additional cost\n- multiple consumers can access the data from that moving window \n- great for analytics and dashboards\n- Uses a shard architecture with each shard taking on more data \n- Kineses data records are max of 1mb\n- Questions about ingesting data is about kineses otherwise it could be sqs\n- SQS has 1 production group, 1 consumption group\n- SQS usually are used for decoupling and asynchronous communications\n- SQS doesn't really use any persistence or windows\n- Kinesis is designed for huge scale ingestion for multiple consumers over a rolling window\n- Kinesis is good for data ingestion, analytics, monitoring or app clicks \n\n### Kinesis Data Firehose\n- Kinesis does not provide a default way to store data\n- Firehose is a fully managed service used to load data for data lakes, data stores and analytics services\n- Scales automatically - fully serverless, resilient\n- Near real time delivery (~60 seconds delay)\n- Supports transformation of data on the fly using lambda - can add latency\n- Billing - volume through firehose\n\nValid destinations for firehose:\n- HTTP endpoints\n- Splunk\n- Redshift\n- ElasticSearch\n- Destination Bucket s3\n\n- Kinesis data stream integrates with firehose to delegate the data\n- Firehose can also recieve data directly from sources \n- Even though it receives things in real time, firehose does not deliver in real time unlike kinesis data stream (~200ms vs ~60s)\n- Lambda can be used to transform data coming from firehose and back\n- The only exception to kineses firehose data store is redshift where s3 is used as an intermediary storage before it's saved onto redshift\n\n- Firehose is good for permanent storage of data, for transforming data (using lambda) to store, or if you want to put it into one of the supported products\n- remember it is not REAL TIME\n \n### Kinesis Data Analytics\n- Real time data processing product\n- Uses SQL\n- Ingests from kineses data streams or firehose\n- Can be sent on in real time to destinations - firehose, s3, redshift, elasticsearch & splunk\n- AWS Lambda\n- Kineses data streams\n- It's realtime unless you use firehose\n- Allows you to use sql in real time on source streams\n- Kineses analaytics app can also take data from static resources e.g. s3 bucket \n- Static data can be used to enrich the real time streaming input\n- It processes input, performs application code on the data and outputs streams and puts them to kineses streams or kinesis firehose\n\n\nscenarios where you may use kineses data analytics:\n- streaming data that needs reeal time sql processing\n- time series analytics - elections/e-sports\n- real time dashboards - leaderboards for games\n- real time metrics - security and response \n- Lambda is limited to simple manipulations, kineses data analytics is good for complex real time data manipulation \n\n### Kinesis Video Streams\n- Kineses video streams ingests live video from producers\n- These can be security cameras, smartphones, cars, drones, time-serialised audio, thermal, depth and RADAR data\n- Consumers can access data frame-by-frame or as needed \n- Can persist and encrypt data in transit and at rest\n- You can't access the video data directly via storage you can only do it via apis\n- Integrates with AWS products - rekognition and Connect\n\n\n### Amazon Cognito - User and Identity Pools\n- Cognito provides authentication, authorization and user management for web and mobile apps\n\nThere are two parts of cognito:\n1. User pools - sign in and get a JWT (json web token) - most aws services CANNOT use jwts.\n  - used for sign up, sign in, MFA and other security features\n  - Allow SSO \n  - Can't be used to access AWS resources\n2. Identity Pool - allows you to offer access to temporary AWS credentials\n- Unauthenticated identities for guest users \n- Swap temporary identity for short term AWS credentials \n- Assume an IAM role on behalf of an identity\n\n\n### AWS Glue 101\n- Serverless ETL (extract, transform and load) \n- Datapipeline can do ETl but it uses servers\n- Moves and transforms data between source and destination \n- Crawls data sources and generates the AWS glue data catalog\n- Data sources can be any store e.g. s3, rds, jdbc compatible & dynamo db \n- Data sources can also be streams e.g. kinesis data streams & apache kafka\n- Data targets can be s3, rds, jdbc databases\n\nData Catalog\n- A collection of metadata combined with search tools\n- One catalog per region per account \n- Helps avoid data silos\n- AWS can use glue for etl and catalogue related services e.g. athena, redshift spectrum, aws lake formation\n\n\n### Amazon MQ 101\n- A merge between SQS and SNS but using open standards\n- SNS/SQS utilise aws apis\n- SNS provides topics and sqs provides queues\n- SNS/SQS are both public services and can be accessed from anywhere\n- Both highly scalable and AWS integrated\n- Many orgs already use topics and queues (an on premise messaging system)\n- If they want to migrate to AWS, sns and sqs won't work out of the box\n- Amazon MQ is an open-source message broker\n- Based on managed apache activeMQ\n- Provides both queues and topics (1-1 and 1-many)\n- Provided with message broker service - either a single instance for test/dev/cheap or Highly available Pair (active/standbye)\n- Not a public service - runs in a VPC - requires private networking\n- no AWS native integration\n\n- Your default implementation should be SNS or SQS (new implementations)\n- SNS or SQS if AWS integration is required e.g. logging, permissions, encryption, service integration\n- Use Amazon MQ if you neeed to migrate from an existing system with little to no change\n- If you need to use open APIs\n- Remember you need to have private networking configured to use amazon MQ \n\n\n### Amazon AppFlow\n- Fully managed integration service\n- Exchange data between applications (connectors) using flow\n- Source/destination connector\n- Sync data across applications\n- Aggregate data from different sources\n- Uses public endpoints but works with PrivateLink (privacy)\n- Can use a custom connector SDK (build your own)\n- e.g. of usage - sync contact records from salesforce to redshift or support tickets from zendesk to s3\n\n## GLOBAL CONTENT DELIVERY AND OPTIMIZATION\n\n### Cloudfront Architecture\n- Content Delivery Network - improve the delivery - uses caching and an efficient global network\n\nCloudfront terms:\n- Origin - the original location of content - S3 or Custom origin - S3 bucket or anywhere else\n- Distribution - The configuration unit of cloudfront - everything is configured in distribution (directly or indirectly)\n- Edge location - pieces of global infrastructure where content is cached\n- Regional Edge Cache - bigger than edge locations but designed to hold data that is accessed less frequently\n\n- Edge location is checked first, if there is a cache miss, the regional cache is checked, then finally its fetched from the origin if its not there. If its fetched from the origin then it's cached at regional and edge \n\n- Cloudfront performs no write caching - only read caching\n\n- A behaviour is configuration or \"subconfiguration\" of distribution\n- Behaviours sit architecturally between origins and distributions - Cloudfronts have at least 1 behaviour\n- Default behaviour is * which matches everything\n\n### CloudFront - TTL and Invalidations\n- An edge location views an object as not expired if it's within it's TTL period\n- More frequent cache HITS = lower origin load\n- TTL default behaviour = 24 hours validity period\n- You can set Minimum TTL and Maximum TTL \n- There are different headers that can be used to direct cloudfront to use different TTL values:\n  - Cache-Control max-age (seconds)\n  - Cache-Control s-maxage (seconds)\n  - Expires (Date & Time)\n- For all of these, the TTL minimum and maximum will be used instead of the per-object setting if these don't fall in the range \n- Cache invalidations can be performed on a distribution - applies to all edge locations - takes time \n- Takes a path with wildcards to invalidate everything in that path e.g. /images/* or /images/whiskers*\n- Invalidation should only be thought of as a way to correct errors - versioned file names are a good alternative to invalidation \n- versioned file names is not the same as s3 object versioning\n\n### ACM - AWS Certificate Manager\n- HTTP was created as simple and secure\n- Once HTTP evolved, security vulnerabilities became an issue\n- HTTPS - SSL/TLS Layer of Encryption was added to HTTP\n- Data is encrypted in transit\n- Certificates prove identity \n- Chain of trust - signed by a trusted authority \n- ACM can function as a public or private certificate authority (CA) e.g. private can be used in an organisation\n- Private CA - applications need to trust your private CA\n- Public CA - browsers trust a list of providers \n- ACM can generate or import certificates\n- If generated, ACM can auto renew on your behalf\n- If imported, you will have to renew them yourself\n- ACM can be deployed out to supported services\n- Supported AWS services ONLY e.g. cloudfront and ALB but not EC2\n- ACM is a regional service \n- Certs cannot leave the region they are generated or imported in \n- If you want to use a certificate in a service, it MUST be in the same region in ACM\n- there is one exception - cloudfront operates as though within us-east-1 - you need to use this region in ACM\n- S3 does not use ACM for any certificates\n\n### Securing CF and S3 using OAI\n- Origin Access Identity - OAI is a type of identity\n- Associated with cloudfront distribution \n- cloudfront \"becomes\" that OAI\n- OAI can be used in S3 Bucket Policies\n- Uses DENY all BUT one or more OAIs\n- We can deny any access directly to s3 by using an OAI policy - explicit allow for the OAI \n- when we have custom origns we can't use OAI\n\nWith custom origins you can:\n- use custom headers \n- and/or we have the IP ranges used by cloudfront so we can use a custom firewall\n\n### CloudFront - Private Distribution & Behaviours\n- cloudfront can be run in public mode or private mode\n- if its private it needs to be access via cookie or signed url\n- you can have a mixed of multiple behaviours e.g. public or private\n- you need a signer to sign cookies and urls\n- Old way was via a cloudfront key via the account root user - you need to remember the term TRUSTED SIGNER\n- new method is TRUSTED KEY GROUP(s) - you don't need to use the root user.\n\nsigned urls vs signed cookies:\n- urls - provide access to ONE object only\n- use signed urls if your client doesn't support cookies\n- Cookies provides access to groups of objects\n- use cookies for groups of files/all files of a type\n- or if you want to maintain the application url \n\n### Lambda@Edge\n- Allows you to run lightweight lambda functions at edge locations\n- can adjust traffic between the viewer and origin\n- Currently only support node js and python\n- you cannot access any VPC services since its in the public space\n- You can use it for A/B testing to change the viewer request and the url \n- Can use it to migrate between S3 origins e.g. by a weighted value\n- Can use it to customise behaviour based on the type of device the customer is using\n- Vary content by country \n\n### Global Accelerator\n- used to optimise flow of data\n- this is an alternative to cloudfront\n- global accelerators use anycast IP addresses - they allow single IPs to be used in multiple locations\n- when we create a global accelerator, its allocated an anycast IP address\n\nKey Concepts:\n- moves AWS network closer to customers\n- Aims to get users onto the global aws network as quickly and as close to their location as possible\n- its transited over AWS backbone to 1+ location \n- global accelerator is a network product and can be used for non http(s) e.g. TCP/UDP - if you need TCP/UDP you will need global accelerator. \n- cloudfront only caches HTTP, HTTP(S) content \n- GA does not cache anything , its just transmitting network data quickly\n\n\n## ADVANCED VPC Networking\n### VPC Flow Logs\n- Capture metadata (Not contents) e.g. source ip, destination ip, anything to do with flow of data to vpc\n- Can attach a VPC - all ENIs in that VPC\n- Subnet - All ENIs in that subnet\n- ENIs directly\n- they're NOT real time \n- can go to multiple destination - s3 or cloudwatch logs\n- can use athena for querying - ad hoc querying engine\n- A VPC flow logs has different fields e.g. srcaddr, dstaddr, srcport, dstport, protocol,action\n\n### Egress-Only Internet gateway\n- IPV4 addresses are private or public\n- NAT allows private IPs to access public networks \n- Without allowing externally initiated connections (IN)\n- With IPv6, all IPS are public meaning internet gateways allows all IPs IN and OUT\n- Egress-only is outbound-only for IPV6 since NAT does not support this\n\n### VPC Endpoints (Gateway)\n- Provide provide private access to public endpoints. At this point for S3 and DynamoDB\n- They allow a private only resource inside a VPC to access S3 and DynamoDB\n- Normally you would need an internet gateway to the VPC \n- Gateway endpoints allow you to access these services without creating a public infrastructure\n- A prefix list is added to route table for these subnets\n- that means any traffic leaving the subnet goes through the gateway endpoint rather than the internet gateway\n- It's HA across all AZs in a region by default \n- Endpoint policy is used to control what it can access e.g. particular s3 buckets\n- Can only access in same region - can't access cross-region services\n- These prevent leaky buckets - s3 can be set to private only by allowing access ONLY from a gateway endpoint. \n- gateway endpoints are NOT accessible outside the vpc \n\n\n### VPC Endpoints (Inteface)\n- Similar to gateway but the way its done is different\n- Like gateway endpoints, they provide private access to AWS services\n- dynamoDB is still only available using gateway but interface can use s3\n- Allow private IP addressing to access public AWS services\n- interface endpoints are not highly available by default - they are added to specific subnets - ENI\n- One Interface Endpoint should be added to one subnet per AZ for high availability\n- Network access controlled via Security Groups - can't do this with gateway endpoints\n- Endpoint policies can be used to restrict what can be done with the endpoint\n- TCP and IPV4 ONLY\n- Uses PrivateLink\n\n### VPC Peering\n- A service that lets you create a private encrypted network link between two VPCs\n- One peering connection links two and ONLY two vpcs \n- Works same/cross region and same/cross-account\n- Same region peers can reference peer Security Groups\n- VPC Peering does not support transitive peering e.g. A -> B and B -> C does NOT mean A -> C\n\n## HYBRID ENVIRONMENTS AND MIGRATION\n\n### Border Gateway Protocol 101\n- Made up of Autonomous Systems (AS) - Routers controlled by one entity \n- ASN (Autonomous system numbers) are unique and allocated by IANA\n- Reliable and distributed - operates over tcp/179\n- Not automatic - peering is manually configured \n- Path-vector protocol - exchanges the best path to a destination between peers. This path is known as the ASPATH\n- iBGP - Internal BGP - routing within AS\n- eBGP - External BGP - routing between AS\n\n\n### IPSec VPN Fundamentals\n- A group of protocols that aim to set up secure tunnels across insecure networks\n- ...between two peers (local and remote)\n- Provides authentication and is encrypted\n- IPSEC has two main phases:\n  1. IKE Phase 1 - Internet Key Exchange (slow and heavy)\n    - Authenticate \n    - Using asymmetric encryption to agree on \n    - IKE SA created - phase 1 tunnel\n  2. IKE Phase 2 - (fast and agile)\n    - Uses keys agreed in phase 1\n    - Agreed encryption method used\n    - Created IPSEC SA - phase 2 tunnel \n\nPolicy vs route based VPNs:\n- Policy - rule sets match traffic - a pair of SAs\n- route based - target matching (prefix) - matches a single pair of SAs\n\n### AWS Site-to-Site VPN\n- Logical connection between a VPC and an on-premiss network - encrypted using IPSEC, running over public internet\n- Fully HA - if you design and implement correctly\n- Quick to provision - less than an hour\n- Virtual Private Gateway (VGW) - a logical gateway object that can be associated with a single VPC and one or more route tables\n- Customer Gateway (CGW) - logical config in AWS or physical device which it represents\n- VPN connection between VGW and CGW\n\nVPN Consideration:\n- Speed limitation 1.25Gbps\n- Latency - inconsistent\n- Cost - AWS hourly cost, GB out cost, data cap (on premises)\n- Speed of setup is quick and usually quicker than other private connection technologies- hours, all software configuration \n- Can be used as a backup for direct connect (DX) \n- Can be used with Direct Connect (DX)\n\n### Start Direct Connect (DX) Concepts\n- A physical connection into an AWS region - 1,10 or 100 Gbps\n- Business premises => DX location => AWS Region\n- You're given a port allocation at DX location \n- Cost is hourly and outbound data transfer\n- Provisioning time - requires physical cables and there is no resilience as its physical. This could take weeks\n- Low & consistent latency + high speeds\n- Can be used to access AWS Private services - can't be used to access public internet without additional configuration\n- DX location is not owned by AWS but is rented out by it \n\n### Direct Connect (DX) Resilience\n- Direct connect is not resilient, it's a physical connectivity that needs to be architected to be resilient\n- What could go wrong:\n  - DX location could fail e.g. power failure\n  - DX Router \n  - Cross Connect - it'sa cable\n  - Customer DX router, \n  - Extension\n  - Customer premises\n  - Customer router\n\nWe can add resilience by:\n- Separate customer premises buildings - with separate routers\n- Several DX locations\n- Adding separate ports in each DX locations as well as premisses locations \n\n### Direct Connect (DX) - Public VIF + VPN (Encryption)\n- Using a VPN gives you an encrypted and authenticated tunnel\n- OVer DX you will get low latency & consistency latency\n- This uses a public VIF\n- VPJ is transit agnostic - DX/Public internet\n- Public VIFs+IPSec VPN is a way to provide access to private VPC resources, using an encrypted IPSEC tunnel for transit.\n\n\n### Transit Gateway\n- A network transit hub which connects VPCs to each other and to on premises networks using site to site VPNs and direct connect\n- It's designed to reduce network complexity\n- It's a single network object - HA & Scalable\n- You create attachments to other network types\n- attachments - VPC, Site to site VPN and DX gateway\n- Supports transitive routing \n- Can be used to create global networks\n- Share transit gateways between accounts using AWS RAM\n- you can peer different regions on same or cross accounts\n- It offers much less complexity than without TGW\n\n### Storage Gateway - Volume\n- Runs as a virtual machine on premises (although can be ordered as hardware appliance)\n- presents storage using iSCSI, NFS or SMB\n- Integrates with EBS, s3 and glacier\n- used for migrations, extensions, storage tier-ing, DR and replacement of backup systems \n- When you're using volume storage in volume stored mode everything is stored locally\n- It asynchronously syncs to storage gateway endpoint which stores EBS snapshots in an s3 bucket\n- if you need full disk backups and DR, this is not the right solution\n- Volume cached mode - instead of local storage, it has a local cache but it stores all data in s3. The AWS bucket is an aws managed area so its not available to just look at \n- the main difference between Volume stored vs volume cached is the location of the data\n- volume cache uses aws as the primary location \n\n\n### Storage Gateway - Tape (VTL)\n- tapes - LTO - storing to tapes\n- this really only allows write as a whole or read as a whole as editing tapes is not really possible\n  \n### Storage Gateway - File\n- File bridges on premises file storage and s3\n- you create mount points (shares) available via NFS or SMB \n- they map directly onto an S3 bucket\n- files stored into a mount point are visible as objects in an s3 bucket\n- does read/write caching and ensures LAN-like performance\n\n\n### Snowball / Edge / Snowmobile \n- Designed to move large amounts of data in and out of AWS\n- The devices in this series are big physical storage\n- You can either order them empty, load and return \n- or order with data, empty and return \n\nSnowball:\n- ordered from AWS \n- data encrypted using KMS\n- 50tb or 80tb capacity\n- 1GBPS or 10GBPS network\n- 10TB to 10PB of data transfer most economical - you can order multiple devices\n- You can move the devices to multiple premises\n- only storage is included in the device\n\nSnowball edge:\n- Comes with storage and compute \n- Larger capacity\n- 10gbs, 10/25, 45/50/100 - faster network\n- storage optimized with EC2 \n- Compute optimized variant - for aggressive compute requirements\n- Compute with GPU \n- Snowball is older, snowball edge is ideal for remote sites where data processing on ingestion is needed \n\nSnowmobile:\n- Portable data center within a shipping container on a truck\n- ideal for single location when 10+ PB is required\n- up to 100PB per snowmobile\n- It's a single truck - not economical for multi site (unless huge) or sub 10pb\n\n### Directory Service\ndirectories:\n- store objects within a structure (domain/tree)\n- multiple trees can be grouped into a forest\n- Microsoft active directory domain service (AD DS) is a common implementation\n  \n- Directory Service is AWS managed implementation\n- Runs within a VPC\n-  Provides HA - deploys within multiple AZs\n-  some aws services need a directory e.g. amazon workplaces \n-  can be isolated directory or integrated with existing on-premises \n-  or act as a proxy back to on premises\n\nIt can function in 3 modes:\n- Simple AD - an implementation of Samba 4\n- AWS Managed Microsoft AD - an actual microsoft AD DS implementation\n- AD Connector which proxies requests back to an on premises directory \n\n- Start off with simple AD\n- Move to Microsoft AD if applications in AWS need MS DS or you need a trust relationship with AD DS\n- If you need a directory without storing any directory info in the cloud - use AD Connector \n\n### DataSync\n- A data transfer service to transfer data into and out of AWS\n- Designed to work at huge scale\n- Keeps metadata (e.g. permissions and timestamps)\n- Built in data validation\n- Scalable - 10gbps per agent (~ 100TB per day)\n- can use bandwith limiters\n- incremental and scheduled transfer options\n- supports compression and encryption\n- automatic recovery\n- service integration - S3, EFS, FSx\n- Pay as you use\n\n### FSx for Windows Servers\n- fully managed native windows file servers/shares\n- designed for integration with windows environments\n- can integrate with directory service or self managed AD\n- Resilient and HA - single or multi AZ within a VPC\n- on demand and scheduled backups\n- Accessible over VPC, peering, DX\n- Highly performant\n- VSS - User driven restores - unique to Fsx - can do this without a sys admin\n- Native file system accessible over SMB \n- Uses windows permission model\n- Supports DFS\n- Managed - no file server admin\n- can be integrated with DS and your own directory\n\n### FSx For Lustre\n- Managed implementation of Lustre - designed for HPC - Linux clients (POSIX)\n- For machine learning, big data, financial model\n- can scale to 100s GBs throughput and sub millisecond latency\n- Deployment types:\n  - scratch - highly optimised for short term, fast\n  - persistent - longer term, HA in one AZ and self healing\n- Available over a VPN or DX\n- Metadata is stored on metadata targets\n- objects are stored on object storage targets\n- baseline performance based on size \n- Use scratch for short term or temp workloads - NO HA, NO REPLICATION\n- persistent has replication but within ONE AZ only\n- Auto heals when hardware failure occurs\n- You can backup to S3 with both\n\n### AWS Transfer Family\n- Provides managed file transfer service - supports transfers to and from s3 and efs\n- provides managed \"servers\"\nProtocols used:\n  - FTP\n  - FTPS \n  - SSH (SFTP)\n  - AS2 - B2B data\n- Create servers / endpoints:\n  - public - via aws  - SFTP\n  - VPC - internet - SFTP, FTPS, AS2\n  - VPC - internal - SFTP, FTP, FTPS, AS2 \n- Multi az \n- provisioned server per hour + data transfered\n- FTP and FTPS - directory service or custom IDP only\n- FTP - VPC only (cannot be public)\n- AS2 - VPC internal/internet only\n\n## SECURITY, DEPLOYMENT & OPERATIONS\n### AWS Secrets Manager\n- Shares functionality with parameter store\n- designed specifically for secrets e.g. passwords, api keys\n- Usable via console, cli, api or sdks\n- supports automatic rotation \n- directly integrates with some aws products e.g. rds\n\n### Application Layer (L7) Firewall\n\nNormal Firewalls (layer 3/4/5):\n- layer 3-4 requests to/from are seen as different streams of data\n- with layer 5, using a session, the two requests can be seen as one\n- each of these don't understand anything above the layer they operate at e.g. they cannot see HTTP, they just see general packet data\n- layer 7 fix many of these limitations\n\nLayer 7:\n- Layer 7 firewalls are aware of layer 7 protocl e.g. HTTP\n- can identify normal or abnormal requests and attacks\n\n### Web Application Firewall (WAF), WEBACLs, Rule Groups and Rules\n- A web application firewall that helps protect your web applications or APIs against common web exploits and bots\n- Outputs logs\n- A protection pack (web ACL) gives you fine-grained control over all of the HTTP(S) web requests that your protected resource responds to\n\nWeb ACL:\n- Controls what traffic is allowed or blocked - (ALLOW or BLOCK)\n- Resource type - cloudfront or regional service \n- Have to add rule groups or rules processed in order\n- WCU - acl capacity units - default is 1500 but can be increased via support tickets\n- WebACLS are associated with resources , this can take some time\n- Adjusting an existing WEBACL can take less time than creating a new one\n\nRule groups:\n- rule groups contain rules\n- No default actions - thats defined when added to webacls\n- managed by aws, you, services owned\n- Can be reused by multiple webACLS\n- You have to define the WCU capacity upfront (max 1500*)\n\nWAF Rules:\n- Type, Statement, Action\n- Regular or Rate-based (e.g. x100 in a 5 minute period)\n- Statement: WHAT to match or COUNT\n- Action: Allow, block, count, captcha and custom responses\n\n- WebACL - monthly $5/month\n- Rule - $1 / month\n- Requests - monthly $0.6/million\n- Intelligent threat mitigation: bot control ($10/month) & $1/1 mil requests\n- Captcha, fraud control, marketplace groups extra costs\n\n### AWS Shield\n- Standard and Advance - DDOS Protection\n- Shield is free and advanced has a cost\n- Network volumetric attacks (L3) - Saturate Capacity\n- Network Protocol Attacks (L4) - TCP SYN FLood\n- ...Leave connections open, prevent new ones\n- Application Layer Attacks (L7) e.g. web request floods\n\nStandard:\n- Free\n- Protection at the perimeter at region/vpc or at AWS edge\n- Common network (L3) or Transport (L4)\n- Best protection using r53, cloudfront, aws global accelerator \n\n\nAdvanced:\n- $3000 per month per org - 1 year lock in\n- Protects CF, R53, Accelerator, anything associated with EIPS (ec2), ALBS, CLBs, NLBs\n- not automatic - must be explicitly enabled \n- Cost protection for unmitigated attacks e.g. ec2 scaling\n- Proactive engagement & aws shield response team will contact you when attacks are detected\n- Integrates with WAF\n- Application Layer 7 ddos protection\n- real time visibility of DDOS events and attacks\n- Health based detection \n- Protection groups\n\n### CloudHSM\n- with KMS its AWS managed. It's a shared service which means other AWS accounts use it \n- CloudHSM - a true Single Tenant hardware security module (HSM)\n- AWS Provision but its fully customer managed\n- Fully FIPS 140-2 Level 3 compliant (KMS is l3 overall some l3)\n- CloudHSM has to be accessed via industry standard APIs - pks#11, java cryptography extensions JCE, microsoft cryptoNG (CNG) libraries\n- KMS can use cloudhsm as a custom key store and cloudhsm integration with KMS\n- Deployed on a cloud VPC you have no visibility of\n- AWS CloudHSM client needs to be installed on the VPC devices to be accessed\n\nUse cases:\n- No native integration e.g. no s3, SSE\n- Offload the SSL/TLS processing for web servers - more economical and efficient than doing on a general purpose ec2 instance\n- enable transparent data encryption (TDE) for oracle databases\n- protect the private keys for an issuing certificate authority (CA)\n\nFor anything that requires aws integration then cloudHSM is not suitable \n\n### AWS Config\n- A service which records config changes over time on resources\n- For auditing of changes, compliance with standards\n- does not prevent changes happening - no protection\n- Regional service - supports cross region and account aggregation\n- Can generate SNS notifications and near real time events via event bridge and lambda\n- Config rules can be used to evaluate resources and determining whether their non-compliant\n\n### Amazon Macie\n- data security and data privacy service\n- Discover, monitor and protect data stored in S3 buckets\n- Automated discovery of data i.e. PII, PHI, Finance\n- Managed data identifiers - build-in using ML/Patterns\n- Custom data identifiers - proprietary - regex based\n- Integrates - with security hub & finding events to event bridge\n- Uses a multi account architecture - centrally managed ether via aws ORG or one macie account inviting\n\nIdentifiers:\n- Managed via AWS:\n  - via a growing list of common sensitive data types e.g. credentials, finance, health, personal identifiers\n- Custom - created by you\n  - regex\n  - Keywords - optional sequences \n  - Maximum match distance\n  - ignore words\n\nFindings:\n- Policy or sensitive data findings\n- Policy e.g. S3BlockPublicAccessDisabled/EncryptionDIsabled/BucketSharedExternally etc...\n- Sensitive data - S3Object/Credentials, S3Object/CustomIdentifiers, S3Object/Financial etc...\n\n### Amazon Inspector\n- Designed to check EC2 instances and the instances OS\n- Provides report ordered by severity\n- Network assessment (agentless)\n- Network and Host assessment (agent)\n- Rules package - network reachability (no agent required)\n- Agent can provide additional OS visibility\n- Check reachability end to end\n- Packages - Host assessments, agent required:\n  - common vulnerabilities and exposures (CVE)\n  - Center for internet security (CIS) benchmarks\n  - Security best practices for amazon inspector e.g. password complexity checks","n":0.006}}},{"i":36,"$":{"0":{"v":"CQRS","n":1},"1":{"v":"\n## Command and Query Responsibility Segregation\n\nCQRS means to segrate the responsibility between commands (write requests) and queries (read requests).\n\nCommands and queries don't need to be run on separate databases, only the responsibility and behaviours should be separate within the code. Different databases can be used to optimize reads or writes according to needs.\n\nCommands are events that took place in the domain. They are usually named with past-participle verbs e.g. OrderConfirmed\n\nCommands are requests for changes to the domain. They are usually named with a verb e.g. ConfirmOrder\n\nCommands and events are just data structures with no behaviour. They are called \"Data Transfer Objects\" (DTOs).\n\nAggregates are a larger unit of encapsulation that handles commands, applies events and have a state model encapsulated within that allows it to implement the required command validation.\n\nA command handler receives a command and brokers a result from the appropriate aggregate.\n\n#### Event sourcing\n\nStoring all the changes (events) to the system rather than just its current state.\n\nEvent sourcing is not a requirement to do CQRS but it works well with it.\n","n":0.076}}},{"i":37,"$":{"0":{"v":"Agile","n":1},"1":{"v":"\nThe ability to respond to **change**.\n\nAgile software development is iterative, focusing on small increments and evolving requirements.\n\nAgile development refers to any development process that is aligned with the concepts of the Agile [[agile.manifesto]]\n","n":0.174}}},{"i":38,"$":{"0":{"v":"Shape Up","n":0.707},"1":{"v":"\nNotes from the book (https://basecamp.com/shapeup) outlining the Shape Up methodology\n\n## Introduction\n\nShape up at a high level:\n\n- Work in **six-week cycles**\n- Shape up the work before giving it to a team. A senior group defines the key elements of the solution before it's considered ready to bet on. The solution should be concrete enough so that teams know what to do, yet abstract enough that they have room to work out the interesting details themselves\n- Give full responsibility to a small integrated team of designers and developers. Seniors spend less time managing teams as they autonomously work to define their own tasks, make adjustments to scope and work to build vertical slices.\n\n### Principles of Shaping\n\n- Shape up work at the right level of abstraction: not too vague and not too concrete.\n- Wireframes are too concrete\n- Words are too abstract - projects defined in too few words are not clear\n\n#### Steps to Shaping\n\n1. Set boundaries - figure out how much time the raw idea is worth and how to define the problem\n2. Rough out the elements - sketch a solution at a higher level of abstraction than Wireframes\n3. Address risks and rabbit holes - amend the solution, cut things out of it or specify details at certain spots\n4. Write the pitch - Once it's ready to bet on, we package it in a formal write-up called a \"pitch\". The pitch summarizes the problems, constraints, solution, rabbit holes and limitations.\n\n### Set Boundaries\n\n- Setting the appetite - this is the time budget for a standard team size. It can be either a Small batch which means its something that can be built in 1-2 weeks, or a Big Batch which takes a full six-weeks. This is assuming the team is one designer and 1-2 programmers.\n- Fixed time, variable scope - an appetite and estimate aren't the same. Estimates start with a design and end with a number. Appetites start with a number and end with a design. Fixed time, variable scope, means to decide what is core to the project and what is peripheral or unnecessary.\n- Good is relative - there is no \"best\" solution. The amount of time we set for our appetite is going to lead us to different solutions.\n- Responding to raw ideas - when we get new ideas, it's too early to commit and put into backlog. We need to give it space to learn whether it's important or what it might entail.\n- Narrow down the problem - flip from asking \"what could we build?\" to \"What's really going wrong?\". We need to narrow down the problem so that a complex request is not taken at face value.\n\nWatch out for grab bags - unclear ideas like \"redesign\" or \"refactorings\" that aren't driven by a single problem or use case.\n\n### Finding the Elements\n\n#### Move at the right speed\n\n1. Either we work alone or with a trusted partner who can keep pace with us\n2. Avoid the wrong level of detail in the drawings and sketches\n\nWork by hand using a couple of prototyping techniques: breadboarding and fat marker stretches:\n\n**Breadboarding** - a breadboard is an electrical engineering prototype that has all the components and wiring of a real device. There are three basic things we draw:\n\n1. Places: things we can navigate to like screens, dialogues or menus that pop up\n2. Affordances: things the user can act on like buttons and fields and copies.\n3. Connection lines: show how the affordances take the user from place to place\n\nWe do the above with words instead of pictures. For example, breadboarding customers turning off auto pay:\n\n![Breadboarding autopay invoice example](./assets/images/breadboarding-invoice.png)\n\n**Fat marker sketches** - A sketch made with such broad strokes that adding detail is difficult or impossible. You can do this with a larger tipped sharpie pen on paper or an iPad with a pen size at the largest diameter. Because ideas are sometimes visual, breadboarding would miss the point.\n\n![Fat marker sketch of a todo list](./assets/images/fat-marker-sketch.png)\n\n### Risks and Rabbit Holes\n","n":0.039}}},{"i":39,"$":{"0":{"v":"Manifesto","n":1},"1":{"v":"\nTODO\n","n":1}}}]}
